wezm/dslite2svd/svd/cc2650f128-vendor.xml
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Texas Instruments</vendor>
  <vendorID>TI</vendorID>
  <name>CC2650F128</name>
  <series>SimpleLink Wireless MCU</series>
  <version>1</version>
  <description>SimpleLink(TM) multi-protocol CC2650 wireless MCU for 2.4 GHz applications</description>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <peripherals>
    <!-- overlay/cc2650f128-interrupts.xml -->
    <peripheral>
      <name>_INTERRUPTS</name>
      <baseAddress>0</baseAddress>
      <interrupt>
        <name>GPIO</name>
        <description>GPIO edge detect</description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>I2C</name>
        <description>I2C</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>RFC_PE0</name>
        <description>RF Core and packet engine 1</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>AON_RTC</name>
        <description>AON RTC</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>UART0</name>
        <description>UART0</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>UART1</name>
        <description>UART1</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>SSI0</name>
        <description>SSI0</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>SSI1</name>
        <description>SSI1</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>RFC_PE1</name>
        <description>RF Core and packet engine 2</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>RFC</name>
        <description>RF Core hardware</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>RFC_CA</name>
        <description>RF command acknowledge</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>I2S</name>
        <description>I2S</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>WDT</name>
        <description>Watchdog timer</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>GPT0A</name>
        <description>GPTimer 0A</description>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>GPT0B</name>
        <description>GPTimer 0B</description>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>GPT1A</name>
        <description>GPTimer 1A</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>GPT1B</name>
        <description>GPTimer 1B</description>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>GPT2A</name>
        <description>GPTimer 2A</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>GPT2B</name>
        <description>GPTimer 2B</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>GPT3A</name>
        <description>GPTimer 3A</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>GPT3B</name>
        <description>GPTimer 3B</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>CRYPTO</name>
        <description>Crypto</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>UDMA</name>
        <description>μDMA software defined</description>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>UDMA_ERR</name>
        <description>μDMA error</description>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>FLASH</name>
        <description>Flash</description>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>SWE0</name>
        <description>Software event 0</description>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>AUX_CE</name>
        <description>AUX combined event</description>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>AON_EVENT</name>
        <description>AON programmable event</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>DYN_EVENT</name>
        <description>Dynamic programmable event</description>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>AUX_COMPA</name>
        <description>AUX comparator A</description>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>AUX_MISC</name>
        <description>AUX ADC new sample available or ADC DMA done, ADC underflow and overflow</description>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>TRNG</name>
        <description>True random number generator</description>
        <value>33</value>
      </interrupt>
    </peripheral>
    <!-- ../Modules/CC26xx/CC2650/AON_BATMON.xml -->
    <peripheral>
      <name>AON_BATMON</name>
      <description>Always On (AON) Battery And Temperature MONitor (BATMON) residing in the AON domain  Note: This module only supports 32 bit Read/Write access from MCU.  </description>
      <baseAddress>0x40095000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>CTL</name>
          <displayName>CTL</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CALC_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MEAS_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEASCFG</name>
          <displayName>MEASCFG</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PER</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_32CYC</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16CYC</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8CYC</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONT</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMPP0</name>
          <displayName>TEMPP0</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMPP1</name>
          <displayName>TEMPP1</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMPP2</name>
          <displayName>TEMPP2</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED5</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>5</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BATMONP0</name>
          <displayName>BATMONP0</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BATMONP1</name>
          <displayName>BATMONP1</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IOSTRP0</name>
          <displayName>IOSTRP0</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG2</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHPUMPP0</name>
          <displayName>FLASHPUMPP0</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>9</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FALLB</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIGHLIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOWLIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BAT</name>
          <displayName>BAT</displayName>
          <description>Last Measured Battery Voltage

This register may be read while BATUPD.STAT = 1

</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED11</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>11</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>INT</name>
              <description>Integer part:

0x0: 0V + fractional part
...
0x3: 3V + fractional part
0x4: 4V + fractional part

</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FRAC</name>
              <description>Fractional part, standard binary fractional encoding.

0x00: .0V
...
0x20: 1/8 = .125V
0x40: 1/4 = .25V
0x80: 1/2 = .5V
...
0xA0: 1/2 + 1/8 = .625V
...
0xFF: Max

</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BATUPD</name>
          <displayName>BATUPD</displayName>
          <description>Battery Update

