wezm/dslite2svd/svd/cc2650f128-vendor.xml
AON Event Source selecting 1 of 3 events routed to AON_WUC for waking up the AUX domain from Power Off or Power Down.
Note:  
</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No event, always low</description>
                  <value>0x3f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB_ASYNC_N</name>
                  <description>Comparator B not triggered. Asynchronous signal directly from AUX Comparator B (inverted) as opposed to AUX_COMPB which is synchronized in AUX</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB_ASYNC</name>
                  <description>Comparator B triggered. Asynchronous signal directly from the AUX Comparator B as opposed to AUX_COMPB which is synchronized in AUX</description>
                  <value>0x37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATMON_VOLT</name>
                  <description>BATMON voltage update event</description>
                  <value>0x36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATMON_TEMP</name>
                  <description>BATMON temperature update event</description>
                  <value>0x35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER1_EV</name>
                  <description>AUX Timer 1 Event</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER0_EV</name>
                  <description>AUX Timer 0 Event</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TDC_DONE</name>
                  <description>TDC completed or timed out</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_DONE</name>
                  <description>ADC conversion completed</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB</name>
                  <description>Comparator B triggered</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPA</name>
                  <description>Comparator A triggered</description>
                  <value>0x2f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SWEV2</name>
                  <description>AUX Software triggered event #2. Triggered by AUX_EVCTL:SWEVSET.SWEV2</description>
                  <value>0x2e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SWEV1</name>
                  <description>AUX Software triggered event #1. Triggered by AUX_EVCTL:SWEVSET.SWEV1</description>
                  <value>0x2d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SWEV0</name>
                  <description>AUX Software triggered event #0. Triggered by AUX_EVCTL:SWEVSET.SWEV0</description>
                  <value>0x2c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JTAG</name>
                  <description>JTAG generated event</description>
                  <value>0x2b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_UPD</name>
                  <description>RTC Update Tick (16 kHz signal, i.e. event line toggles value every 32 kHz clock period)</description>
                  <value>0x2a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_COMB_DLY</name>
                  <description>RTC combined delayed event</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH2_DLY</name>
                  <description>RTC channel 2 - delayed event</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH1_DLY</name>
                  <description>RTC channel 1 - delayed event</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH0_DLY</name>
                  <description>RTC channel 0 - delayed event</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH2</name>
                  <description>RTC channel 2 event</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH1</name>
                  <description>RTC channel 1 event</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH0</name>
                  <description>RTC channel 0 event</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD</name>
                  <description>Edge detect on any PAD</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD31</name>
                  <description>Edge detect on PAD31</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD30</name>
                  <description>Edge detect on PAD30</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD29</name>
                  <description>Edge detect on PAD29</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD28</name>
                  <description>Edge detect on PAD28</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD27</name>
                  <description>Edge detect on PAD27</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD26</name>
                  <description>Edge detect on PAD26</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD25</name>
                  <description>Edge detect on PAD25</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD24</name>
                  <description>Edge detect on PAD24</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD23</name>
                  <description>Edge detect on PAD23</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD22</name>
                  <description>Edge detect on PAD22</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD21</name>
                  <description>Edge detect on PAD21</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD20</name>
                  <description>Edge detect on PAD20</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD19</name>
                  <description>Edge detect on PAD19</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD18</name>
                  <description>Edge detect on PAD18</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD17</name>
                  <description>Edge detect on PAD17</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD16</name>
                  <description>Edge detect on PAD16</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD15</name>
                  <description>Edge detect on PAD15</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD14</name>
                  <description>Edge detect on PAD14</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD13</name>
                  <description>Edge detect on PAD13</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD12</name>
                  <description>Edge detect on PAD12</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD11</name>
                  <description>Edge detect on PAD11</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD10</name>
                  <description>Edge detect on PAD10</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD9</name>
                  <description>Edge detect on PAD9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD8</name>
                  <description>Edge detect on PAD8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD7</name>
                  <description>Edge detect on PAD7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD6</name>
                  <description>Edge detect on PAD6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD5</name>
                  <description>Edge detect on PAD5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD4</name>
                  <description>Edge detect on PAD4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD3</name>
                  <description>Edge detect on PAD3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD2</name>
                  <description>Edge detect on PAD2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD1</name>
                  <description>Edge detect on PAD1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD0</name>
                  <description>Edge detect on PAD0</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVTOMCUSEL</name>
          <displayName>EVTOMCUSEL</displayName>
          <description>Event Selector For MCU Event Fabric 

This register contains pointers for 3 AON events that are routed to the MCU Event Fabric EVENT
</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED22</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>22</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>AON_PROG2_EV</name>
              <description>Event selector for AON_PROG2 event.

