wezm/dslite2svd/svd/cc2650f128-vendor.xml
      </registers>
    </peripheral>
    <!-- ../Modules/CC26xx/CC2650/AON_IOC.xml -->
    <peripheral>
      <name>AON_IOC</name>
      <description>Always On (AON) IO Controller  - controls IO operation when the MCU IO Controller (IOC) is powered off and resides in the AON domain.  Note: This module only supports 32 bit Read/Write access from MCU.  </description>
      <baseAddress>0x40094000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>IOSTRMIN</name>
          <displayName>IOSTRMIN</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>3</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GRAY_CODE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IOSTRMED</name>
          <displayName>IOSTRMED</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>3</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GRAY_CODE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IOSTRMAX</name>
          <displayName>IOSTRMAX</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>3</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GRAY_CODE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCLATCH</name>
          <displayName>IOCLATCH</displayName>
          <description>IO Latch Control

Controls transparency of all latches holding I/O or configuration state from the MCU IOC</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EN</name>
              <description>Controls latches between MCU IOC and AON_IOC.

The latches are transparent by default.

They must be closed prior to power off the domain(s) controlling the IOs in order to preserve IO values on external pins.
</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRANSP</name>
                  <description>Latches are transparent, meaning the value of the IO is directly controlled by the GPIO or peripheral value</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATIC</name>
                  <description>Latches are static, meaning the current value on the IO pin is frozen by latches and kept even if GPIO module or a peripheral module is turned off</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK32KCTL</name>
          <displayName>CLK32KCTL</displayName>
          <description>SCLK_LF External Output Control

</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>OE_N</name>
              <description>0: Output enable active. SCLK_LF output on IO pin that has PORT_ID (e.g. IOC:IOCFG0.PORT_ID) set to AON_CLK32K.
1: Output enable not active

</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
