wezm/dslite2svd/svd/cc2650f128-vendor.xml
      </registers>
    </peripheral>
    <!-- ../Modules/CC26xx/CC2650/AON_RTC.xml -->
    <peripheral>
      <name>AON_RTC</name>
      <description>This component control the Real Time Clock residing in AON

Note: This module is only supporting 32 bit ReadWrite access. 
</description>
      <baseAddress>0x40092000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>CTL</name>
          <displayName>CTL</displayName>
          <description>Control

This register contains various  bitfields for configuration of RTC</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED19</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>19</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>COMB_EV_MASK</name>
              <description>Eventmask selecting which delayed events that form the combined event.

</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH2</name>
                  <description>Use Channel 2 delayed event in combined event</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1</name>
                  <description>Use Channel 1 delayed event in combined event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH0</name>
                  <description>Use Channel 0 delayed event in combined event</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No event is selected for combined event.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV_DELAY</name>
              <description>Number of SCLK_LF clock cycles waited before generating delayed events. (Common setting for all RTC cannels)  the delayed event is delayed
</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D144</name>
                  <description>Delay by 144 clock cycles</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D128</name>
                  <description>Delay by 128 clock cycles</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D112</name>
                  <description>Delay by 112 clock cycles</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D96</name>
                  <description>Delay by 96 clock cycles</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D80</name>
                  <description>Delay by 80 clock cycles</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D64</name>
                  <description>Delay by 64 clock cycles</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D48</name>
                  <description>Delay by 48 clock cycles</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D32</name>
                  <description>Delay by 32 clock cycles</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D16</name>
                  <description>Delay by 16 clock cycles</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D8</name>
                  <description>Delay by 8 clock cycles</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D4</name>
                  <description>Delay by 4 clock cycles</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D2</name>
                  <description>Delay by 2 clock cycles</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D1</name>
                  <description>Delay by 1 clock cycles</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D0</name>
                  <description>No delay on delayed event</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESET</name>
              <description>RTC Counter reset.

Writing 1 to this bit will reset the RTC counter.

This bit is cleared when reset takes effect</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>3</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RTC_4KHZ_EN</name>
              <description>RTC_4KHZ is a 4 KHz reference output, tapped from  SUBSEC.VALUE  bit 19 which is used by AUX timer. 

0: RTC_4KHZ signal is forced to 0
1: RTC_4KHZ is enabled ( provied that RTC is enabled EN)

</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC_UPD_EN</name>
              <description>RTC_UPD is a 16 KHz signal used to sync up the radio timer. The 16 Khz is SCLK_LF divided by 2

0: RTC_UPD signal is forced to 0
1: RTC_UPD signal is toggling @16 kHz

</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Enable RTC counter

0: Halted (frozen)
1: Running

</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVFLAGS</name>
          <displayName>EVFLAGS</displayName>
          <description>Event Flags, RTC Status

