wezm/dslite2svd/svd/cc2650f128-vendor.xml
The case where WU_FROM_SD is asserted but this bitfield is not asserted will only occur in a debug session. The boot code will not proceed with wakeup from SHUTDOWN procedure until this bitfield is asserted as well.

Note: This flag can not be cleared and will therefor remain valid untill poweroff/reset
</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOT_DET_1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOT_DET_0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VDDS_LOSS_EN_OVR</name>
              <description>Override of VDDS_LOSS_EN

0: Brown out detect of VDDS is ignored, unless VDDS_LOSS_EN=1
1: Brown out detect of VDDS generates system reset (regardless of  VDDS_LOSS_EN)

This bit can be locked
</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VDDR_LOSS_EN_OVR</name>
              <description>Override of VDDR_LOSS_EN

0: Brown out detect of VDDR is ignored, unless VDDR_LOSS_EN=1
1: Brown out detect of VDDR generates system reset (regardless of  VDDR_LOSS_EN)

This bit can be locked
</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VDD_LOSS_EN_OVR</name>
              <description>Override of VDD_LOSS_EN

0: Brown out detect of VDD is ignored, unless VDD_LOSS_EN=1
1: Brown out detect of VDD generates system reset (regardless of  VDD_LOSS_EN)

This bit can be locked
</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED8</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VDDS_LOSS_EN</name>
              <description>Controls reset generation in case VDDS is lost

0: Brown out detect of VDDS is ignored, unless VDDS_LOSS_EN_OVR=1
1: Brown out detect of VDDS generates system reset 

</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VDDR_LOSS_EN</name>
              <description>Controls reset generation in case VDDR is lost 

0: Brown out detect of VDDR is ignored, unless VDDR_LOSS_EN_OVR=1
1: Brown out detect of VDDR generates system reset

</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VDD_LOSS_EN</name>
              <description>Controls reset generation in case VDD is lost

0: Brown out detect of VDD is ignored, unless VDD_LOSS_EN_OVR=1
1: Brown out detect of VDD generates system reset

</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_LOSS_EN</name>
              <description>Controls reset generation in case SCLK_LF is lost.  (provided that clock loss detection is enabled by DDI_0_OSC:CTL0.CLK_LOSS_EN)

Note: Clock loss reset generation must be disabled before SCLK_LF clock source is changed in  DDI_0_OSC:CTL0.SCLK_LF_SRC_SEL and remain disabled untill the change is confirmed in DDI_0_OSC:STAT0.SCLK_LF_SRC. Failure to do so may result in a spurious system reset. Clock loss reset generation can be disabled through this bitfield or by clearing  DDI_0_OSC:CTL0.CLK_LOSS_EN
 
0: Clock loss is ignored
1: Clock loss generates system reset

</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_SRC</name>
              <description>Shows the source of the last system reset:
Occurrence of one of the reset sources may trigger several other reset sources as essential parts of the system are undergoing reset. This field will report the root cause of the reset (not the other resets that are consequence of the system reset). 
To support this feature the actual register is not captured before the reset source being released. If a new reset source is triggered, in a window of four  32 kHz periods after the previous has been released,  this register may indicate Power on reset as source.

</description>
              <lsb>1</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WARMRESET</name>
                  <description>Software reset via PRCM warm reset request</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSRESET</name>
                  <description>Software reset via SYSRESET register</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_LOSS</name>
                  <description>Clock loss detect</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDR_LOSS</name>
                  <description>Brown out detect on VDDR</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD_LOSS</name>
                  <description>Brown out detect on VDD</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDS_LOSS</name>
                  <description>Brown out detect on VDDS</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN_RESET</name>
                  <description>Reset pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR_ON</name>
                  <description>Power on reset</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLEEPCTL</name>
          <displayName>SLEEPCTL</displayName>
          <description>Sleep Mode

This register is used to unfreeze the IO pad ring after waking up from SHUTDOWN
</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>IO_PAD_SLEEP_DIS</name>
              <description>Controls the I/O pad sleep mode. The boot code will set this bitfield automatically unless waking up from a SHUTDOWN ( RESETCTL.WU_FROM_SD is set ).  

0: I/O pad sleep mode is enabled, ie all pads are latched and can not toggle.
1: I/O pad sleep mode is disabled

Application software may want to reconfigure the state for all IO's before setting this bitfield upon waking up from a SHUTDOWN.

</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
