wezm/dslite2svd/svd/cc2650f128-vendor.xml
This register contains power management related bitfields for the MCU domain.</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED18</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>18</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VIRT_OFF</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FIXED_WU_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>4</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SRAM_RET_EN</name>
              <description>MCU SRAM is partitioned into 4 banks . This register controls which of the banks that has retention during MCU power off
</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RET_FULL</name>
                  <description>Retention on for all banks (SRAM:BANK0, SRAM:BANK1 ,SRAM:BANK2 and SRAM:BANK3) </description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RET_LEVEL3</name>
                  <description>Retention on for SRAM:BANK0, SRAM:BANK1 and SRAM:BANK2 </description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RET_LEVEL2</name>
                  <description>Retention on for SRAM:BANK0 and SRAM:BANK1 </description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RET_LEVEL1</name>
                  <description>Retention on for SRAM:BANK0 </description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RET_NONE</name>
                  <description>Retention is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXCFG</name>
          <displayName>AUXCFG</displayName>
          <description>AUX Configuration

This register contains power management related signals for the AUX domain.</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_RET_EN</name>
              <description>This bit controls retention mode for the AUX_RAM:BANK0:

0: Retention is disabled
1: Retention is enabled

NB: If retention is disabled, the AUX_RAM will be powered off when it would otherwise be put in retention mode
</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXCTL</name>
          <displayName>AUXCTL</displayName>
          <description>AUX Control

This register contains events and control signals for the AUX domain.
</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESET_REQ</name>
              <description>Reset request for AUX. Writing 1 to this register will assert reset to AUX. The reset will be held until the bit is cleared again.

0: AUX reset pin will be deasserted
1: AUX reset pin will be asserted

</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>3</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SCE_RUN_EN</name>
              <description>Enables (1) or disables (0) AUX_SCE execution. AUX_SCE execution will begin when AUX Domain is powered and either this or AUX_SCE:CTL.CLK_EN is set. 

Setting this bit will assure that AUX_SCE execution starts as soon as AUX power domain is woken up. (  AUX_SCE:CTL.CLK_EN will be reset to 0 if AUX power domain has been off)

0: AUX_SCE execution will be disabled if AUX_SCE:CTL.CLK_EN is 0
1: AUX_SCE execution is enabled.

</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SWEV</name>
              <description>Writing 1 sets the software event to the AUX domain, which can be read through AUX_WUC:WUEVFLAGS.AON_SW.

This event is normally cleared by AUX_SCE through the AUX_WUC:WUEVCLR.AON_SW. It can also be cleared by writing 0 to this register.

