wezm/dslite2svd/svd/cc2650f128-vendor.xml
This bit can only be cleared by writing a 1 to it
</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MCU_WARM_RESET</name>
              <description>Indicates type of last MCU Voltage Domain reset:

0: Last MCU reset was not a warm reset
1: Last MCU reset was a warm reset (requested from MCU or JTAG as indicated in MCU_RESET_SRC)

This bit can only be cleared by writing a 1 to it
</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RECHARGECFG</name>
          <displayName>RECHARGECFG</displayName>
          <description>Recharge Controller Configuration

This register sets all relevant patameters for controlling the recharge algorithm. 
</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADAPTIVE_EN</name>
              <description>Enable adaptive recharge

Note: Recharge can be turned completely of by setting MAX_PER_E=7 and MAX_PER_M=31 and this bitfield to 0
</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED24</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>24</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>C2</name>
              <description>Gain factor for adaptive recharge algorithm

period_new=period * ( 1+/-(2^-C1+2^-C2) )
Valid values for C2 is 2 to 10

Note: Rounding may cause adaptive recharge not to start for very small values of both Gain and Initial period. Criteria for algorithm to start is MAX(PERIOD*2^-C1,PERIOD*2^-C2) &gt;= 1</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>C1</name>
              <description>Gain factor for adaptive recharge algorithm

period_new=period * ( 1+/-(2^-C1+2^-C2) )
Valid values for C1 is 1 to 10

Note: Rounding may cause adaptive recharge not to start for very small values of both Gain and Initial period. Criteria for algorithm to start is MAX(PERIOD*2^-C1,PERIOD*2^-C2) &gt;= 1</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MAX_PER_M</name>
              <description>This register defines the maximum period that the recharge algorithm can take, i.e. it defines  the maximum number of cycles between 2 recharges.
The maximum number of cycles is specified with a 5 bit mantissa and 3 bit exponent:
MAXCYCLES=(MAX_PER_M*16+15)*2^MAX_PER_E
This field sets the mantissa of MAXCYCLES
</description>
              <lsb>11</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MAX_PER_E</name>
              <description>This register defines the maximum period that the recharge algorithm can take, i.e. it defines  the maximum number of cycles between 2 recharges.
The maximum number of cycles is specified with a 5 bit mantissa and 3 bit exponent:
MAXCYCLES=(MAX_PER_M*16+15)*2^MAX_PER_E
This field sets the exponent MAXCYCLES
</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PER_M</name>
              <description>Number of 32 KHz clocks between activation of recharge controller
For recharge algorithm, PERIOD is the initial period when entering powerdown mode. The adaptive recharge algorithm will not change this register
PERIOD will effectively be a 16 bit value coded in a 5 bit mantissa and 3 bit exponent:
This field sets the Mantissa of the Period.
PERIOD=(PER_M*16+15)*2^PER_E
</description>
              <lsb>3</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PER_E</name>
              <description>Number of 32 KHz clocks between activation of recharge controller
For recharge algorithm, PERIOD is the initial period when entering powerdown mode. The adaptive recharge algorithm will not change this register
PERIOD will effectively be a 16 bit value coded in a 5 bit mantissa and 3 bit exponent:
This field sets the Exponent of the Period.  
PERIOD=(PER_M*16+15)*2^PER_E
</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RECHARGESTAT</name>
          <displayName>RECHARGESTAT</displayName>
          <description>Recharge Controller Status

This register controls various status registers which are updated during recharge.  The register is mostly intended for test and debug.
</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED20</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>20</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VDDR_SMPLS</name>
              <description>The last 4 VDDR samples, bit 0 being the newest.

The register is being updated in every recharge period with a shift left, and bit 0 is updated with the last VDDR sample, ie a 1 is shiftet in in case VDDR &gt; VDDR_threshold just before recharge starts. Otherwise a 0 will be shifted in. 

</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MAX_USED_PER</name>
              <description>The maximum value of recharge period seen with VDDR&gt;threshold.

The VDDR voltage is compared against the threshold voltage at  just before  each recharge. If VDDR is above threshold, MAX_USED_PER is updated with max ( current recharge peride; MAX_USED_PER )  This way MAX_USED_PER can track the recharge period where VDDR is decharged to the threshold value. We can therefore use the value as an indication of the leakage current during recharge.

This bitfield is cleared to 0 when writing this register.
</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCFG</name>
          <displayName>OSCCFG</displayName>
          <description>Oscillator Configuration

This register sets the period for Amplitude compensation requests sent to the oscillator control system. The amplitude compensations is only applicable when XOSC_HF is running in low power mode. </description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>8</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PER_M</name>
              <description>Number of 32 KHz clocks between oscillator amplitude calibrations.
When this counter expires, an oscillator amplitude compensation is triggered immediately in Active mode. When this counter expires in Powerdown mode an internal flag is set such that the amplitude compensation is postponed until the next recharge occurs.

The Period will effectively be a 16 bit value coded in a 5 bit mantissa and 3 bit exponent
PERIOD=(PER_M*16+15)*2^PER_E
This field sets the mantissa
Note: Oscillator amplitude calibration is turned of when both this bitfield and PER_E are set to 0
</description>
              <lsb>3</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PER_E</name>
              <description>Number of 32 KHz clocks between oscillator amplitude calibrations.
When this counter expires, an oscillator amplitude compensation is triggered immediately in Active mode. When this counter expires in Powerdown mode an internal flag is set such that the amplitude compensation is postponed until the next recharge occurs.
The Period will effectively be a 16 bit value coded in a 5 bit mantissa and 3 bit exponent
PERIOD=(PER_M*16+15)*2^PER_E
This field sets the exponent
Note: Oscillator amplitude calibration is turned of when both  PER_M and this bitfield are set to 0
</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JTAGCFG</name>
          <displayName>JTAGCFG</displayName>
          <description>JTAG Configuration

This register contains control for configuration of the JTAG domain,- hereunder access permissions for each TAP. </description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>9</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>JTAG_PD_FORCE_ON</name>
              <description>Controls JTAG PowerDomain power state:

