wezm/dslite2svd/svd/cc2650f128-vendor.xml
0: Controlled exclusively by debug subsystem. (JTAG Powerdomain will be powered off unless a debugger is attached)
1: JTAG Power Domain is forced on, independent of debug subsystem.

NB: The reset value causes JTAG Power Domain to be powered on by default. Software must clear this bit to turn off the JTAG Power Domain
</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JTAGUSERCODE</name>
          <displayName>JTAGUSERCODE</displayName>
          <description>JTAG USERCODE

Boot code copies the JTAG USERCODE to this register from where it is forwarded to the debug subsystem.</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USER_CODE</name>
              <description>32-bit JTAG USERCODE register feeding main JTAG TAP
NB: This field can be locked
</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- ../Modules/CC26xx/CC2650/ADI_4_AUX.xml -->
    <peripheral>
      <name>AUX_ADI4</name>
      <description>Configuration registers controlling analog peripherals of AUX. Registers Fields should be considered static unless otherwise noted (as dynamic)</description>
      <baseAddress>0x400CB000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x200</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>MUX0</name>
          <displayName>MUX0</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPA_REF</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCVREFP</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDS</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSS</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOUPL</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NC</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX1</name>
          <displayName>MUX1</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>COMPA_IN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUXIO0</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO1</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO2</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO3</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO4</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO5</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO6</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO7</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NC</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX2</name>
          <displayName>MUX2</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADCCOMPB_IN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>3</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDS</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSS</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOUPL</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATEST1</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATEST0</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NC</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPB_REF</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDS</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSS</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOUPL</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NC</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX3</name>
          <displayName>MUX3</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADCCOMPB_IN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUXIO0</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO1</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO2</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO3</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO4</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO5</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO6</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO7</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NC</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ISRC</name>
          <displayName>ISRC</displayName>
          <description>Current Source

