wezm/dslite2svd/svd/cc2650f128-vendor.xml
Strength and trim control for current source. Only to be used through TI provided API.</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TRIM</name>
              <description>Adjust current from current source.

Output currents may be combined to get desired total current.</description>
              <lsb>2</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_11P75U</name>
                  <description>11.75 uA</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4P5U</name>
                  <description>4.5 uA</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2P0U</name>
                  <description>2.0 uA</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1P0U</name>
                  <description>1.0 uA</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_0P5U</name>
                  <description>0.5 uA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_0P25U</name>
                  <description>0.25 uA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NC</name>
                  <description>No current connected</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Current source enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP</name>
          <displayName>COMP</displayName>
          <description>Comparator

Control COMPA and COMPB comparators. Only to be used through TI provided API.</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>COMPA_REF_RES_EN</name>
              <description>Enables 400kohm resistance from COMPA reference node to ground. Used with COMPA_REF_CURR_EN to generate voltage reference for cap-sense.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPA_REF_CURR_EN</name>
              <description>Enables 2uA IPTAT current from ISRC to COMPA reference node. Requires ISRC.EN = 1. Used with COMPA_REF_RES_EN to generate voltage reference for cap-sense.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPB_TRIM</name>
              <description>COMPB voltage reference trim temperature coded:</description>
              <lsb>3</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Divide reference by 4</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV3</name>
                  <description>Divide reference by 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Divide reference by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>No reference division</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPB_EN</name>
              <description>COMPB enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPA_EN</name>
              <description>COMPA enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX4</name>
          <displayName>MUX4</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>COMPA_REF</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUXIO0</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO1</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO2</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO3</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO4</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO5</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO6</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO7</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NC</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC0</name>
          <displayName>ADC0</displayName>
          <description>ADC Control 0

ADC Sample Control. Only to be used through TI provided API.</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SMPL_MODE</name>
              <description>ADC Sampling mode:

