wezm/dslite2svd/svd/cc2650f128-vendor.xml
You must enable the digital input buffer for AUXIO[8i+n] to read the pin value in GPIODIN.  
You must disable the digital input buffer for analog input or pins that float to avoid current leakage. </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- ../Modules/CC26xx/CC2650/AUX_AIODIO.xml -->
    <peripheral derivedFrom="AUX_AIODIO0">
      <name>AUX_AIODIO1</name>
      <baseAddress>0x400C2000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/CC26xx/CC2650/AUX_ANAIF.xml -->
    <peripheral>
      <name>AUX_ANAIF</name>
      <description>AUX Analog Peripheral Control Module

</description>
      <baseAddress>0x400C9000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>ADCCTL</name>
          <displayName>ADCCTL</displayName>
          <description>ADC Control

Configuration of ADI_4_AUX:ADC0.SMPL_MODE decides if the ADC trigger starts sampling or conversion.</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED14</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>14</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>START_POL</name>
              <description>Select active polarity for START_SRC event.</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Set ADC trigger on falling edge of event source.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Set ADC trigger on rising edge of event source.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START_SRC</name>
              <description>Select ADC trigger event source from the asynchronous AUX event bus.

Set START_SRC to NO_EVENT&lt;n&gt; if you want to trigger the ADC manually through ADCTRIG.START.</description>
              <lsb>8</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_IRQ</name>
                  <description>AUX_EVCTL:EVSTAT1.ADC_IRQ</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCU_EV</name>
                  <description>AUX_EVCTL:EVSTAT1.MCU_EV</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLK_REF</name>
                  <description>AUX_EVCTL:EVSTAT1.ACLK_REF</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO15</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO15</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO14</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO14 </description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO13</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO13 </description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO12</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO12 </description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO11</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO11</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO10</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO10</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO9</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO9  </description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO8</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO8  </description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO7</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO7  </description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO6</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO6  </description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO5</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO5  </description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO4</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO4  </description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO3</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO3  </description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO2</name>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO2</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO1</name>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO1</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO0</name>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO0</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_PROG_WU</name>
                  <description>AUX_EVCTL:EVSTAT0.AON_PROG_WU</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_SW</name>
                  <description>AUX_EVCTL:EVSTAT0.AON_SW</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EVENT1</name>
                  <description>No event.</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EVENT0</name>
                  <description>No event.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED1</name>
                  <description>Reserved - Do not use.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED0</name>
                  <description>Reserved - Do not use.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMPH_AUTOTAKE_DONE</name>
                  <description>AUX_EVCTL:EVSTAT0.SMPH_AUTOTAKE_DONE</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER1_EV</name>
                  <description>AUX_EVCTL:EVSTAT0.TIMER1_EV</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER0_EV</name>
                  <description>AUX_EVCTL:EVSTAT0.TIMER0_EV</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TDC_DONE</name>
                  <description>AUX_EVCTL:EVSTAT0.TDC_DONE</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB</name>
                  <description>AUX_EVCTL:EVSTAT0.AUX_COMPB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPA</name>
                  <description>AUX_EVCTL:EVSTAT0.AUX_COMPA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH2_EV</name>
                  <description>AUX_EVCTL:EVSTAT0.AON_RTC_CH2</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>2</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CMD</name>
              <description>ADC interface command.

Non-enumerated values are not supported. The written value is returned when read.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLUSH</name>
                  <description>Flush ADC FIFO.

You must set CMD to EN or DIS after flush.

