wezm/dslite2svd/svd/cc2650f128-vendor.xml
00: RCOSC_HF derived (31.25kHz)
01: XOSC_HF derived (31.25kHz)
10: RCOSC_LF (32kHz)
11: XOSC_LF (32.768kHz)</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SPARE4</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SCLK_LF_SRC_SEL</name>
              <description>Source select for sclk_lf</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XOSCLF</name>
                  <description>Low frequency XOSC</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCOSCLF</name>
                  <description>Low frequency RCOSC</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSCHFDLF</name>
                  <description>Low frequency clock derived from High Frequency XOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCOSCHFDLF</name>
                  <description>Low frequency clock derived from High Frequency RCOSC</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCLK_MF_SRC_SEL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XCOSCHFDMF</name>
                  <description>Medium frequency clock derived from high frequency XOSC.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCOSCHFDMF</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCLK_HF_SRC_SEL</name>
              <description>Source select for sclk_hf.  XOSC option is supported for test and debug only and should be used when the XOSC_HF is running.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XOSC</name>
                  <description>High frequency XOSC clk</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCOSC</name>
                  <description>High frequency RCOSC clock</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL1</name>
          <displayName>CTL1</displayName>
          <description>Control 1
This register contains OSC_DIG configuration</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED23</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>23</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RCOSCHFCTRIMFRACT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>18</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RCOSCHFCTRIMFRACT_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SPARE2</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>2</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>XOSC_HF_FAST_START</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RADCEXTCFG</name>
          <displayName>RADCEXTCFG</displayName>
          <description>RADC External Configuration

</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HPM_IBIAS_WAIT_CNT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>22</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>LPM_IBIAS_WAIT_CNT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>IDAC_STEP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RADC_DAC_TH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RADC_MODE_IS_SAR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AMPCOMPCTL</name>
          <displayName>AMPCOMPCTL</displayName>
          <description>Amplitude Compensation Control

</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPARE31</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>AMPCOMP_REQ_MODE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>AMPCOMP_FSM_UPDATE_RATE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>29</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_250KHZ</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_500KHZ</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1MHZ</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2MHZ</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AMPCOMP_SW_CTRL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>AMPCOMP_SW_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED24</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIAS_OFFSET</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIAS_INIT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>LPM_IBIAS_WAIT_CNT_FINAL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP_STEP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIASCAP_HPTOLP_OL_CNT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AMPCOMPTH1</name>
          <displayName>AMPCOMPTH1</displayName>
          <description>Amplitude Compensation Threshold 1
This register contains threshold values for amplitude compensation algorithm

</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPARE24</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HPMRAMP3_LTH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>18</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SPARE16</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HPMRAMP3_HTH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>10</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIASCAP_LPTOHP_OL_CNT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HPMRAMP1_TH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AMPCOMPTH2</name>
          <displayName>AMPCOMPTH2</displayName>
          <description>Amplitude Compensation Threshold 2
This register contains threshold values for amplitude compensation algorithm.

</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LPMUPDATE_LTH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>26</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SPARE24</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>LPMUPDATE_HTH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>18</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SPARE16</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_COMP_AMPTH_LPM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>10</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SPARE8</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_COMP_AMPTH_HPM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>2</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SPARE0</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANABYPASSVAL1</name>
          <displayName>ANABYPASSVAL1</displayName>
          <description>Analog Bypass Values 1
</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED20</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>20</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>XOSC_HF_ROW_Q12</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>XOSC_HF_COLUMN_Q12</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANABYPASSVAL2</name>
          <displayName>ANABYPASSVAL2</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED14</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>14</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>XOSC_HF_IBIASTHERM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ATESTCTL</name>
          <displayName>ATESTCTL</displayName>
          <description>Analog Test Control

</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPARE30</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SCLK_LF_AUX_EN</name>
              <description>Enable 32 kHz clock to AUX_COMPB.

</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDOUBLERNANOAMPCTL</name>
          <displayName>ADCDOUBLERNANOAMPCTL</displayName>
          <description>ADC Doubler Nanoamp Control

</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>25</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NANOAMP_BIAS_ENABLE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SPARE23</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>6</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SH_MODE_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SH_VBUF_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_IREF_CTRL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XOSCHFCTL</name>
          <displayName>XOSCHFCTL</displayName>
          <description>XOSCHF Control

