wezm/dslite2svd/svd/cc2650f128-vendor.xml
</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED10</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>10</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PEAK_DET_ITRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED7</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED5</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_BUF_ITRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>2</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_BUF_ITRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LFOSCCTL</name>
          <displayName>LFOSCCTL</displayName>
          <description>Low Frequency Oscillator Control

</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>XOSCLF_REGULATOR_TRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>XOSCLF_CMIRRWR_RATIO</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>18</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED10</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>10</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RCOSCLF_RTUNE_TRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_6P0MEG</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6P5MEG</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_7P0MEG</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_7P5MEG</name>
                  <description>Internal. Only to be used through TI provided API.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCOSCLF_CTUNE_TRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCOSCHFCTL</name>
          <displayName>RCOSCHFCTL</displayName>
          <description>RCOSCHF Control

</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RCOSCHF_CTRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT0</name>
          <displayName>STAT0</displayName>
          <description>Status 0
This register contains status signals from OSC_DIG

</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPARE31</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SCLK_LF_SRC</name>
              <description>Indicates source for the sclk_lf
</description>
              <lsb>29</lsb>
              <msb>30</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XOSCLF</name>
                  <description>Low frequency XOSC</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCOSCLF</name>
                  <description>Low frequency RCOSC</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSCHFDLF</name>
                  <description>Low frequency clock derived from High Frequency XOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCOSCHFDLF</name>
                  <description>Low frequency clock derived from High Frequency RCOSC</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCLK_HF_SRC</name>
              <description>Indicates source for the sclk_hf
</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XOSC</name>
                  <description>High frequency XOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCOSC</name>
                  <description>High frequency RCOSC clock</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED23</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>23</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RCOSC_HF_EN</name>
              <description>RCOSC_HF_EN</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RCOSC_LF_EN</name>
              <description>RCOSC_LF_EN</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>XOSC_LF_EN</name>
              <description>XOSC_LF_EN</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_DCDC_RDY</name>
              <description>CLK_DCDC_RDY</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_DCDC_RDY_ACK</name>
              <description>CLK_DCDC_RDY_ACK</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SCLK_HF_LOSS</name>
              <description>Indicates sclk_hf is lost</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SCLK_LF_LOSS</name>
              <description>Indicates sclk_lf is lost</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>XOSC_HF_EN</name>
              <description>Indicates that XOSC_HF is enabled.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED14</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>XB_48M_CLK_EN</name>
              <description>Indicates that the 48MHz clock from the  DOUBLER is enabled.

It will be enabled if 24 or 48 MHz crystal is used (enabled in doubler bypass for the 48MHz crystal).</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>XOSC_HF_LP_BUF_EN</name>
              <description>XOSC_HF_LP_BUF_EN</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>XOSC_HF_HP_BUF_EN</name>
              <description>XOSC_HF_HP_BUF_EN</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_THMET</name>
              <description>ADC_THMET</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_DATA_READY</name>
              <description>indicates when adc_data is ready. </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_DATA</name>
              <description>adc_data</description>
              <lsb>1</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDINGSCLKHFSWITCHING</name>
              <description>Indicates when sclk_hf is ready to be switched</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT1</name>
          <displayName>STAT1</displayName>
          <description>Status 1
This register contains status signals from OSC_DIG

</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RAMPSTATE</name>
              <description>AMPCOMP FSM State</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAST_START_SETTLE</name>
                  <description>FAST_START_SETTLE</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAST_START</name>
                  <description>FAST_START</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUMMY_TO_INIT_1</name>
                  <description>DUMMY_TO_INIT_1</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDAC_DEC_W_MEASURE</name>
                  <description>IDAC_DECREMENT_WITH_MEASURE</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IBIAS_INC</name>
                  <description>IBIAS_INCREMENT</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_UPDATE</name>
                  <description>LPM_UPDATE</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IBIAS_DEC_W_MEASURE</name>
                  <description>IBIAS_DECREMENT_WITH_MEASURE</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IBIAS_CAP_UPDATE</name>
                  <description>IBIAS_CAP_UPDATE</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDAC_INCREMENT</name>
                  <description>IDAC_INCREMENT</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_UPDATE</name>
                  <description>HPM_UPDATE</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_RAMP3</name>
                  <description>HPM_RAMP3</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_RAMP2</name>
                  <description>HPM_RAMP2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_RAMP1</name>
                  <description>HPM_RAMP1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INITIALIZATION</name>
                  <description>INITIALIZATION</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>RESET</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPM_UPDATE_AMP</name>
              <description>OSC amplitude during HPM_UPDATE state.
When amplitude compensation of XOSC_HF is enabled in high performance mode, this value is the amplitude of the crystal oscillations measured by the on-chip oscillator ADC, divided by 15 mV.  For example, a value of 0x20 would indicate that the amplitude of the crystal is approximately 480 mV.  To enable amplitude compensation, AON_WUC OSCCFG must be set to a non-zero value.

</description>
              <lsb>22</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>LPM_UPDATE_AMP</name>
              <description>OSC amplitude during LPM_UPDATE state
When amplitude compensation of XOSC_HF is enabled in low power mode, this value is the amplitude of the crystal oscillations measured by the on-chip oscillator ADC, divided by 15 mV.  For example, a value of 0x20 would indicate that the amplitude of the crystal is approximately 480 mV.  To enable amplitude compensation, AON_WUC OSCCFG must be set to a non-zero value.

</description>
              <lsb>16</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FORCE_RCOSC_HF</name>
              <description>force_rcosc_hf</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SCLK_HF_EN</name>
              <description>SCLK_HF_EN</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SCLK_MF_EN</name>
              <description>SCLK_MF_EN</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ACLK_ADC_EN</name>
              <description>ACLK_ADC_EN</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ACLK_TDC_EN</name>
              <description>ACLK_TDC_EN</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ACLK_REF_EN</name>
              <description>ACLK_REF_EN</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_CHP_EN</name>
              <description>CLK_CHP_EN</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_DCDC_EN</name>
              <description>CLK_DCDC_EN</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SCLK_HF_GOOD</name>
              <description>SCLK_HF_GOOD</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SCLK_MF_GOOD</name>
              <description>SCLK_MF_GOOD</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SCLK_LF_GOOD</name>
              <description>SCLK_LF_GOOD</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ACLK_ADC_GOOD</name>
              <description>ACLK_ADC_GOOD</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ACLK_TDC_GOOD</name>
              <description>ACLK_TDC_GOOD</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ACLK_REF_GOOD</name>
              <description>ACLK_REF_GOOD</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_CHP_GOOD</name>
              <description>CLK_CHP_GOOD</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_DCDC_GOOD</name>
              <description>CLK_DCDC_GOOD</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT2</name>
          <displayName>STAT2</displayName>
          <description>Status 2
This register contains status signals from AMPCOMP FSM

