wezm/dslite2svd/svd/cc2650f128-vendor.xml
To manually trigger vector 3 execution:
- AUX_SCE must sleep.
- Set VEC3_EV to a known static value.
- Toggle VEC3_POL twice.</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Falling edge triggers vector 3 execution.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Rising edge triggers vector 3 execution.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VEC3_EN</name>
              <description>Vector 3 trigger enable.

When enabled, VEC3_EV event with VEC3_POL polarity triggers a jump to vector # 3 when AUX_SCE sleeps.

Lower vectors (0, 1, and 2) have priority.</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable vector 3 trigger.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable vector 3 trigger.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VEC3_EV</name>
              <description>Select vector 3 trigger source event.</description>
              <lsb>8</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_IRQ</name>
                  <description>EVSTAT1.ADC_IRQ</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCU_EV</name>
                  <description>EVSTAT1.MCU_EV</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLK_REF</name>
                  <description>EVSTAT1.ACLK_REF</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO15</name>
                  <description>EVSTAT1.AUXIO15</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO14</name>
                  <description>EVSTAT1.AUXIO14 </description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO13</name>
                  <description>EVSTAT1.AUXIO13 </description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO12</name>
                  <description>EVSTAT1.AUXIO12 </description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO11</name>
                  <description>EVSTAT1.AUXIO11</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO10</name>
                  <description>EVSTAT1.AUXIO10</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO9</name>
                  <description>EVSTAT1.AUXIO9  </description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO8</name>
                  <description>EVSTAT1.AUXIO8  </description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO7</name>
                  <description>EVSTAT1.AUXIO7  </description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO6</name>
                  <description>EVSTAT1.AUXIO6  </description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO5</name>
                  <description>EVSTAT1.AUXIO5  </description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO4</name>
                  <description>EVSTAT1.AUXIO4  </description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO3</name>
                  <description>EVSTAT1.AUXIO3  </description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO2</name>
                  <description>EVSTAT0.AUXIO2</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO1</name>
                  <description>EVSTAT0.AUXIO1</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO0</name>
                  <description>EVSTAT0.AUXIO0</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_PROG_WU</name>
                  <description>EVSTAT0.AON_PROG_WU</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_SW</name>
                  <description>EVSTAT0.AON_SW</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBSMUX1</name>
                  <description>EVSTAT0.OBSMUX1</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBSMUX0</name>
                  <description>EVSTAT0.OBSMUX0</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_FIFO_ALMOST_FULL</name>
                  <description>EVSTAT0.ADC_FIFO_ALMOST_FULL</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DONE</name>
                  <description>EVSTAT0.ADC_DONE</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMPH_AUTOTAKE_DONE</name>
                  <description>EVSTAT0.SMPH_AUTOTAKE_DONE</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER1_EV</name>
                  <description>EVSTAT0.TIMER1_EV</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER0_EV</name>
                  <description>EVSTAT0.TIMER0_EV</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TDC_DONE</name>
                  <description>EVSTAT0.TDC_DONE</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB</name>
                  <description>EVSTAT0.AUX_COMPB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPA</name>
                  <description>EVSTAT0.AUX_COMPA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_CH2</name>
                  <description>EVSTAT0.AON_RTC_CH2</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED7</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VEC2_POL</name>
              <description>Vector 2 trigger event polarity.

