wezm/dslite2svd/svd/cc2650f128-vendor.xml
0: Exclude.
1: Include.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPH_AUTOTAKE_DONE</name>
              <description>EVTOMCUFLAGS.SMPH_AUTOTAKE_DONE contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_EV</name>
              <description>EVTOMCUFLAGS.TIMER1_EV contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_EV</name>
              <description>EVTOMCUFLAGS.TIMER0_EV contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TDC_DONE</name>
              <description>EVTOMCUFLAGS.TDC_DONE contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>AUX_COMPB</name>
              <description>EVTOMCUFLAGS.AUX_COMPB contribution to the AUX_COMB event.

0: Exclude
1: Include.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>AUX_COMPA</name>
              <description>EVTOMCUFLAGS.AUX_COMPA contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>AON_WU_EV</name>
              <description>EVTOMCUFLAGS.AON_WU_EV contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VECFLAGS</name>
          <displayName>VECFLAGS</displayName>
          <description>Vector Flags

If a vector flag becomes 1 and AUX_SCE sleeps, AUX_SCE will wake up and execute the corresponding vector. The vector with the lowest index will execute first if multiple vectors flags are set. AUX_SCE must return to sleep to execute the next vector.

During execution of a vector, AUX_SCE must clear the vector flag that triggered execution. Write 1 to bit index n in VECFLAGSCLR to clear vector flag n.</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>4</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VEC3</name>
              <description>Vector flag 3.

The vector flag is set if the edge selected VECCFG1.VEC3_POL occurs on the event selected in VECCFG1.VEC3_EV.

The flag is cleared by writing a 0 to this bit, or (preferably) a 1 to VECFLAGSCLR.VEC3.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VEC2</name>
              <description>Vector flag 2.

The vector flag is set if the edge selected VECCFG1.VEC2_POL occurs on the event selected in VECCFG1.VEC2_EV.

The flag is cleared by writing a 0 to this bit, or (preferably) a 1 to VECFLAGSCLR.VEC2.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VEC1</name>
              <description>Vector flag 1.

The vector flag is set if the edge selected VECCFG0.VEC1_POL occurs on the event selected in VECCFG0.VEC1_EV.

The flag is cleared by writing a 0 to this bit, or (preferably) a 1 to VECFLAGSCLR.VEC1.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VEC0</name>
              <description>Vector flag 0.

The vector flag is set if the edge selected VECCFG0.VEC0_POL occurs on the event selected in VECCFG0.VEC0_EV.

The flag is cleared by writing a 0 to this bit, or (preferably) a 1 to VECFLAGSCLR.VEC0.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVTOMCUFLAGSCLR</name>
          <displayName>EVTOMCUFLAGSCLR</displayName>
          <description>Events To MCU Flags Clear

Clear event flags in EVTOMCUFLAGS. 

In order to clear a level sensitive event flag, the event must be deasserted. </description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED11</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>11</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_IRQ</name>
              <description>Write 1 to clear EVTOMCUFLAGS.ADC_IRQ.

Read value is 0.</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>OBSMUX0</name>
              <description>Write 1 to clear EVTOMCUFLAGS.MCU_OBSMUX0.

Read value is 0.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_FIFO_ALMOST_FULL</name>
              <description>Write 1 to clear EVTOMCUFLAGS.ADC_FIFO_ALMOST_FULL.

Read value is 0.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DONE</name>
              <description>Write 1 to clear EVTOMCUFLAGS.ADC_DONE.

Read value is 0.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>SMPH_AUTOTAKE_DONE</name>
              <description>Write 1 to clear EVTOMCUFLAGS.SMPH_AUTOTAKE_DONE.

Read value is 0.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER1_EV</name>
              <description>Write 1 to clear EVTOMCUFLAGS.TIMER1_EV.

Read value is 0.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER0_EV</name>
              <description>Write 1 to clear EVTOMCUFLAGS.TIMER0_EV.

Read value is 0.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>TDC_DONE</name>
              <description>Write 1 to clear EVTOMCUFLAGS.TDC_DONE.

Read value is 0.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>AUX_COMPB</name>
              <description>Write 1 to clear EVTOMCUFLAGS.AUX_COMPB.

Read value is 0.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>AUX_COMPA</name>
              <description>Write 1 to clear EVTOMCUFLAGS.AUX_COMPA.

Read value is 0.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>AON_WU_EV</name>
              <description>Write 1 to clear EVTOMCUFLAGS.AON_WU_EV.

Read value is 0.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVTOAONFLAGSCLR</name>
          <displayName>EVTOAONFLAGSCLR</displayName>
          <description>Events To AON Clear

Clear event flags in EVTOAONFLAGS. 

In order to clear a level sensitive event flag, the event must be deasserted. </description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>9</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER1_EV</name>
              <description>Write 1 to clear EVTOAONFLAGS.TIMER1_EV.

Read value is 0.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER0_EV</name>
              <description>Write 1 to clear EVTOAONFLAGS.TIMER0_EV.

Read value is 0.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>TDC_DONE</name>
              <description>Write 1 to clear EVTOAONFLAGS.TDC_DONE.

Read value is 0.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DONE</name>
              <description>Write 1 to clear EVTOAONFLAGS.ADC_DONE.

Read value is 0.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>AUX_COMPB</name>
              <description>Write 1 to clear EVTOAONFLAGS.AUX_COMPB.

Read value is 0.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>AUX_COMPA</name>
              <description>Write 1 to clear EVTOAONFLAGS.AUX_COMPA.

Read value is 0.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>SWEV2</name>
              <description>Write 1 to clear EVTOAONFLAGS.SWEV2.

Read value is 0.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>SWEV1</name>
              <description>Write 1 to clear EVTOAONFLAGS.SWEV1.

Read value is 0.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>SWEV0</name>
              <description>Write 1 to clear EVTOAONFLAGS.SWEV0.

Read value is 0.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VECFLAGSCLR</name>
          <displayName>VECFLAGSCLR</displayName>
          <description>Vector Flags Clear

