wezm/dslite2svd/svd/cc2650f128-vendor.xml
      </registers>
    </peripheral>
    <!-- ../Modules/CC26xx/CC2650/AUX_SMPH.xml -->
    <peripheral>
      <name>AUX_SMPH</name>
      <description>AUX Semaphore Controller

</description>
      <baseAddress>0x400C8000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>SMPH0</name>
          <displayName>SMPH0</displayName>
          <description>Semaphore 0</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Request or release of semaphore.

Request by read:

0: Semaphore not available.
1: Semaphore granted.

Release by write:

0: Do not use.
1: Release semaphore.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH1</name>
          <displayName>SMPH1</displayName>
          <description>Semaphore 1</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Request or release of semaphore.

Request by read:

0: Semaphore not available.
1: Semaphore granted.

Release by write:

0: Do not use.
1: Release semaphore.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH2</name>
          <displayName>SMPH2</displayName>
          <description>Semaphore 2</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Request or release of semaphore.

Request by read:

0: Semaphore not available.
1: Semaphore granted.

Release by write:

0: Do not use.
1: Release semaphore.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH3</name>
          <displayName>SMPH3</displayName>
          <description>Semaphore 3</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Request or release of semaphore.

Request by read:

0: Semaphore not available.
1: Semaphore granted.

Release by write:

0: Do not use.
1: Release semaphore.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH4</name>
          <displayName>SMPH4</displayName>
          <description>Semaphore 4</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Request or release of semaphore.

Request by read:

0: Semaphore not available.
1: Semaphore granted.

Release by write:

0: Do not use.
1: Release semaphore.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH5</name>
          <displayName>SMPH5</displayName>
          <description>Semaphore 5</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Request or release of semaphore.

Request by read:

0: Semaphore not available.
1: Semaphore granted.

Release by write:

0: Do not use.
1: Release semaphore.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH6</name>
          <displayName>SMPH6</displayName>
          <description>Semaphore 6</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Request or release of semaphore.

Request by read:

0: Semaphore not available.
1: Semaphore granted.

Release by write:

0: Do not use.
1: Release semaphore.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH7</name>
          <displayName>SMPH7</displayName>
          <description>Semaphore 7</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Request or release of semaphore.

Request by read:

0: Semaphore not available.
1: Semaphore granted.

Release by write:

0: Do not use.
1: Release semaphore.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTOTAKE</name>
          <displayName>AUTOTAKE</displayName>
          <description>Auto Take

