wezm/dslite2svd/svd/cc2650f128-vendor.xml
Sticky Request for Single Semaphore.</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>3</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SMPH_ID</name>
              <description>Write the semaphore ID,0x0-0x7, to SMPH_ID to request this semaphore until it is granted. 

When semaphore SMPH_ID is granted, event  AUX_EVCTL:EVSTAT0.AUX_SMPH_AUTOTAKE_DONE becomes 1. 

The event becomes 0 when software releases the semaphore or writes a new value to SMPH_ID.

To avoid corrupted semaphores: 
- Usage of this functionality must be restricted to one CPU core. 
- Software must wait until AUX_EVCTL:EVSTAT0.AUX_SMPH_AUTOTAKE_DONE is 1 before it writes a new value to SMPH_ID. </description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- ../Modules/CC26xx/CC2650/AUX_TDC.xml -->
    <peripheral>
      <name>AUX_TDCIF</name>
      <description>AUX Time To Digital Converter

</description>
      <baseAddress>0x400C4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>CTL</name>
          <displayName>CTL</displayName>
          <description>Control</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CMD</name>
              <description>TDC commands.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>write-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABORT</name>
                  <description>Force TDC state machine back to IDLE state.

Never write this command while AUX_TDC:STAT.STATE equals CLR_CNT or WAIT_CLR_CNT_DONE.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Asynchronous counter start.

The counter starts to count when the start event is high. To achieve precise edge-to-edge measurements you must ensure that the start event is low for at least 420 ns after you write this command. </description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_SYNC_START</name>
                  <description>Synchronous counter start.

The counter looks for the opposite edge of the selected start event before it starts to count when the selected edge occurs. This guarantees an edge-triggered start and is recommended for frequency measurements.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_RESULT</name>
                  <description>Clear STAT.SAT, STAT.DONE, and RESULT.VALUE. 

This is not needed as prerequisite for a measurement. Reliable clear is only guaranteed from IDLE state.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <displayName>STAT</displayName>
          <description>Status</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>8</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SAT</name>
              <description>TDC measurement saturation flag.

0: Conversion has not saturated.
1: Conversion stopped due to saturation.

This field is cleared when a new measurement is started or when CLR_RESULT is written to CTL.CMD.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DONE</name>
              <description>TDC measurement complete flag.

0: TDC measurement has not yet completed.
1: TDC measurement has completed.

This field clears when a new TDC measurement starts or when you write CLR_RESULT to CTL.CMD.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STATE</name>
              <description>TDC state machine status.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_STOP</name>
                  <description>Current state is TDC_FORCESTOP.
You wrote ABORT to CTL.CMD to abort the TDC measurement.</description>
                  <value>0x2e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START_FALL</name>
                  <description>Current state is TDC_WAIT_STARTFALL. 
The fast-counter circuit waits for a falling edge on the start event.</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_CLR_CNT_DONE</name>
                  <description>Current state is TDC_STATE_WAIT_CLRCNT_DONE. 
The state machine waits for fast-counter circuit to finish reset.</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR</name>
                  <description>Current state is TDC_STATE_POR. 
This is the reset state.</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GET_RESULT</name>
                  <description>Current state is TDC_STATE_GETRESULTS.
The state machine copies the counter value from the fast-counter circuit.</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_STOP_CNTDWN</name>
                  <description>Current state is TDC_STATE_WAIT_STOPCNTDOWN.
The fast-counter circuit looks for the stop condition. It will ignore a number of stop events configured in TRIGCNTLOAD.CNT.</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_STOP</name>
                  <description>Current state is TDC_STATE_WAIT_STOP.
The state machine waits for the fast-counter circuit to stop.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_CNT</name>
                  <description>Current state is TDC_STATE_CLRCNT. The fast-counter circuit is reset.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Current state is TDC_STATE_IDLE. 
This is the default state after reset and abortion. State will change when you write CTL.CMD to either RUN_SYNC_START or RUN.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_START_STOP_CNT_EN</name>
                  <description>Current state is TDC_STATE_WAIT_STARTSTOPCNTEN.
The fast-counter circuit looks for the start condition. The state machine waits for the fast-counter to increment.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_START</name>
                  <description>Current state is TDC_STATE_WAIT_START. 
The fast-counter circuit looks for the start condition. The state machine waits for the fast-counter to increment.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT</name>
          <displayName>RESULT</displayName>
          <description>Result

Result of last TDC conversion</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>25</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VALUE</name>
              <description>TDC conversion result.

The result of the TDC conversion is given in number of clock edges of the clock source selected in DDI_0_OSC:CTL0.ACLK_TDC_SRC_SEL. Both rising and falling edges are counted.

If TDC counter saturates, VALUE is slightly higher than SATCFG.LIMIT, as it takes a non-zero time to stop the measurement. Hence, the maximum value of this field becomes slightly higher than 2^24 if you configure SATCFG.LIMIT to R24.</description>
              <lsb>0</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SATCFG</name>
          <displayName>SATCFG</displayName>
          <description>Saturation Configuration</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>4</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>LIMIT</name>
              <description>Saturation limit.

The flag STAT.SAT is set when the TDC counter saturates.

Values not enumerated are not supported</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R24</name>
                  <description>Result bit 24: TDC conversion saturates and stops when RESULT.VALUE[24] is set.</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R23</name>
                  <description>Result bit 23: TDC conversion saturates and stops when RESULT.VALUE[23] is set.</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R22</name>
                  <description>Result bit 22: TDC conversion saturates and stops when RESULT.VALUE[22] is set.</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R21</name>
                  <description>Result bit 21: TDC conversion saturates and stops when RESULT.VALUE[21] is set. </description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R20</name>
                  <description>Result bit 20: TDC conversion saturates and stops when RESULT.VALUE[20] is set.</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R19</name>
                  <description>Result bit 19: TDC conversion saturates and stops when RESULT.VALUE[19] is set. </description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R18</name>
                  <description>Result bit 18: TDC conversion saturates and stops when RESULT.VALUE[18] is set.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R17</name>
                  <description>Result bit 17: TDC conversion saturates and stops when RESULT.VALUE[17] is set. </description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R16</name>
                  <description>Result bit 16: TDC conversion saturates and stops when RESULT.VALUE[16] is set.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R15</name>
                  <description>Result bit 15: TDC conversion saturates and stops when RESULT.VALUE[15] is set.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R14</name>
                  <description>Result bit 14: TDC conversion saturates and stops when RESULT.VALUE[14] is set.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R13</name>
                  <description>Result bit 13: TDC conversion saturates and stops when RESULT.VALUE[13] is set.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R12</name>
                  <description>Result bit 12: TDC conversion saturates and stops when RESULT.VALUE[12] is set. </description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIGSRC</name>
          <displayName>TRIGSRC</displayName>
          <description>Trigger Source

Select source and polarity for TDC start and stop events. See the Technical Reference Manual for event timing requirements. </description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED14</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>14</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STOP_POL</name>
              <description>Polarity of stop source.

Change only while STAT.STATE is IDLE.</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>TDC conversion stops when low level is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>TDC conversion stops when high level is detected.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP_SRC</name>
              <description>Select stop source from the asynchronous AUX event bus.

