wezm/dslite2svd/svd/cc2650f128-vendor.xml
Configure source for Timer 0 prescaler.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TICK</name>
                  <description>Use event set by TICK_SRC as source for prescaler.
</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK</name>
                  <description>Use AUX clock as source for prescaler.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RELOAD</name>
              <description>Timer 0 reload mode.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONT</name>
                  <description>Continuous mode.

Timer 0 restarts when the counter value becomes equal to or greater than ( T0TARGET.VALUE - 1).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAN</name>
                  <description>Manual mode.

Timer 0 stops and T0CTL.EN becomes 0 when the counter value becomes equal to or greater than T0TARGET.VALUE.
</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>T1CFG</name>
          <displayName>T1CFG</displayName>
          <description>Timer 1 Configuration
</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED14</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>14</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TICK_SRC_POL</name>
              <description>Tick source polarity for Timer 1.</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Count on falling edges of TICK_SRC.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Count on rising edges of TICK_SRC.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TICK_SRC</name>
              <description>Select Timer 1 tick source from the synchronous event bus.</description>
              <lsb>8</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_IRQ</name>
                  <description>AUX_EVCTL:EVSTAT1.ADC_IRQ</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCU_EVENT</name>
                  <description>AUX_EVCTL:EVSTAT1.MCU_EV</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLK_REF</name>
                  <description>AUX_EVCTL:EVSTAT1.ACLK_REF</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO15</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO15</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO14</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO14 </description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO13</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO13 </description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO12</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO12 </description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO11</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO11</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO10</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO10</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO9</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO9  </description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO8</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO8  </description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO7</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO7  </description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO6</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO6  </description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO5</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO5  </description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO4</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO4  </description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO3</name>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO3  </description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO2</name>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO2</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO1</name>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO1</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO0</name>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO0</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_PROG_WU</name>
                  <description>AUX_EVCTL:EVSTAT0.AON_PROG_WU</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_SW</name>
                  <description>AUX_EVCTL:EVSTAT0.AON_SW</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBSMUX1</name>
                  <description>AUX_EVCTL:EVSTAT0.OBSMUX1</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBSMUX0</name>
                  <description>AUX_EVCTL:EVSTAT0.OBSMUX0</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_4KHZ</name>
                  <description>AON_RTC:SUBSEC.VALUE bit 19. AON_RTC:CTL.RTC_4KHZ_EN enables this event.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DONE</name>
                  <description>AUX_EVCTL:EVSTAT0.ADC_DONE</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMPH_AUTOTAKE_DONE</name>
                  <description>AUX_EVCTL:EVSTAT0.SMPH_AUTOTAKE_DONE</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER0_EV</name>
                  <description>AUX_EVCTL:EVSTAT0.TIMER0_EV</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TDC_DONE</name>
                  <description>AUX_EVCTL:EVSTAT0.TDC_DONE</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB</name>
                  <description>AUX_EVCTL:EVSTAT0.AUX_COMPB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPA</name>
                  <description>AUX_EVCTL:EVSTAT0.AUX_COMPA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH2_EV</name>
                  <description>AUX_EVCTL:EVSTAT0.AON_RTC_CH2</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRE</name>
              <description>Prescaler division ratio is 2^PRE:

0x0: Divide by 1.
0x1: Divide by 2.
0x2: Divide by 4.
... 
0xF: Divide by 32,768.</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODE</name>
              <description>Timer 1 mode.

Configure source for Timer 1 prescaler.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TICK</name>
                  <description>Use event set by TICK_SRC as source for prescaler.
</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK</name>
                  <description>Use AUX clock as source for prescaler.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RELOAD</name>
              <description>Timer 1 reload mode.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONT</name>
                  <description>Continuous mode.

Timer 1 restarts when the counter value becomes equal to or greater than ( T1TARGET.VALUE - 1).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAN</name>
                  <description>Manual mode.

