wezm/dslite2svd/svd/cc2650f128-vendor.xml
This bit must remain set until WUEVFLAGS.AON_PROG_WU returns to 0.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCLKCTL</name>
          <displayName>ADCCLKCTL</displayName>
          <description>ADC Clock Control

Controls the ADC internal clock

Note that the ADC command and data interface requires MODCLKEN0.ANAIF or MODCLKEN1.ANAIF also to be set
</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK</name>
              <description>Acknowledges the last value written to REQ.
</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>REQ</name>
              <description>Enables(1) or disables (0) the ADC internal clock.

This bit must not be modified unless ACK matches the current value.
</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TDCCLKCTL</name>
          <displayName>TDCCLKCTL</displayName>
          <description>TDC Clock Control

Controls the TDC counter clock source, which steps the TDC counter value

The source of this clock is controlled by OSC_DIG:CTL0.ACLK_TDC_SRC_SEL.
</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK</name>
              <description>Acknowledges the last value written to REQ.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>REQ</name>
              <description>Enables(1) or disables (0) the TDC counter clock source.

This bit must not be modified unless ACK matches the current value.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REFCLKCTL</name>
          <displayName>REFCLKCTL</displayName>
          <description>Reference Clock Control

Controls the TDC reference clock source, which is to be compared against the TDC counter clock. 

The source of this clock is controlled by OSC_DIG:CTL0.ACLK_REF_SRC_SEL.</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK</name>
              <description>Acknowledges the last value written to REQ.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>REQ</name>
              <description>Enables(1) or disables (0) the TDC reference clock source.

This bit must not be modified unless ACK matches the current value.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCSUBSECINC0</name>
          <displayName>RTCSUBSECINC0</displayName>
          <description>Real Time Counter Sub Second Increment 0

New value for the real-time counter (AON_RTC) sub-second increment value, part corresponding to AON_RTC:SUBSECINC bits 15:0.

After setting INC15_0 and RTCSUBSECINC1.INC23_16, the value is loaded into AON_RTC:SUBSECINC.VALUEINC by setting RTCSUBSECINCCTL.UPD_REQ.
</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>INC15_0</name>
              <description>Bits 15:0 of the RTC sub-second increment value.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCSUBSECINC1</name>
          <displayName>RTCSUBSECINC1</displayName>
          <description>Real Time Counter Sub Second Increment 1

New value for the real-time counter (AON_RTC) sub-second increment value, part corresponding to AON_RTC:SUBSECINC bits 23:16.

After setting RTCSUBSECINC0.INC15_0 and INC23_16, the value is loaded into AON_RTC:SUBSECINC.VALUEINC by setting RTCSUBSECINCCTL.UPD_REQ.</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>8</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>INC23_16</name>
              <description>Bits 23:16 of the RTC sub-second increment value.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCSUBSECINCCTL</name>
          <displayName>RTCSUBSECINCCTL</displayName>
          <description>Real Time Counter Sub Second Increment Control</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UPD_ACK</name>
              <description>Acknowledgment of the UPD_REQ.
</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UPD_REQ</name>
              <description>Signal that a new real time counter sub second increment value is available

0: New sub second increment is not available
1: New sub second increment is available

