wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>CCFG_PROT_31_0</name>
          <displayName>CCFG_PROT_31_0</displayName>
          <description>Protect Sectors 0-31
Each bit write protects one 4KB flash sector from being both programmed and erased. Bit must be set to 0 in order to enable sector write protect.</description>
          <addressOffset>0xff0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WRT_PROT_SEC_31</name>
              <description>0: Sector protected</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_30</name>
              <description>0: Sector protected</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_29</name>
              <description>0: Sector protected</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_28</name>
              <description>0: Sector protected</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_27</name>
              <description>0: Sector protected</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_26</name>
              <description>0: Sector protected</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_25</name>
              <description>0: Sector protected</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_24</name>
              <description>0: Sector protected</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_23</name>
              <description>0: Sector protected</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_22</name>
              <description>0: Sector protected</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_21</name>
              <description>0: Sector protected</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_20</name>
              <description>0: Sector protected</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_19</name>
              <description>0: Sector protected</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_18</name>
              <description>0: Sector protected</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_17</name>
              <description>0: Sector protected</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_16</name>
              <description>0: Sector protected</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_15</name>
              <description>0: Sector protected</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_14</name>
              <description>0: Sector protected</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_13</name>
              <description>0: Sector protected</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_12</name>
              <description>0: Sector protected</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_11</name>
              <description>0: Sector protected</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_10</name>
              <description>0: Sector protected</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_9</name>
              <description>0: Sector protected</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_8</name>
              <description>0: Sector protected</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_7</name>
              <description>0: Sector protected</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_6</name>
              <description>0: Sector protected</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_5</name>
              <description>0: Sector protected</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_4</name>
              <description>0: Sector protected</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_3</name>
              <description>0: Sector protected</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_2</name>
              <description>0: Sector protected</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_1</name>
              <description>0: Sector protected</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_0</name>
              <description>0: Sector protected</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCFG_PROT_63_32</name>
          <displayName>CCFG_PROT_63_32</displayName>
          <description>Protect Sectors 32-63
Each bit write protects one 4KB flash sector from being both programmed and erased. Bit must be set to 0 in order to enable sector write protect. Not in use by CC26x0 and CC13x0.</description>
          <addressOffset>0xff4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WRT_PROT_SEC_63</name>
              <description>0: Sector protected</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_62</name>
              <description>0: Sector protected</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_61</name>
              <description>0: Sector protected</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_60</name>
              <description>0: Sector protected</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_59</name>
              <description>0: Sector protected</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_58</name>
              <description>0: Sector protected</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_57</name>
              <description>0: Sector protected</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_56</name>
              <description>0: Sector protected</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_55</name>
              <description>0: Sector protected</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_54</name>
              <description>0: Sector protected</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_53</name>
              <description>0: Sector protected</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_52</name>
              <description>0: Sector protected</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_51</name>
              <description>0: Sector protected</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_50</name>
              <description>0: Sector protected</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_49</name>
              <description>0: Sector protected</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_48</name>
              <description>0: Sector protected</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_47</name>
              <description>0: Sector protected</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_46</name>
              <description>0: Sector protected</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_45</name>
              <description>0: Sector protected</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_44</name>
              <description>0: Sector protected</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_43</name>
              <description>0: Sector protected</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_42</name>
              <description>0: Sector protected</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_41</name>
              <description>0: Sector protected</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_40</name>
              <description>0: Sector protected</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_39</name>
              <description>0: Sector protected</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_38</name>
              <description>0: Sector protected</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_37</name>
              <description>0: Sector protected</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_36</name>
              <description>0: Sector protected</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_35</name>
              <description>0: Sector protected</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_34</name>
              <description>0: Sector protected</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_33</name>
              <description>0: Sector protected</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_32</name>
              <description>0: Sector protected</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
