wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>CCFG_PROT_95_64</name>
          <displayName>CCFG_PROT_95_64</displayName>
          <description>Protect Sectors 64-95
Each bit write protects one flash sector from being both programmed and erased. Bit must be set to 0 in order to enable sector write protect. Not in use by CC26x0 and CC13x0.</description>
          <addressOffset>0xff8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WRT_PROT_SEC_95</name>
              <description>0: Sector protected</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_94</name>
              <description>0: Sector protected</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_93</name>
              <description>0: Sector protected</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_92</name>
              <description>0: Sector protected</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_91</name>
              <description>0: Sector protected</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_90</name>
              <description>0: Sector protected</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_89</name>
              <description>0: Sector protected</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_88</name>
              <description>0: Sector protected</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_87</name>
              <description>0: Sector protected</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_86</name>
              <description>0: Sector protected</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_85</name>
              <description>0: Sector protected</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_84</name>
              <description>0: Sector protected</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_83</name>
              <description>0: Sector protected</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_82</name>
              <description>0: Sector protected</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_81</name>
              <description>0: Sector protected</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_80</name>
              <description>0: Sector protected</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_79</name>
              <description>0: Sector protected</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_78</name>
              <description>0: Sector protected</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_77</name>
              <description>0: Sector protected</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_76</name>
              <description>0: Sector protected</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_75</name>
              <description>0: Sector protected</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_74</name>
              <description>0: Sector protected</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_73</name>
              <description>0: Sector protected</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_72</name>
              <description>0: Sector protected</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_71</name>
              <description>0: Sector protected</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_70</name>
              <description>0: Sector protected</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_69</name>
              <description>0: Sector protected</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_68</name>
              <description>0: Sector protected</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_67</name>
              <description>0: Sector protected</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_66</name>
              <description>0: Sector protected</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_65</name>
              <description>0: Sector protected</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_64</name>
              <description>0: Sector protected</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCFG_PROT_127_96</name>
          <displayName>CCFG_PROT_127_96</displayName>
          <description>Protect Sectors 96-127
Each bit write protects one flash sector from being both programmed and erased. Bit must be set to 0 in order to enable sector write protect. Not in use by CC26x0 and CC13x0.</description>
          <addressOffset>0xffc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WRT_PROT_SEC_127</name>
              <description>0: Sector protected</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_126</name>
              <description>0: Sector protected</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_125</name>
              <description>0: Sector protected</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_124</name>
              <description>0: Sector protected</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_123</name>
              <description>0: Sector protected</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_122</name>
              <description>0: Sector protected</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_121</name>
              <description>0: Sector protected</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_120</name>
              <description>0: Sector protected</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_119</name>
              <description>0: Sector protected</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_118</name>
              <description>0: Sector protected</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_117</name>
              <description>0: Sector protected</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_116</name>
              <description>0: Sector protected</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_115</name>
              <description>0: Sector protected</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_114</name>
              <description>0: Sector protected</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_113</name>
              <description>0: Sector protected</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_112</name>
              <description>0: Sector protected</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_111</name>
              <description>0: Sector protected</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_110</name>
              <description>0: Sector protected</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_109</name>
              <description>0: Sector protected</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_108</name>
              <description>0: Sector protected</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_107</name>
              <description>0: Sector protected</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_106</name>
              <description>0: Sector protected</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_105</name>
              <description>0: Sector protected</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_104</name>
              <description>0: Sector protected</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_103</name>
              <description>0: Sector protected</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_102</name>
              <description>0: Sector protected</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_101</name>
              <description>0: Sector protected</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_100</name>
              <description>0: Sector protected</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_99</name>
              <description>0: Sector protected</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_98</name>
              <description>0: Sector protected</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_97</name>
              <description>0: Sector protected</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRT_PROT_SEC_96</name>
              <description>0: Sector protected</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
