wezm/dslite2svd/svd/cc2650f128-vendor.xml
0x0: Remap to remap address. See REMAP.REMAP
0x1: Set BKPT on lower halfword, upper is unaffected
0x2: Set BKPT on upper halfword, lower is unaffected
0x3: Set BKPT on both lower and upper halfwords.</description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED29</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP</name>
              <description>Comparison address.</description>
              <lsb>2</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Compare and remap enable comparator 1. CTRL.ENABLE must also be set to enable comparisons.

0x0: Compare and remap for comparator 1 disabled
0x1: Compare and remap for comparator 1 enabled</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP2</name>
          <displayName>COMP2</displayName>
          <description>Comparator 2</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REPLACE</name>
              <description>This selects what happens when the COMP address is matched. Address remapping only takes place for the 0x0 setting.

0x0: Remap to remap address. See REMAP.REMAP
0x1: Set BKPT on lower halfword, upper is unaffected
0x2: Set BKPT on upper halfword, lower is unaffected
0x3: Set BKPT on both lower and upper halfwords.</description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED29</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP</name>
              <description>Comparison address.</description>
              <lsb>2</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Compare and remap enable comparator 2. CTRL.ENABLE must also be set to enable comparisons.

0x0: Compare and remap for comparator 2 disabled
0x1: Compare and remap for comparator 2 enabled</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP3</name>
          <displayName>COMP3</displayName>
          <description>Comparator 3</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REPLACE</name>
              <description>This selects what happens when the COMP address is matched. Address remapping only takes place for the 0x0 setting.

0x0: Remap to remap address. See REMAP.REMAP
0x1: Set BKPT on lower halfword, upper is unaffected
0x2: Set BKPT on upper halfword, lower is unaffected
0x3: Set BKPT on both lower and upper halfwords.</description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED29</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP</name>
              <description>Comparison address.</description>
              <lsb>2</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Compare and remap enable comparator 3. CTRL.ENABLE must also be set to enable comparisons.

0x0: Compare and remap for comparator 3 disabled
0x1: Compare and remap for comparator 3 enabled</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP4</name>
          <displayName>COMP4</displayName>
          <description>Comparator 4</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REPLACE</name>
              <description>This selects what happens when the COMP address is matched. Address remapping only takes place for the 0x0 setting.

