wezm/dslite2svd/svd/cc2650f128-vendor.xml
0x0: Remap to remap address. See REMAP.REMAP
0x1: Set BKPT on lower halfword, upper is unaffected
0x2: Set BKPT on upper halfword, lower is unaffected
0x3: Set BKPT on both lower and upper halfwords.</description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED29</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP</name>
              <description>Comparison address.</description>
              <lsb>2</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Compare and remap enable comparator 4. CTRL.ENABLE must also be set to enable comparisons.

0x0: Compare and remap for comparator 4 disabled
0x1: Compare and remap for comparator 4 enabled</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP5</name>
          <displayName>COMP5</displayName>
          <description>Comparator 5</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REPLACE</name>
              <description>This selects what happens when the COMP address is matched. Address remapping only takes place for the 0x0 setting.

0x0: Remap to remap address. See REMAP.REMAP
0x1: Set BKPT on lower halfword, upper is unaffected
0x2: Set BKPT on upper halfword, lower is unaffected
0x3: Set BKPT on both lower and upper halfwords.</description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED29</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP</name>
              <description>Comparison address.</description>
              <lsb>2</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Compare and remap enable comparator 5. CTRL.ENABLE must also be set to enable comparisons.

0x0: Compare and remap for comparator 5 disabled
0x1: Compare and remap for comparator 5 enabled</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP6</name>
          <displayName>COMP6</displayName>
          <description>Comparator 6</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REPLACE</name>
              <description>This selects what happens when the COMP address is matched. Comparator 6 is a literal comparator and the only supported setting is 0x0. Other settings will be ignored.

0x0: Remap to remap address. See REMAP.REMAP
0x1: Set BKPT on lower halfword, upper is unaffected
0x2: Set BKPT on upper halfword, lower is unaffected
0x3: Set BKPT on both lower and upper halfwords.</description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED29</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP</name>
              <description>Comparison address.</description>
              <lsb>2</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Compare and remap enable comparator 6. CTRL.ENABLE must also be set to enable comparisons.

0x0: Compare and remap for comparator 6 disabled
0x1: Compare and remap for comparator 6 enabled</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP7</name>
          <displayName>COMP7</displayName>
          <description>Comparator 7</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REPLACE</name>
              <description>This selects what happens when the COMP address is matched. Comparator 7 is a literal comparator and the only supported setting is 0x0. Other settings will be ignored.

