wezm/dslite2svd/svd/cc2650f128-vendor.xml
0x0: Remap to remap address. See REMAP.REMAP
0x1: Set BKPT on lower halfword, upper is unaffected
0x2: Set BKPT on upper halfword, lower is unaffected
0x3: Set BKPT on both lower and upper halfwords.</description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED29</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP</name>
              <description>Comparison address.</description>
              <lsb>2</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Compare and remap enable comparator 7. CTRL.ENABLE must also be set to enable comparisons.

0x0: Compare and remap for comparator 7 disabled
0x1: Compare and remap for comparator 7 enabled</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- ../Modules/CC26xx/CC2650/CPU_ITM.xml -->
    <peripheral>
      <name>CPU_ITM</name>
      <description>Cortex-M's Instrumentation Trace Macrocell (ITM)

</description>
      <baseAddress>0xE0000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>STIM0</name>
          <displayName>STIM0</displayName>
          <description>Stimulus Port 0</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM1</name>
          <displayName>STIM1</displayName>
          <description>Stimulus Port 1</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM2</name>
          <displayName>STIM2</displayName>
          <description>Stimulus Port 2</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM3</name>
          <displayName>STIM3</displayName>
          <description>Stimulus Port 3</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM4</name>
          <displayName>STIM4</displayName>
          <description>Stimulus Port 4</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM5</name>
          <displayName>STIM5</displayName>
          <description>Stimulus Port 5</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM6</name>
          <displayName>STIM6</displayName>
          <description>Stimulus Port 6</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM7</name>
          <displayName>STIM7</displayName>
          <description>Stimulus Port 7</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM8</name>
          <displayName>STIM8</displayName>
          <description>Stimulus Port 8</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM9</name>
          <displayName>STIM9</displayName>
          <description>Stimulus Port 9</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM10</name>
          <displayName>STIM10</displayName>
          <description>Stimulus Port 10</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM11</name>
          <displayName>STIM11</displayName>
          <description>Stimulus Port 11</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM12</name>
          <displayName>STIM12</displayName>
          <description>Stimulus Port 12</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM13</name>
          <displayName>STIM13</displayName>
          <description>Stimulus Port 13</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM14</name>
          <displayName>STIM14</displayName>
          <description>Stimulus Port 14</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM15</name>
          <displayName>STIM15</displayName>
          <description>Stimulus Port 15</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM16</name>
          <displayName>STIM16</displayName>
          <description>Stimulus Port 16</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM17</name>
          <displayName>STIM17</displayName>
          <description>Stimulus Port 17</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM18</name>
          <displayName>STIM18</displayName>
          <description>Stimulus Port 18</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM19</name>
          <displayName>STIM19</displayName>
          <description>Stimulus Port 19</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM20</name>
          <displayName>STIM20</displayName>
          <description>Stimulus Port 20</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM21</name>
          <displayName>STIM21</displayName>
          <description>Stimulus Port 21</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM22</name>
          <displayName>STIM22</displayName>
          <description>Stimulus Port 22</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM23</name>
          <displayName>STIM23</displayName>
          <description>Stimulus Port 23</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM24</name>
          <displayName>STIM24</displayName>
          <description>Stimulus Port 24</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM25</name>
          <displayName>STIM25</displayName>
          <description>Stimulus Port 25</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM26</name>
          <displayName>STIM26</displayName>
          <description>Stimulus Port 26</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM27</name>
          <displayName>STIM27</displayName>
          <description>Stimulus Port 27</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM28</name>
          <displayName>STIM28</displayName>
          <description>Stimulus Port 28</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM29</name>
          <displayName>STIM29</displayName>
          <description>Stimulus Port 29</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM30</name>
          <displayName>STIM30</displayName>
          <description>Stimulus Port 30</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STIM31</name>
          <displayName>STIM31</displayName>
          <description>Stimulus Port 31</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>TER</name>
          <displayName>TER</displayName>
          <description>Trace Enable
Use the Trace Enable Register to generate trace data by writing to the corresponding stimulus port. Note: Privileged writes are accepted to this register if TCR.ITMENA is set. User writes are accepted to this register if TCR.ITMENA is set and the appropriate privilege mask is cleared. Privileged access to the stimulus ports enables an RTOS kernel to guarantee instrumentation slots or bandwidth as required.</description>
          <addressOffset>0xe00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STIMENA31</name>
              <description>Bit mask to enable tracing on ITM stimulus port 31.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA30</name>
              <description>Bit mask to enable tracing on ITM stimulus port 30.</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA29</name>
              <description>Bit mask to enable tracing on ITM stimulus port 29.</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA28</name>
              <description>Bit mask to enable tracing on ITM stimulus port 28.</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA27</name>
              <description>Bit mask to enable tracing on ITM stimulus port 27.</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA26</name>
              <description>Bit mask to enable tracing on ITM stimulus port 26.</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA25</name>
              <description>Bit mask to enable tracing on ITM stimulus port 25.</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA24</name>
              <description>Bit mask to enable tracing on ITM stimulus port 24.</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA23</name>
              <description>Bit mask to enable tracing on ITM stimulus port 23.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA22</name>
              <description>Bit mask to enable tracing on ITM stimulus port 22.</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA21</name>
              <description>Bit mask to enable tracing on ITM stimulus port 21.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA20</name>
              <description>Bit mask to enable tracing on ITM stimulus port 20.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA19</name>
              <description>Bit mask to enable tracing on ITM stimulus port 19.</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA18</name>
              <description>Bit mask to enable tracing on ITM stimulus port 18.</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA17</name>
              <description>Bit mask to enable tracing on ITM stimulus port 17.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA16</name>
              <description>Bit mask to enable tracing on ITM stimulus port 16.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA15</name>
              <description>Bit mask to enable tracing on ITM stimulus port 15.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA14</name>
              <description>Bit mask to enable tracing on ITM stimulus port 14.</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA13</name>
              <description>Bit mask to enable tracing on ITM stimulus port 13.</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA12</name>
              <description>Bit mask to enable tracing on ITM stimulus port 12.</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA11</name>
              <description>Bit mask to enable tracing on ITM stimulus port 11.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA10</name>
              <description>Bit mask to enable tracing on ITM stimulus port 10.</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA9</name>
              <description>Bit mask to enable tracing on ITM stimulus port 9.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA8</name>
              <description>Bit mask to enable tracing on ITM stimulus port 8.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA7</name>
              <description>Bit mask to enable tracing on ITM stimulus port 7.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA6</name>
              <description>Bit mask to enable tracing on ITM stimulus port 6.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA5</name>
              <description>Bit mask to enable tracing on ITM stimulus port 5.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA4</name>
              <description>Bit mask to enable tracing on ITM stimulus port 4.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA3</name>
              <description>Bit mask to enable tracing on ITM stimulus port 3.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA2</name>
              <description>Bit mask to enable tracing on ITM stimulus port 2.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA1</name>
              <description>Bit mask to enable tracing on ITM stimulus port 1.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA0</name>
              <description>Bit mask to enable tracing on ITM stimulus port 0.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TPR</name>
          <displayName>TPR</displayName>
          <description>Trace Privilege
This register is used to enable an operating system to control which stimulus ports are accessible by user code. This register can only be used in privileged mode.</description>
          <addressOffset>0xe40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>4</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIVMASK</name>
              <description>Bit mask to enable unprivileged (User) access to ITM stimulus ports:

Bit [0] enables stimulus ports 0, 1, ..., and 7.
Bit [1] enables stimulus ports 8, 9, ..., and 15.
Bit [2] enables stimulus ports 16, 17, ..., and 23.
Bit [3] enables stimulus ports 24, 25, ..., and 31.

0: User access allowed to stimulus ports
1: Privileged access only to stimulus ports</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
