wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>NVIC_ICER0</name>
          <displayName>NVIC_ICER0</displayName>
          <description>Irq 0 to 31 Clear Enable
This register is used to disable interrupts and determine which interrupts are currently enabled.</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLRENA31</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  31 (See EVENT:CPUIRQSEL31.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA30</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  30 (See EVENT:CPUIRQSEL30.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA29</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  29 (See EVENT:CPUIRQSEL29.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA28</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  28 (See EVENT:CPUIRQSEL28.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA27</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  27 (See EVENT:CPUIRQSEL27.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA26</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  26 (See EVENT:CPUIRQSEL26.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA25</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  25 (See EVENT:CPUIRQSEL25.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA24</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  24 (See EVENT:CPUIRQSEL24.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA23</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  23 (See EVENT:CPUIRQSEL23.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA22</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  22 (See EVENT:CPUIRQSEL22.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA21</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  21 (See EVENT:CPUIRQSEL21.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA20</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  20 (See EVENT:CPUIRQSEL20.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA19</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  19 (See EVENT:CPUIRQSEL19.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA18</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  18 (See EVENT:CPUIRQSEL18.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA17</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  17 (See EVENT:CPUIRQSEL17.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA16</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  16 (See EVENT:CPUIRQSEL16.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA15</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  15 (See EVENT:CPUIRQSEL15.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA14</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  14 (See EVENT:CPUIRQSEL14.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA13</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  13 (See EVENT:CPUIRQSEL13.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA12</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  12 (See EVENT:CPUIRQSEL12.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA11</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  11 (See EVENT:CPUIRQSEL11.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA10</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  10 (See EVENT:CPUIRQSEL10.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA9</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  9 (See EVENT:CPUIRQSEL9.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA8</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  8 (See EVENT:CPUIRQSEL8.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA7</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  7 (See EVENT:CPUIRQSEL7.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA6</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  6 (See EVENT:CPUIRQSEL6.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA5</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  5 (See EVENT:CPUIRQSEL5.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA4</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  4 (See EVENT:CPUIRQSEL4.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA3</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  3 (See EVENT:CPUIRQSEL3.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA2</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  2 (See EVENT:CPUIRQSEL2.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA1</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  1 (See EVENT:CPUIRQSEL1.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA0</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  0 (See EVENT:CPUIRQSEL0.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_ICER1</name>
          <displayName>NVIC_ICER1</displayName>
          <description>Irq 32 to 63 Clear Enable
This register is used to disable interrupts and determine which interrupts are currently enabled.</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA33</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  33 (See EVENT:CPUIRQSEL33.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRENA32</name>
              <description>Writing 0 to this bit has no effect, writing 1 to this bit disables the interrupt number  32 (See EVENT:CPUIRQSEL32.EV for details). Reading the bit returns its current enable state.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESERVED1</name>
          <displayName>RESERVED1</displayName>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
