wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>NVIC_IPR5</name>
          <displayName>NVIC_IPR5</displayName>
          <description>Irq 20 to 23 Priority
This register is used to assign a priority from 0 to 255 to each of the available interrupts. 0 is the highest priority, and 255 is the lowest. The interpretation of the Interrupt Priority Registers changes based on the setting in AIRCR.PRIGROUP.</description>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PRI_23</name>
              <description>Priority of interrupt 23 (See EVENT:CPUIRQSEL23.EV for details).</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_22</name>
              <description>Priority of interrupt 22 (See EVENT:CPUIRQSEL22.EV for details).</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_21</name>
              <description>Priority of interrupt 21 (See EVENT:CPUIRQSEL21.EV for details).</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_20</name>
              <description>Priority of interrupt 20 (See EVENT:CPUIRQSEL20.EV for details).</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR6</name>
          <displayName>NVIC_IPR6</displayName>
          <description>Irq 24 to 27 Priority
This register is used to assign a priority from 0 to 255 to each of the available interrupts. 0 is the highest priority, and 255 is the lowest. The interpretation of the Interrupt Priority Registers changes based on the setting in AIRCR.PRIGROUP.</description>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PRI_27</name>
              <description>Priority of interrupt 27 (See EVENT:CPUIRQSEL27.EV for details).</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_26</name>
              <description>Priority of interrupt 26 (See EVENT:CPUIRQSEL26.EV for details).</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_25</name>
              <description>Priority of interrupt 25 (See EVENT:CPUIRQSEL25.EV for details).</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_24</name>
              <description>Priority of interrupt 24 (See EVENT:CPUIRQSEL24.EV for details).</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR7</name>
          <displayName>NVIC_IPR7</displayName>
          <description>Irq 28 to 31 Priority
This register is used to assign a priority from 0 to 255 to each of the available interrupts. 0 is the highest priority, and 255 is the lowest. The interpretation of the Interrupt Priority Registers changes based on the setting in AIRCR.PRIGROUP.</description>
          <addressOffset>0x41c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PRI_31</name>
              <description>Priority of interrupt 31 (See EVENT:CPUIRQSEL31.EV for details).</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_30</name>
              <description>Priority of interrupt 30 (See EVENT:CPUIRQSEL30.EV for details).</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_29</name>
              <description>Priority of interrupt 29 (See EVENT:CPUIRQSEL29.EV for details).</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_28</name>
              <description>Priority of interrupt 28 (See EVENT:CPUIRQSEL28.EV for details).</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR8</name>
          <displayName>NVIC_IPR8</displayName>
          <description>Irq 32 to 35 Priority
This register is used to assign a priority from 0 to 255 to each of the available interrupts. 0 is the highest priority, and 255 is the lowest. The interpretation of the Interrupt Priority Registers changes based on the setting in AIRCR.PRIGROUP.</description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_33</name>
              <description>Priority of interrupt 33 (See EVENT:CPUIRQSEL33.EV for details).</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_32</name>
              <description>Priority of interrupt 32 (See EVENT:CPUIRQSEL32.EV for details).</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESERVED5</name>
          <displayName>RESERVED5</displayName>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <addressOffset>0x424</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUID</name>
          <displayName>CPUID</displayName>
          <description>CPUID Base
This register determines the ID number of the processor core, the version number of the processor core and the implementation details of the processor core.</description>
          <addressOffset>0xd00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IMPLEMENTER</name>
              <description>Implementor code.</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Implementation defined variant number.</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CONSTANT</name>
              <description>Reads as 0xF</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PARTNO</name>
              <description>Number of processor within family.</description>
              <lsb>4</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>REVISION</name>
              <description>Implementation defined revision number.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICSR</name>
          <displayName>ICSR</displayName>
          <description>Interrupt Control State
This register is used to set a pending Non-Maskable Interrupt (NMI), set or clear a pending SVC, set or clear a pending SysTick, check for pending exceptions, check the vector number of the highest priority pended exception, and check the vector number of the active exception.</description>
          <addressOffset>0xd04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NMIPENDSET</name>
              <description>Set pending NMI bit. Setting this bit pends and activates an NMI. Because NMI is the highest-priority interrupt, it takes effect as soon as it registers.

