wezm/dslite2svd/svd/cc2650f128-vendor.xml
0: Continuous formatting disabled
1: Continuous formatting enabled</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSCR</name>
          <displayName>FSCR</displayName>
          <description>Formatter Synchronization Counter
</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>CLAIMMASK</name>
          <displayName>CLAIMMASK</displayName>
          <description>Claim Tag Mask</description>
          <addressOffset>0xfa0</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>CLAIMSET</name>
          <displayName>CLAIMSET</displayName>
          <description>Claim Tag Set</description>
          <addressOffset>0xfa0</addressOffset>
          <size>32</size>
          <access>write-only</access>
        </register>
        <register>
          <name>CLAIMTAG</name>
          <displayName>CLAIMTAG</displayName>
          <description>Current Claim Tag</description>
          <addressOffset>0xfa4</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>CLAIMCLR</name>
          <displayName>CLAIMCLR</displayName>
          <description>Claim Tag Clear</description>
          <addressOffset>0xfa4</addressOffset>
          <size>32</size>
          <access>write-only</access>
        </register>
        <register>
          <name>DEVID</name>
          <displayName>DEVID</displayName>
          <description>Device ID</description>
          <addressOffset>0xfc8</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
      </registers>
    </peripheral>
    <!-- ../Modules/CC26xx/CC2650/CRYPTO.xml -->
    <peripheral>
      <name>CRYPTO</name>
      <description>Crypto core with DMA capability and local key storage

</description>
      <baseAddress>0x40024000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x800</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>DMACH0CTL</name>
          <displayName>DMACH0CTL</displayName>
          <description>DMA Channel 0 Control</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIO</name>
              <description>Channel priority:

A channel with high priority will be served before a channel with low priority in cases with simultaneous access requests. If both channels have the same priority access of the channels to the external port is arbitrated using a Round Robin scheme.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Priority high</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Priority low</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN</name>
              <description>DMA Channel 0 Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Channel enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Channel disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACH0EXTADDR</name>
          <displayName>DMACH0EXTADDR</displayName>
          <description>DMA Channel 0 External Address</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Channel external address value.
Holds the last updated external address after being sent to the master interface.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACH0LEN</name>
          <displayName>DMACH0LEN</displayName>
          <description>DMA Channel 0 Length</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>LEN</name>
              <description>DMA transfer length in bytes.
During configuration, this register contains the DMA transfer length in bytes. During operation, it contains the last updated value of the DMA transfer length after being sent to the master interface.
Note: Writing a non-zero value to this register field starts the transfer if the channel is enabled by setting DMACH0CTL.EN.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASTAT</name>
          <displayName>DMASTAT</displayName>
          <description>DMA Controller Status</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED18</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>18</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PORT_ERR</name>
              <description>Reflects possible transfer errors on the AHB port.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>2</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1_ACTIVE</name>
              <description>This register field indicates if DMA channel 1 is active or not.
0: Not active
1: Active</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0_ACTIVE</name>
              <description>This register field indicates if DMA channel 0 is active or not.
0: Not active
1: Active</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASWRESET</name>
          <displayName>DMASWRESET</displayName>
          <description>DMA Controller Software Reset</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESET</name>
              <description>Software reset enable 

0:  Disable
1:  Enable (self-cleared to zero).

Note: Completion of the software reset must be checked in DMASTAT.CH0_ACTIVE and DMASTAT.CH1_ACTIVE.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACH1CTL</name>
          <displayName>DMACH1CTL</displayName>
          <description>DMA Channel 1 Control</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIO</name>
              <description>Channel priority:

A channel with high priority will be served before a channel with low priority in cases with simultaneous access requests. If both channels have the same priority access of the channels to the external port is arbitrated using a Round Robin scheme.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Priority high</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Priority low</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN</name>
              <description>Channel enable:

Note: Disabling an active channel will interrupt the DMA operation. The ongoing block transfer will be completed, but no new transfers will be requested.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Channel enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Channel disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACH1EXTADDR</name>
          <displayName>DMACH1EXTADDR</displayName>
          <description>DMA Channel 1 External Address</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Channel external address value.
Holds the last updated external address after being sent to the master interface.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACH1LEN</name>
          <displayName>DMACH1LEN</displayName>
          <description>DMA Channel 1 Length</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>LEN</name>
              <description>DMA transfer length in bytes.
During configuration, this register contains the DMA transfer length in bytes. During operation, it contains the last updated value of the DMA transfer length after being sent to the master interface.
Note: Writing a non-zero value to this register field starts the transfer if the channel is enabled by setting DMACH1CTL.EN.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMABUSCFG</name>
          <displayName>DMABUSCFG</displayName>
          <description>DMA Controller Master Configuration</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_MST1_BURST_SIZE</name>
              <description>Maximum burst size that can be performed on the AHB bus</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_64_BYTE</name>
                  <description>64 bytes </description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32_BYTE</name>
                  <description>32 bytes </description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16_BYTE</name>
                  <description>16 bytes </description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8_BYTE</name>
                  <description>8 bytes </description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4_BYTE</name>
                  <description>4 bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB_MST1_IDLE_EN</name>
              <description>Idle transfer insertion between consecutive burst transfers on AHB</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle transfer insertion enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_IDLE</name>
                  <description>Do not insert idle transfers.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB_MST1_INCR_EN</name>
              <description>Burst length type of AHB transfer</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPECIFIED</name>
                  <description>Fixed length bursts or single transfers</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNSPECIFIED</name>
                  <description>Unspecified length burst transfers</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB_MST1_LOCK_EN</name>
              <description>Locked transform on AHB
</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>Transfers are locked</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_LOCKED</name>
                  <description>Transfers are not locked</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB_MST1_BIGEND</name>
              <description>Endianess for the AHB master
</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIG_ENDIAN</name>
                  <description>Big Endian</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LITTLE_ENDIAN</name>
                  <description>Little Endian</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAPORTERR</name>
          <displayName>DMAPORTERR</displayName>
          <description>DMA Controller Port Error</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED13</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>13</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_ERR</name>
              <description>A 1 indicates that the Crypto peripheral has detected an AHB bus error</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED10</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>LAST_CH</name>
              <description>Indicates which channel was serviced last (channel 0 or channel 1) by the AHB master port.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
