wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>CPUIRQSEL31</name>
          <displayName>CPUIRQSEL31</displayName>
          <description>Output Selection for CPU Interrupt 31</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_COMPA</name>
                  <description>AUX Compare A event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPA</description>
                  <value>0x6a</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL32</name>
          <displayName>CPUIRQSEL32</displayName>
          <description>Output Selection for CPU Interrupt 32</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_ADC_IRQ</name>
                  <description>AUX ADC interrupt event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.ADC_IRQ. Status flags are found here AUX_EVCTL:EVTOMCUFLAGS</description>
                  <value>0x73</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL33</name>
          <displayName>CPUIRQSEL33</displayName>
          <description>Output Selection for CPU Interrupt 33</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRNG_IRQ</name>
                  <description>TRNG Interrupt event, controlled by TRNG:IRQEN.EN</description>
                  <value>0x68</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RFCSEL0</name>
          <displayName>RFCSEL0</displayName>
          <description>Output Selection for RFC Event 0</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT0A_CMP</name>
                  <description>GPT0A compare event. Configured by GPT0:TAMR.TCACT</description>
                  <value>0x3d</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RFCSEL1</name>
          <displayName>RFCSEL1</displayName>
          <description>Output Selection for RFC Event 1</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT0B_CMP</name>
                  <description>GPT0B compare event. Configured by GPT0:TBMR.TCACT</description>
                  <value>0x3e</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RFCSEL2</name>
          <displayName>RFCSEL2</displayName>
          <description>Output Selection for RFC Event 2</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT1A_CMP</name>
                  <description>GPT1A compare event. Configured by GPT1:TAMR.TCACT</description>
                  <value>0x3f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RFCSEL3</name>
          <displayName>RFCSEL3</displayName>
          <description>Output Selection for RFC Event 3</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT1B_CMP</name>
                  <description>GPT1B compare event. Configured by GPT1:TBMR.TCACT</description>
                  <value>0x40</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RFCSEL4</name>
          <displayName>RFCSEL4</displayName>
          <description>Output Selection for RFC Event 4</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT2A_CMP</name>
                  <description>GPT2A compare event. Configured by GPT2:TAMR.TCACT</description>
                  <value>0x41</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RFCSEL5</name>
          <displayName>RFCSEL5</displayName>
          <description>Output Selection for RFC Event 5</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT2B_CMP</name>
                  <description>GPT2B compare event. Configured by GPT2:TBMR.TCACT</description>
                  <value>0x42</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RFCSEL6</name>
          <displayName>RFCSEL6</displayName>
          <description>Output Selection for RFC Event 6</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT3A_CMP</name>
                  <description>GPT3A compare event. Configured by GPT3:TAMR.TCACT</description>
                  <value>0x43</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RFCSEL7</name>
          <displayName>RFCSEL7</displayName>
          <description>Output Selection for RFC Event 7</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT3B_CMP</name>
                  <description>GPT3B compare event. Configured by GPT3:TBMR.TCACT</description>
                  <value>0x44</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RFCSEL8</name>
          <displayName>RFCSEL8</displayName>
          <description>Output Selection for RFC Event 8</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_RTC_UPD</name>
                  <description>RTC periodic event controlled by AON_RTC:CTL.RTC_UPD_EN</description>
                  <value>0x77</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RFCSEL9</name>
          <displayName>RFCSEL9</displayName>
          <description>Output Selection for RFC Event 9</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read/write selection value

Writing any other value than values defined by a ENUM may result in undefined behavior.
</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <description>Always asserted</description>
                  <value>0x79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_IRQ</name>
                  <description>AUX ADC interrupt event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.ADC_IRQ. Status flags are found here AUX_EVCTL:EVTOMCUFLAGS</description>
                  <value>0x73</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_OBSMUX0</name>
                  <description>Loopback of OBSMUX0 through AUX, corresponds to AUX_EVCTL:EVTOMCUFLAGS.OBSMUX0

</description>
                  <value>0x72</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_FIFO_ALMOST_FULL</name>
                  <description>AUX ADC FIFO watermark event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.ADC_FIFO_ALMOST_FULL</description>
                  <value>0x71</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_DONE</name>
                  <description>AUX ADC done, corresponds to AUX_EVCTL:EVTOMCUFLAGS.ADC_DONE</description>
                  <value>0x70</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SMPH_AUTOTAKE_DONE</name>
                  <description>Autotake event from AUX semaphore, configured by AUX_SMPH:AUTOTAKE</description>
                  <value>0x6f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER1_EV</name>
                  <description>AUX timer 1 event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.TIMER1_EV</description>
                  <value>0x6e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER0_EV</name>
                  <description>AUX timer 0 event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.TIMER0_EV</description>
                  <value>0x6d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TDC_DONE</name>
                  <description>AUX TDC measurement done event, corresponds to the flag AUX_EVCTL:EVTOMCUFLAGS.TDC_DONE and the AUX_TDC status AUX_TDC:STAT.DONE</description>
                  <value>0x6c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB</name>
                  <description>AUX Compare B event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPB</description>
                  <value>0x6b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPA</name>
                  <description>AUX Compare A event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPA</description>
                  <value>0x6a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_AON_WU_EV</name>
                  <description>AON wakeup event, corresponds flags are here AUX_EVCTL:EVTOMCUFLAGS.AON_WU_EV</description>
                  <value>0x69</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWEV1</name>
                  <description>Software event 1, triggered by SWEV.SWEV1</description>
                  <value>0x65</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWEV0</name>
                  <description>Software event 0, triggered by SWEV.SWEV0</description>
                  <value>0x64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRYPTO_RESULT_AVAIL_IRQ</name>
                  <description>CRYPTO result available interupt event, the corresponding flag is found here CRYPTO:IRQSTAT.RESULT_AVAIL. Controlled by CRYPTO:IRQSTAT.RESULT_AVAIL</description>
                  <value>0x5d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_DONE_COMB</name>
                  <description>Combined DMA done, corresponding flags are here UDMA0:REQDONE </description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_COMB</name>
                  <description>UART0 combined interrupt, interrupt flags are found here UART0:MIS</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI1_COMB</name>
                  <description>SSI1 combined interrupt, interrupt flags are found here SSI1:MIS</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0_COMB</name>
                  <description>SSI0 combined interrupt, interrupt flags are found here SSI0:MIS</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDT_IRQ</name>
                  <description>Watchdog interrupt event, controlled by WDT:CTL.INTEN</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_AUX_SWEV0</name>
                  <description>AUX Software event 0, AUX_EVCTL:SWEVSET.SWEV0</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_IRQ</name>
                  <description>Interrupt event from I2S</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_PROG1</name>
                  <description>AON programmable event 1. Event selected by AON_EVENT MCU event selector, AON_EVENT:EVTOMCUSEL.AON_PROG1_EV</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_PROG0</name>
                  <description>AON programmable event 0. Event selected by AON_EVENT  MCU event selector, AON_EVENT:EVTOMCUSEL.AON_PROG0_EV</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
