wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>UDMACH1BSEL</name>
          <displayName>UDMACH1BSEL</displayName>
          <description>Output Selection for DMA Channel 1 REQ</description>
          <addressOffset>0x50c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0_RX_DMABREQ</name>
                  <description>UART0 RX DMA burst request, controlled by UART0:DMACTL.RXDMAE</description>
                  <value>0x30</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH2SSEL</name>
          <displayName>UDMACH2SSEL</displayName>
          <description>Output Selection for DMA Channel 2 SREQ</description>
          <addressOffset>0x510</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0_TX_DMASREQ</name>
                  <description>UART0 TX DMA single request, controlled by UART0:DMACTL.TXDMAE</description>
                  <value>0x33</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH2BSEL</name>
          <displayName>UDMACH2BSEL</displayName>
          <description>Output Selection for DMA Channel 2 REQ</description>
          <addressOffset>0x514</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0_TX_DMABREQ</name>
                  <description>UART0 TX DMA burst request, controlled by UART0:DMACTL.TXDMAE</description>
                  <value>0x32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH3SSEL</name>
          <displayName>UDMACH3SSEL</displayName>
          <description>Output Selection for DMA Channel 3 SREQ

</description>
          <addressOffset>0x518</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI0_RX_DMASREQ</name>
                  <description>SSI0 RX DMA single request, controlled by SSI0:DMACR.RXDMAE </description>
                  <value>0x29</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH3BSEL</name>
          <displayName>UDMACH3BSEL</displayName>
          <description>Output Selection for DMA Channel 3 REQ

</description>
          <addressOffset>0x51c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI0_RX_DMABREQ</name>
                  <description>SSI0 RX DMA burst request , controlled by SSI0:DMACR.RXDMAE </description>
                  <value>0x28</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH4SSEL</name>
          <displayName>UDMACH4SSEL</displayName>
          <description>Output Selection for DMA Channel 4 SREQ

</description>
          <addressOffset>0x520</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI0_TX_DMASREQ</name>
                  <description>SSI0 TX DMA single request, controlled by SSI0:DMACR.TXDMAE </description>
                  <value>0x2b</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH4BSEL</name>
          <displayName>UDMACH4BSEL</displayName>
          <description>Output Selection for DMA Channel 4 REQ

</description>
          <addressOffset>0x524</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI0_TX_DMABREQ</name>
                  <description>SSI0 TX DMA burst request , controlled by SSI0:DMACR.TXDMAE </description>
                  <value>0x2a</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH5SSEL</name>
          <displayName>UDMACH5SSEL</displayName>
          <description>Output Selection for DMA Channel 5 SREQ</description>
          <addressOffset>0x528</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH5BSEL</name>
          <displayName>UDMACH5BSEL</displayName>
          <description>Output Selection for DMA Channel 5 REQ</description>
          <addressOffset>0x52c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH6SSEL</name>
          <displayName>UDMACH6SSEL</displayName>
          <description>Output Selection for DMA Channel 6 SREQ</description>
          <addressOffset>0x530</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH6BSEL</name>
          <displayName>UDMACH6BSEL</displayName>
          <description>Output Selection for DMA Channel 6 REQ</description>
          <addressOffset>0x534</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH7SSEL</name>
          <displayName>UDMACH7SSEL</displayName>
          <description>Output Selection for DMA Channel 7 SREQ

</description>
          <addressOffset>0x538</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_DMASREQ</name>
                  <description>DMA single request event from AUX, configured by AUX_EVCTL:DMACTL</description>
                  <value>0x75</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH7BSEL</name>
          <displayName>UDMACH7BSEL</displayName>
          <description>Output Selection for DMA Channel 7 REQ

</description>
          <addressOffset>0x53c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_DMABREQ</name>
                  <description>DMA burst request event from AUX, configured by AUX_EVCTL:DMACTL</description>
                  <value>0x76</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH8SSEL</name>
          <displayName>UDMACH8SSEL</displayName>
          <description>Output Selection for DMA Channel 8 SREQ

Single request is ignored for this channel</description>
          <addressOffset>0x540</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_SW_DMABREQ</name>
                  <description>DMA sofware trigger from AUX, triggered by AUX_EVCTL:DMASWREQ.START</description>
                  <value>0x74</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH8BSEL</name>
          <displayName>UDMACH8BSEL</displayName>
          <description>Output Selection for DMA Channel 8 REQ

</description>
          <addressOffset>0x544</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_SW_DMABREQ</name>
                  <description>DMA sofware trigger from AUX, triggered by AUX_EVCTL:DMASWREQ.START</description>
                  <value>0x74</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH9SSEL</name>
          <displayName>UDMACH9SSEL</displayName>
          <description>Output Selection for DMA Channel 9 SREQ

DMA_DONE for the corresponding DMA channel is available as interrupt on GPT0 as GPT0:RIS.DMAARIS

</description>
          <addressOffset>0x548</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read/write selection value

Writing any other value than values defined by a ENUM may result in undefined behavior.
</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <description>Always asserted</description>
                  <value>0x79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B_DMABREQ</name>
                  <description>GPT3B DMA trigger event. Configured by GPT3:DMAEV</description>
                  <value>0x54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A_DMABREQ</name>
                  <description>GPT3A DMA trigger event. Configured by GPT3:DMAEV</description>
                  <value>0x53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B_DMABREQ</name>
                  <description>GPT2B DMA trigger event. Configured by GPT2:DMAEV</description>
                  <value>0x52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A_DMABREQ</name>
                  <description>GPT2A DMA trigger event. Configured by GPT2:DMAEV</description>
                  <value>0x51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B_DMABREQ</name>
                  <description>GPT1B DMA trigger event. Configured by GPT1:DMAEV</description>
                  <value>0x50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A_DMABREQ</name>
                  <description>GPT1A DMA trigger event. Configured by GPT1:DMAEV</description>
                  <value>0x4f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B_DMABREQ</name>
                  <description>GPT0B DMA trigger event. Configured by GPT0:DMAEV</description>
                  <value>0x4e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A_DMABREQ</name>
                  <description>GPT0A DMA trigger event. Configured by GPT0:DMAEV</description>
                  <value>0x4d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIE_LOW</name>
                  <description>Not used tied to 0

</description>
                  <value>0x45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH9BSEL</name>
          <displayName>UDMACH9BSEL</displayName>
          <description>Output Selection for DMA Channel 9 REQ

DMA_DONE for the corresponding DMA channel is available as interrupt on GPT0 as GPT0:RIS.DMAARIS

</description>
          <addressOffset>0x54c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read/write selection value

