wezm/dslite2svd/svd/cc2650f128-vendor.xml
Writing any other value than values defined by a ENUM may result in undefined behavior.
</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <description>Always asserted</description>
                  <value>0x79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B_DMABREQ</name>
                  <description>GPT3B DMA trigger event. Configured by GPT3:DMAEV</description>
                  <value>0x54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A_DMABREQ</name>
                  <description>GPT3A DMA trigger event. Configured by GPT3:DMAEV</description>
                  <value>0x53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B_DMABREQ</name>
                  <description>GPT2B DMA trigger event. Configured by GPT2:DMAEV</description>
                  <value>0x52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A_DMABREQ</name>
                  <description>GPT2A DMA trigger event. Configured by GPT2:DMAEV</description>
                  <value>0x51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B_DMABREQ</name>
                  <description>GPT1B DMA trigger event. Configured by GPT1:DMAEV</description>
                  <value>0x50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A_DMABREQ</name>
                  <description>GPT1A DMA trigger event. Configured by GPT1:DMAEV</description>
                  <value>0x4f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B_DMABREQ</name>
                  <description>GPT0B DMA trigger event. Configured by GPT0:DMAEV</description>
                  <value>0x4e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A_DMABREQ</name>
                  <description>GPT0A DMA trigger event. Configured by GPT0:DMAEV</description>
                  <value>0x4d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH10SSEL</name>
          <displayName>UDMACH10SSEL</displayName>
          <description>Output Selection for DMA Channel 10 SREQ

DMA_DONE for the corresponding DMA channel is available as interrupt on GPT0 as GPT0:RIS.DMABRIS

</description>
          <addressOffset>0x550</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read/write selection value

Writing any other value than values defined by a ENUM may result in undefined behavior.
</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <description>Always asserted</description>
                  <value>0x79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B_DMABREQ</name>
                  <description>GPT3B DMA trigger event. Configured by GPT3:DMAEV</description>
                  <value>0x54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A_DMABREQ</name>
                  <description>GPT3A DMA trigger event. Configured by GPT3:DMAEV</description>
                  <value>0x53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B_DMABREQ</name>
                  <description>GPT2B DMA trigger event. Configured by GPT2:DMAEV</description>
                  <value>0x52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A_DMABREQ</name>
                  <description>GPT2A DMA trigger event. Configured by GPT2:DMAEV</description>
                  <value>0x51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B_DMABREQ</name>
                  <description>GPT1B DMA trigger event. Configured by GPT1:DMAEV</description>
                  <value>0x50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A_DMABREQ</name>
                  <description>GPT1A DMA trigger event. Configured by GPT1:DMAEV</description>
                  <value>0x4f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B_DMABREQ</name>
                  <description>GPT0B DMA trigger event. Configured by GPT0:DMAEV</description>
                  <value>0x4e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A_DMABREQ</name>
                  <description>GPT0A DMA trigger event. Configured by GPT0:DMAEV</description>
                  <value>0x4d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIE_LOW</name>
                  <description>Not used tied to 0

</description>
                  <value>0x46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH10BSEL</name>
          <displayName>UDMACH10BSEL</displayName>
          <description>Output Selection for DMA Channel 10 REQ

