wezm/dslite2svd/svd/cc2650f128-vendor.xml
DMA_DONE for the corresponding DMA channel is available as interrupt on GPT0 as GPT0:RIS.DMABRIS

</description>
          <addressOffset>0x554</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read/write selection value

Writing any other value than values defined by a ENUM may result in undefined behavior.
</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <description>Always asserted</description>
                  <value>0x79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B_DMABREQ</name>
                  <description>GPT3B DMA trigger event. Configured by GPT3:DMAEV</description>
                  <value>0x54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A_DMABREQ</name>
                  <description>GPT3A DMA trigger event. Configured by GPT3:DMAEV</description>
                  <value>0x53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B_DMABREQ</name>
                  <description>GPT2B DMA trigger event. Configured by GPT2:DMAEV</description>
                  <value>0x52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A_DMABREQ</name>
                  <description>GPT2A DMA trigger event. Configured by GPT2:DMAEV</description>
                  <value>0x51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B_DMABREQ</name>
                  <description>GPT1B DMA trigger event. Configured by GPT1:DMAEV</description>
                  <value>0x50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A_DMABREQ</name>
                  <description>GPT1A DMA trigger event. Configured by GPT1:DMAEV</description>
                  <value>0x4f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B_DMABREQ</name>
                  <description>GPT0B DMA trigger event. Configured by GPT0:DMAEV</description>
                  <value>0x4e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A_DMABREQ</name>
                  <description>GPT0A DMA trigger event. Configured by GPT0:DMAEV</description>
                  <value>0x4d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH11SSEL</name>
          <displayName>UDMACH11SSEL</displayName>
          <description>Output Selection for DMA Channel 11 SREQ

DMA_DONE for the corresponding DMA channel is available as interrupt on GPT1 as GPT1:RIS.DMAARIS

</description>
          <addressOffset>0x558</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read/write selection value

Writing any other value than values defined by a ENUM may result in undefined behavior.
</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <description>Always asserted</description>
                  <value>0x79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B_DMABREQ</name>
                  <description>GPT3B DMA trigger event. Configured by GPT3:DMAEV</description>
                  <value>0x54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A_DMABREQ</name>
                  <description>GPT3A DMA trigger event. Configured by GPT3:DMAEV</description>
                  <value>0x53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B_DMABREQ</name>
                  <description>GPT2B DMA trigger event. Configured by GPT2:DMAEV</description>
                  <value>0x52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A_DMABREQ</name>
                  <description>GPT2A DMA trigger event. Configured by GPT2:DMAEV</description>
                  <value>0x51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B_DMABREQ</name>
                  <description>GPT1B DMA trigger event. Configured by GPT1:DMAEV</description>
                  <value>0x50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A_DMABREQ</name>
                  <description>GPT1A DMA trigger event. Configured by GPT1:DMAEV</description>
                  <value>0x4f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B_DMABREQ</name>
                  <description>GPT0B DMA trigger event. Configured by GPT0:DMAEV</description>
                  <value>0x4e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A_DMABREQ</name>
                  <description>GPT0A DMA trigger event. Configured by GPT0:DMAEV</description>
                  <value>0x4d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIE_LOW</name>
                  <description>Not used tied to 0

</description>
                  <value>0x47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH11BSEL</name>
          <displayName>UDMACH11BSEL</displayName>
          <description>Output Selection for DMA Channel 11 REQ

DMA_DONE for the corresponding DMA channel is available as interrupt on GPT1 as GPT1:RIS.DMAARIS

</description>
          <addressOffset>0x55c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read/write selection value

Writing any other value than values defined by a ENUM may result in undefined behavior.
</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <description>Always asserted</description>
                  <value>0x79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B_DMABREQ</name>
                  <description>GPT3B DMA trigger event. Configured by GPT3:DMAEV</description>
                  <value>0x54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A_DMABREQ</name>
                  <description>GPT3A DMA trigger event. Configured by GPT3:DMAEV</description>
                  <value>0x53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B_DMABREQ</name>
                  <description>GPT2B DMA trigger event. Configured by GPT2:DMAEV</description>
                  <value>0x52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A_DMABREQ</name>
                  <description>GPT2A DMA trigger event. Configured by GPT2:DMAEV</description>
                  <value>0x51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B_DMABREQ</name>
                  <description>GPT1B DMA trigger event. Configured by GPT1:DMAEV</description>
                  <value>0x50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A_DMABREQ</name>
                  <description>GPT1A DMA trigger event. Configured by GPT1:DMAEV</description>
                  <value>0x4f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B_DMABREQ</name>
                  <description>GPT0B DMA trigger event. Configured by GPT0:DMAEV</description>
                  <value>0x4e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A_DMABREQ</name>
                  <description>GPT0A DMA trigger event. Configured by GPT0:DMAEV</description>
                  <value>0x4d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH12SSEL</name>
          <displayName>UDMACH12SSEL</displayName>
          <description>Output Selection for DMA Channel 12 SREQ

DMA_DONE for the corresponding DMA channel is available as interrupt on GPT1 as GPT1:RIS.DMABRIS

</description>
          <addressOffset>0x560</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read/write selection value

Writing any other value than values defined by a ENUM may result in undefined behavior.
</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <description>Always asserted</description>
                  <value>0x79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B_DMABREQ</name>
                  <description>GPT3B DMA trigger event. Configured by GPT3:DMAEV</description>
                  <value>0x54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A_DMABREQ</name>
                  <description>GPT3A DMA trigger event. Configured by GPT3:DMAEV</description>
                  <value>0x53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B_DMABREQ</name>
                  <description>GPT2B DMA trigger event. Configured by GPT2:DMAEV</description>
                  <value>0x52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A_DMABREQ</name>
                  <description>GPT2A DMA trigger event. Configured by GPT2:DMAEV</description>
                  <value>0x51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B_DMABREQ</name>
                  <description>GPT1B DMA trigger event. Configured by GPT1:DMAEV</description>
                  <value>0x50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A_DMABREQ</name>
                  <description>GPT1A DMA trigger event. Configured by GPT1:DMAEV</description>
                  <value>0x4f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B_DMABREQ</name>
                  <description>GPT0B DMA trigger event. Configured by GPT0:DMAEV</description>
                  <value>0x4e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A_DMABREQ</name>
                  <description>GPT0A DMA trigger event. Configured by GPT0:DMAEV</description>
                  <value>0x4d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIE_LOW</name>
                  <description>Not used tied to 0

</description>
                  <value>0x48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH12BSEL</name>
          <displayName>UDMACH12BSEL</displayName>
          <description>Output Selection for DMA Channel 12 REQ

DMA_DONE for the corresponding DMA channel is available as interrupt on GPT1 as GPT1:RIS.DMABRIS

</description>
          <addressOffset>0x564</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read/write selection value

Writing any other value than values defined by a ENUM may result in undefined behavior.
</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <description>Always asserted</description>
                  <value>0x79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B_DMABREQ</name>
                  <description>GPT3B DMA trigger event. Configured by GPT3:DMAEV</description>
                  <value>0x54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A_DMABREQ</name>
                  <description>GPT3A DMA trigger event. Configured by GPT3:DMAEV</description>
                  <value>0x53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B_DMABREQ</name>
                  <description>GPT2B DMA trigger event. Configured by GPT2:DMAEV</description>
                  <value>0x52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A_DMABREQ</name>
                  <description>GPT2A DMA trigger event. Configured by GPT2:DMAEV</description>
                  <value>0x51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B_DMABREQ</name>
                  <description>GPT1B DMA trigger event. Configured by GPT1:DMAEV</description>
                  <value>0x50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A_DMABREQ</name>
                  <description>GPT1A DMA trigger event. Configured by GPT1:DMAEV</description>
                  <value>0x4f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B_DMABREQ</name>
                  <description>GPT0B DMA trigger event. Configured by GPT0:DMAEV</description>
                  <value>0x4e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A_DMABREQ</name>
                  <description>GPT0A DMA trigger event. Configured by GPT0:DMAEV</description>
                  <value>0x4d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH13SSEL</name>
          <displayName>UDMACH13SSEL</displayName>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <addressOffset>0x568</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EV</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_PROG2</name>
                  <description>AON programmable event 2. Event selected by AON_EVENT MCU event selector, AON_EVENT:EVTOMCUSEL.AON_PROG2_EV</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH13BSEL</name>
          <displayName>UDMACH13BSEL</displayName>
          <description>Output Selection for DMA Channel 13 REQ</description>
          <addressOffset>0x56c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_PROG2</name>
                  <description>AON programmable event 2. Event selected by AON_EVENT MCU event selector, AON_EVENT:EVTOMCUSEL.AON_PROG2_EV</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH14SSEL</name>
          <displayName>UDMACH14SSEL</displayName>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <addressOffset>0x570</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EV</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_PROG0</name>
                  <description>AON programmable event 0. Event selected by AON_EVENT  MCU event selector, AON_EVENT:EVTOMCUSEL.AON_PROG0_EV</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH14BSEL</name>
          <displayName>UDMACH14BSEL</displayName>
          <description>Output Selection for DMA Channel 14 REQ</description>
          <addressOffset>0x574</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read/write selection value

