wezm/dslite2svd/svd/cc2650f128-vendor.xml
Writing any other value than values defined by a ENUM may result in undefined behavior.
</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <description>Always asserted</description>
                  <value>0x79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU_HALTED</name>
                  <description>CPU halted </description>
                  <value>0x78</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_UPD</name>
                  <description>RTC periodic event controlled by AON_RTC:CTL.RTC_UPD_EN</description>
                  <value>0x77</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_DMABREQ</name>
                  <description>DMA burst request event from AUX, configured by AUX_EVCTL:DMACTL</description>
                  <value>0x76</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_DMASREQ</name>
                  <description>DMA single request event from AUX, configured by AUX_EVCTL:DMACTL</description>
                  <value>0x75</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SW_DMABREQ</name>
                  <description>DMA sofware trigger from AUX, triggered by AUX_EVCTL:DMASWREQ.START</description>
                  <value>0x74</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_IRQ</name>
                  <description>AUX ADC interrupt event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.ADC_IRQ. Status flags are found here AUX_EVCTL:EVTOMCUFLAGS</description>
                  <value>0x73</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_OBSMUX0</name>
                  <description>Loopback of OBSMUX0 through AUX, corresponds to AUX_EVCTL:EVTOMCUFLAGS.OBSMUX0

</description>
                  <value>0x72</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_FIFO_ALMOST_FULL</name>
                  <description>AUX ADC FIFO watermark event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.ADC_FIFO_ALMOST_FULL</description>
                  <value>0x71</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_DONE</name>
                  <description>AUX ADC done, corresponds to AUX_EVCTL:EVTOMCUFLAGS.ADC_DONE</description>
                  <value>0x70</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SMPH_AUTOTAKE_DONE</name>
                  <description>Autotake event from AUX semaphore, configured by AUX_SMPH:AUTOTAKE</description>
                  <value>0x6f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER1_EV</name>
                  <description>AUX timer 1 event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.TIMER1_EV</description>
                  <value>0x6e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER0_EV</name>
                  <description>AUX timer 0 event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.TIMER0_EV</description>
                  <value>0x6d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TDC_DONE</name>
                  <description>AUX TDC measurement done event, corresponds to the flag AUX_EVCTL:EVTOMCUFLAGS.TDC_DONE and the AUX_TDC status AUX_TDC:STAT.DONE</description>
                  <value>0x6c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB</name>
                  <description>AUX Compare B event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPB</description>
                  <value>0x6b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPA</name>
                  <description>AUX Compare A event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPA</description>
                  <value>0x6a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_AON_WU_EV</name>
                  <description>AON wakeup event, corresponds flags are here AUX_EVCTL:EVTOMCUFLAGS.AON_WU_EV</description>
                  <value>0x69</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRNG_IRQ</name>
                  <description>TRNG Interrupt event, controlled by TRNG:IRQEN.EN</description>
                  <value>0x68</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWEV3</name>
                  <description>Software event 3, triggered by SWEV.SWEV3</description>
                  <value>0x67</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWEV2</name>
                  <description>Software event 2, triggered by SWEV.SWEV2</description>
                  <value>0x66</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWEV1</name>
                  <description>Software event 1, triggered by SWEV.SWEV1</description>
                  <value>0x65</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWEV0</name>
                  <description>Software event 0, triggered by SWEV.SWEV0</description>
                  <value>0x64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDT_NMI</name>
                  <description>Watchdog non maskable interrupt event, controlled by WDT:CTL.INTTYPE</description>
                  <value>0x63</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRYPTO_DMA_DONE_IRQ</name>
                  <description>CRYPTO DMA input done event, the correspondingg flag is CRYPTO:IRQSTAT.DMA_IN_DONE. Controlled by CRYPTO:IRQEN.DMA_IN_DONE</description>
                  <value>0x5e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRYPTO_RESULT_AVAIL_IRQ</name>
                  <description>CRYPTO result available interupt event, the corresponding flag is found here CRYPTO:IRQSTAT.RESULT_AVAIL. Controlled by CRYPTO:IRQSTAT.RESULT_AVAIL</description>
                  <value>0x5d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT7</name>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT7 wil be routed here.</description>
                  <value>0x5c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT6</name>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT6 wil be routed here.</description>
                  <value>0x5b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT5</name>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT4 wil be routed here.</description>
                  <value>0x5a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT4</name>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT4 wil be routed here.</description>
                  <value>0x59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT3</name>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT3 wil be routed here.</description>
                  <value>0x58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT2</name>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT2 wil be routed here.</description>
                  <value>0x57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT1</name>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT1 wil be routed here.</description>
                  <value>0x56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT0</name>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT0 wil be routed here. </description>
                  <value>0x55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B_DMABREQ</name>
                  <description>GPT3B DMA trigger event. Configured by GPT3:DMAEV</description>
                  <value>0x54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A_DMABREQ</name>
                  <description>GPT3A DMA trigger event. Configured by GPT3:DMAEV</description>
                  <value>0x53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B_DMABREQ</name>
                  <description>GPT2B DMA trigger event. Configured by GPT2:DMAEV</description>
                  <value>0x52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A_DMABREQ</name>
                  <description>GPT2A DMA trigger event. Configured by GPT2:DMAEV</description>
                  <value>0x51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B_DMABREQ</name>
                  <description>GPT1B DMA trigger event. Configured by GPT1:DMAEV</description>
                  <value>0x50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A_DMABREQ</name>
                  <description>GPT1A DMA trigger event. Configured by GPT1:DMAEV</description>
                  <value>0x4f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B_DMABREQ</name>
                  <description>GPT0B DMA trigger event. Configured by GPT0:DMAEV</description>
                  <value>0x4e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A_DMABREQ</name>
                  <description>GPT0A DMA trigger event. Configured by GPT0:DMAEV</description>
                  <value>0x4d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B_CMP</name>
                  <description>GPT3B compare event. Configured by GPT3:TBMR.TCACT</description>
                  <value>0x44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A_CMP</name>
                  <description>GPT3A compare event. Configured by GPT3:TAMR.TCACT</description>
                  <value>0x43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B_CMP</name>
                  <description>GPT2B compare event. Configured by GPT2:TBMR.TCACT</description>
                  <value>0x42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A_CMP</name>
                  <description>GPT2A compare event. Configured by GPT2:TAMR.TCACT</description>
                  <value>0x41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B_CMP</name>
                  <description>GPT1B compare event. Configured by GPT1:TBMR.TCACT</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A_CMP</name>
                  <description>GPT1A compare event. Configured by GPT1:TAMR.TCACT</description>
                  <value>0x3f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B_CMP</name>
                  <description>GPT0B compare event. Configured by GPT0:TBMR.TCACT</description>
                  <value>0x3e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A_CMP</name>
                  <description>GPT0A compare event. Configured by GPT0:TAMR.TCACT</description>
                  <value>0x3d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_TX_DMASREQ</name>
                  <description>UART0 TX DMA single request, controlled by UART0:DMACTL.TXDMAE</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_TX_DMABREQ</name>
                  <description>UART0 TX DMA burst request, controlled by UART0:DMACTL.TXDMAE</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RX_DMASREQ</name>
                  <description>UART0 RX DMA single request, controlled by UART0:DMACTL.RXDMAE</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RX_DMABREQ</name>
                  <description>UART0 RX DMA burst request, controlled by UART0:DMACTL.RXDMAE</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI1_TX_DMASREQ</name>
                  <description>SSI1 TX DMA single request, controlled by SSI0:DMACR.TXDMAE </description>
                  <value>0x2f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI1_TX_DMABREQ</name>
                  <description>SSI1 TX DMA burst request , controlled by SSI0:DMACR.TXDMAE </description>
                  <value>0x2e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI1_RX_DMASREQ</name>
                  <description>SSI1 RX DMA single request, controlled by SSI0:DMACR.RXDMAE </description>
                  <value>0x2d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI1_RX_DMABREQ</name>
                  <description>SSI1 RX DMA burst request , controlled by SSI0:DMACR.RXDMAE </description>
                  <value>0x2c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0_TX_DMASREQ</name>
                  <description>SSI0 TX DMA single request, controlled by SSI0:DMACR.TXDMAE </description>
                  <value>0x2b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0_TX_DMABREQ</name>
                  <description>SSI0 TX DMA burst request , controlled by SSI0:DMACR.TXDMAE </description>
                  <value>0x2a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0_RX_DMASREQ</name>
                  <description>SSI0 RX DMA single request, controlled by SSI0:DMACR.RXDMAE </description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0_RX_DMABREQ</name>
                  <description>SSI0 RX DMA burst request , controlled by SSI0:DMACR.RXDMAE </description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_DONE_COMB</name>
                  <description>Combined DMA done, corresponding flags are here UDMA0:REQDONE </description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_ERR</name>
                  <description>DMA bus error, corresponds to UDMA0:ERROR.STATUS</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_COMB</name>
                  <description>UART0 combined interrupt, interrupt flags are found here UART0:MIS</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI1_COMB</name>
                  <description>SSI1 combined interrupt, interrupt flags are found here SSI1:MIS</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0_COMB</name>
                  <description>SSI0 combined interrupt, interrupt flags are found here SSI0:MIS</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_CPE_1</name>
                  <description>Combined Interrupt for CPE Generated events. Corresponding flags are here RFC_DBELL:RFCPEIFG. Only interrupts selected with CPE1 in RFC_DBELL:RFCPEIFG can trigger a RFC_CPE_1 event</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SWEV1</name>
                  <description>AUX software event 1, triggered by AUX_EVCTL:SWEVSET.SWEV1, also available as AUX_EVENT2 AON wake up event.
MCU domain wakeup control AON_EVENT:MCUWUSEL
AUX domain wakeup control AON_EVENT:AUXWUSEL

