wezm/dslite2svd/svd/cc2650f128-vendor.xml
</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_CPE_0</name>
                  <description>Combined Interrupt for CPE Generated events. Corresponding flags are here RFC_DBELL:RFCPEIFG. Only interrupts selected with CPE0 in RFC_DBELL:RFCPEIFG can trigger a RFC_CPE_0 event</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_HW_COMB</name>
                  <description>Combined RFC hardware interrupt, corresponding flag is here RFC_DBELL:RFHWIFG</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_CMD_ACK</name>
                  <description>RFC Doorbell Command Acknowledgement Interrupt, equvialent to RFC_DBELL:RFACKIFG.ACKFLAG</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDT_IRQ</name>
                  <description>Watchdog interrupt event, controlled by WDT:CTL.INTEN</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_CH18_DONE</name>
                  <description>DMA done for software tiggered UDMA channel 18, see UDMA0:SOFTREQ</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH</name>
                  <description>FLASH controller error event,  the status flags are FLASH:FEDACSTAT.FSM_DONE and FLASH:FEDACSTAT.RVF_INT</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_CH0_DONE</name>
                  <description>DMA done for software tiggered UDMA channel 0, see UDMA0:SOFTREQ</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B</name>
                  <description>GPT1B interrupt event, controlled by GPT1:TBMR</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A</name>
                  <description>GPT1A interrupt event, controlled by GPT1:TAMR</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B</name>
                  <description>GPT0B interrupt event, controlled by GPT0:TBMR</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A</name>
                  <description>GPT0A interrupt event, controlled by GPT0:TAMR</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B</name>
                  <description>GPT3B interrupt event, controlled by GPT3:TBMR</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A</name>
                  <description>GPT3A interrupt event, controlled by GPT3:TAMR</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B</name>
                  <description>GPT2B interrupt event, controlled by GPT2:TBMR</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A</name>
                  <description>GPT2A interrupt event, controlled by GPT2:TAMR</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMB</name>
                  <description>AUX combined event, the corresponding flag register is here AUX_EVCTL:EVTOMCUFLAGS</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_AUX_SWEV0</name>
                  <description>AUX Software event 0, AUX_EVCTL:SWEVSET.SWEV0</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_IRQ</name>
                  <description>Interrupt event from I2C</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_IRQ</name>
                  <description>Interrupt event from I2S</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_COMB</name>
                  <description>Event from AON_RTC, controlled by the AON_RTC:CTL.COMB_EV_MASK setting</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_GPIO_EDGE</name>
                  <description>Edge detect event from IOC. Configureded by the IOC:IOCFGn.EDGE_IRQ_EN and  IOC:IOCFGn.EDGE_DET settings</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_PROG2</name>
                  <description>AON programmable event 2. Event selected by AON_EVENT MCU event selector, AON_EVENT:EVTOMCUSEL.AON_PROG2_EV</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_PROG1</name>
                  <description>AON programmable event 1. Event selected by AON_EVENT MCU event selector, AON_EVENT:EVTOMCUSEL.AON_PROG1_EV</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_PROG0</name>
                  <description>AON programmable event 0. Event selected by AON_EVENT  MCU event selector, AON_EVENT:EVTOMCUSEL.AON_PROG0_EV</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH15SSEL</name>
          <displayName>UDMACH15SSEL</displayName>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <addressOffset>0x578</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EV</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_RTC_COMB</name>
                  <description>Event from AON_RTC, controlled by the AON_RTC:CTL.COMB_EV_MASK setting</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH15BSEL</name>
          <displayName>UDMACH15BSEL</displayName>
          <description>Output Selection for DMA Channel 15 REQ</description>
          <addressOffset>0x57c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_RTC_COMB</name>
                  <description>Event from AON_RTC, controlled by the AON_RTC:CTL.COMB_EV_MASK setting</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH16SSEL</name>
          <displayName>UDMACH16SSEL</displayName>
          <description>Output Selection for DMA Channel 16 SREQ

</description>
          <addressOffset>0x580</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI1_RX_DMASREQ</name>
                  <description>SSI1 RX DMA single request, controlled by SSI0:DMACR.RXDMAE </description>
                  <value>0x2d</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH16BSEL</name>
          <displayName>UDMACH16BSEL</displayName>
          <description>Output Selection for DMA Channel 16 REQ

</description>
          <addressOffset>0x584</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI1_RX_DMABREQ</name>
                  <description>SSI1 RX DMA burst request , controlled by SSI0:DMACR.RXDMAE </description>
                  <value>0x2c</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH17SSEL</name>
          <displayName>UDMACH17SSEL</displayName>
          <description>Output Selection for DMA Channel 17 SREQ

</description>
          <addressOffset>0x588</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI1_TX_DMASREQ</name>
                  <description>SSI1 TX DMA single request, controlled by SSI0:DMACR.TXDMAE </description>
                  <value>0x2f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH17BSEL</name>
          <displayName>UDMACH17BSEL</displayName>
          <description>Output Selection for DMA Channel 17 REQ

</description>
          <addressOffset>0x58c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI1_TX_DMABREQ</name>
                  <description>SSI1 TX DMA burst request , controlled by SSI0:DMACR.TXDMAE </description>
                  <value>0x2e</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH18SSEL</name>
          <displayName>UDMACH18SSEL</displayName>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <addressOffset>0x590</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EV</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH18BSEL</name>
          <displayName>UDMACH18BSEL</displayName>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <addressOffset>0x594</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EV</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH19SSEL</name>
          <displayName>UDMACH19SSEL</displayName>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <addressOffset>0x598</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EV</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH19BSEL</name>
          <displayName>UDMACH19BSEL</displayName>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <addressOffset>0x59c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EV</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH20SSEL</name>
          <displayName>UDMACH20SSEL</displayName>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <addressOffset>0x5a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EV</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH20BSEL</name>
          <displayName>UDMACH20BSEL</displayName>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <addressOffset>0x5a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EV</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH21SSEL</name>
          <displayName>UDMACH21SSEL</displayName>
          <description>Output Selection for DMA Channel 21 SREQ</description>
          <addressOffset>0x5a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWEV0</name>
                  <description>Software event 0, triggered by SWEV.SWEV0</description>
                  <value>0x64</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
