wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>UDMACH21BSEL</name>
          <displayName>UDMACH21BSEL</displayName>
          <description>Output Selection for DMA Channel 21 REQ</description>
          <addressOffset>0x5ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWEV0</name>
                  <description>Software event 0, triggered by SWEV.SWEV0</description>
                  <value>0x64</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH22SSEL</name>
          <displayName>UDMACH22SSEL</displayName>
          <description>Output Selection for DMA Channel 22 SREQ</description>
          <addressOffset>0x5b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWEV1</name>
                  <description>Software event 1, triggered by SWEV.SWEV1</description>
                  <value>0x65</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH22BSEL</name>
          <displayName>UDMACH22BSEL</displayName>
          <description>Output Selection for DMA Channel 22 REQ</description>
          <addressOffset>0x5b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWEV1</name>
                  <description>Software event 1, triggered by SWEV.SWEV1</description>
                  <value>0x65</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH23SSEL</name>
          <displayName>UDMACH23SSEL</displayName>
          <description>Output Selection for DMA Channel 23 SREQ</description>
          <addressOffset>0x5b8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWEV2</name>
                  <description>Software event 2, triggered by SWEV.SWEV2</description>
                  <value>0x66</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH23BSEL</name>
          <displayName>UDMACH23BSEL</displayName>
          <description>Output Selection for DMA Channel 23 REQ</description>
          <addressOffset>0x5bc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWEV2</name>
                  <description>Software event 2, triggered by SWEV.SWEV2</description>
                  <value>0x66</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH24SSEL</name>
          <displayName>UDMACH24SSEL</displayName>
          <description>Output Selection for DMA Channel 24 SREQ</description>
          <addressOffset>0x5c0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWEV3</name>
                  <description>Software event 3, triggered by SWEV.SWEV3</description>
                  <value>0x67</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH24BSEL</name>
          <displayName>UDMACH24BSEL</displayName>
          <description>Output Selection for DMA Channel 24 REQ</description>
          <addressOffset>0x5c4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWEV3</name>
                  <description>Software event 3, triggered by SWEV.SWEV3</description>
                  <value>0x67</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH25SSEL</name>
          <displayName>UDMACH25SSEL</displayName>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <addressOffset>0x5c8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EV</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH25BSEL</name>
          <displayName>UDMACH25BSEL</displayName>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <addressOffset>0x5cc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EV</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH26SSEL</name>
          <displayName>UDMACH26SSEL</displayName>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <addressOffset>0x5d0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EV</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH26BSEL</name>
          <displayName>UDMACH26BSEL</displayName>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <addressOffset>0x5d4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EV</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH27SSEL</name>
          <displayName>UDMACH27SSEL</displayName>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <addressOffset>0x5d8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EV</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH27BSEL</name>
          <displayName>UDMACH27BSEL</displayName>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <addressOffset>0x5dc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EV</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH28SSEL</name>
          <displayName>UDMACH28SSEL</displayName>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <addressOffset>0x5e0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EV</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH28BSEL</name>
          <displayName>UDMACH28BSEL</displayName>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <addressOffset>0x5e4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EV</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH29SSEL</name>
          <displayName>UDMACH29SSEL</displayName>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <addressOffset>0x5e8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EV</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH29BSEL</name>
          <displayName>UDMACH29BSEL</displayName>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <addressOffset>0x5ec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EV</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH30SSEL</name>
          <displayName>UDMACH30SSEL</displayName>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <addressOffset>0x5f0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EV</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH30BSEL</name>
          <displayName>UDMACH30BSEL</displayName>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <addressOffset>0x5f4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EV</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
