wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>AUXSEL0</name>
          <displayName>AUXSEL0</displayName>
          <description>Output Selection for AUX Subscriber 0</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read/write selection value

Writing any other value than values defined by a ENUM may result in undefined behavior.
</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <description>Always asserted</description>
                  <value>0x79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B</name>
                  <description>GPT1B interrupt event, controlled by GPT1:TBMR</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A</name>
                  <description>GPT1A interrupt event, controlled by GPT1:TAMR</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B</name>
                  <description>GPT0B interrupt event, controlled by GPT0:TBMR</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A</name>
                  <description>GPT0A interrupt event, controlled by GPT0:TAMR</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B</name>
                  <description>GPT3B interrupt event, controlled by GPT3:TBMR</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A</name>
                  <description>GPT3A interrupt event, controlled by GPT3:TAMR</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B</name>
                  <description>GPT2B interrupt event, controlled by GPT2:TBMR</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A</name>
                  <description>GPT2A interrupt event, controlled by GPT2:TAMR</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CM3NMISEL0</name>
          <displayName>CM3NMISEL0</displayName>
          <description>Output Selection for NMI Subscriber 0</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read only selection value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDT_NMI</name>
                  <description>Watchdog non maskable interrupt event, controlled by WDT:CTL.INTTYPE</description>
                  <value>0x63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>I2SSTMPSEL0</name>
          <displayName>I2SSTMPSEL0</displayName>
          <description>Output Selection for I2S Subscriber 0</description>
          <addressOffset>0x900</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read/write selection value

Writing any other value than values defined by a ENUM may result in undefined behavior.
</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <description>Always asserted</description>
                  <value>0x79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FRZSEL0</name>
          <displayName>FRZSEL0</displayName>
          <description>Output Selection for FRZ Subscriber
The halted debug signal is passed to peripherals such as the General Purpose Timer, Sensor Controller with Digital and Analog Peripherals (AUX), Radio, and RTC. When the system CPU halts, the connected peripherals that have freeze enabled also halt. The programmable output can be set to static values of 0 or 1, and can also be set to pass the halted signal.</description>
          <addressOffset>0xa00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Read/write selection value

Writing any other value than values defined by a ENUM may result in undefined behavior.
</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <description>Always asserted</description>
                  <value>0x79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU_HALTED</name>
                  <description>CPU halted </description>
                  <value>0x78</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Always inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWEV</name>
          <displayName>SWEV</displayName>
          <description>Set or Clear Software Events</description>
          <addressOffset>0xf00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>25</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SWEV3</name>
              <description>Writing "1" to this bit when the value is "0" triggers the Software 3 event. </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>17</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SWEV2</name>
              <description>Writing "1" to this bit when the value is "0" triggers the Software 2 event. </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>9</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SWEV1</name>
              <description>Writing "1" to this bit when the value is "0" triggers the Software 1 event. </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SWEV0</name>
              <description>Writing "1" to this bit when the value is "0" triggers the Software 0 event. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
