wezm/dslite2svd/svd/cc2650f128-vendor.xml
      </registers>
    </peripheral>
    <!-- ../Modules/CC26xx/CC2650/FCFG1.xml -->
    <peripheral>
      <name>FCFG1</name>
      <description>Factory configuration area (FCFG1)</description>
      <baseAddress>0x50001000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>MISC_CONF_1</name>
          <displayName>MISC_CONF_1</displayName>
          <description>Misc configurations</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>8</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DEVICE_MINOR_REV</name>
              <description>HW minor revision number (a value of 0xFF shall be treated equally to 0x00).
Any test of this field by SW should be implemented as a 'greater or equal' comparison as signed integer.
Value may change without warning.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC_CONF_2</name>
          <displayName>MISC_CONF_2</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HPOSC_COMP_P3</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_RF_FRONTEND_DIV5</name>
          <displayName>CONFIG_RF_FRONTEND_DIV5</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IFAMP_IB</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>LNA_IB</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>IFAMP_TRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>19</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CTL_PA0_TRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>14</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>7</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RFLDO_TRIM_OUTPUT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_RF_FRONTEND_DIV6</name>
          <displayName>CONFIG_RF_FRONTEND_DIV6</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IFAMP_IB</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>LNA_IB</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>IFAMP_TRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>19</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CTL_PA0_TRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>14</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>7</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RFLDO_TRIM_OUTPUT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_RF_FRONTEND_DIV10</name>
          <displayName>CONFIG_RF_FRONTEND_DIV10</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IFAMP_IB</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>LNA_IB</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>IFAMP_TRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>19</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CTL_PA0_TRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>14</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>7</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RFLDO_TRIM_OUTPUT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_RF_FRONTEND_DIV12</name>
          <displayName>CONFIG_RF_FRONTEND_DIV12</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IFAMP_IB</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>LNA_IB</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>IFAMP_TRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>19</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CTL_PA0_TRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>14</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>7</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RFLDO_TRIM_OUTPUT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_RF_FRONTEND_DIV15</name>
          <displayName>CONFIG_RF_FRONTEND_DIV15</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IFAMP_IB</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>LNA_IB</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>IFAMP_TRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>19</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CTL_PA0_TRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>14</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>7</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RFLDO_TRIM_OUTPUT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_RF_FRONTEND_DIV30</name>
          <displayName>CONFIG_RF_FRONTEND_DIV30</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IFAMP_IB</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>LNA_IB</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>IFAMP_TRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>19</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CTL_PA0_TRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>14</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>7</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RFLDO_TRIM_OUTPUT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV5</name>
          <displayName>CONFIG_SYNTH_DIV5</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>Trim value for RF Core.
Value is read by RF Core ROM FW during RF Core initialization.</description>
              <lsb>12</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SLDO_TRIM_OUTPUT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV6</name>
          <displayName>CONFIG_SYNTH_DIV6</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>Trim value for RF Core.
Value is read by RF Core ROM FW during RF Core initialization.</description>
              <lsb>12</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SLDO_TRIM_OUTPUT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV10</name>
          <displayName>CONFIG_SYNTH_DIV10</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>Trim value for RF Core.
Value is read by RF Core ROM FW during RF Core initialization.</description>
              <lsb>12</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SLDO_TRIM_OUTPUT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV12</name>
          <displayName>CONFIG_SYNTH_DIV12</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>Trim value for RF Core.
Value is read by RF Core ROM FW during RF Core initialization.</description>
              <lsb>12</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SLDO_TRIM_OUTPUT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV15</name>
          <displayName>CONFIG_SYNTH_DIV15</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>Trim value for RF Core.
Value is read by RF Core ROM FW during RF Core initialization.</description>
              <lsb>12</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SLDO_TRIM_OUTPUT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV30</name>
          <displayName>CONFIG_SYNTH_DIV30</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>Trim value for RF Core.
Value is read by RF Core ROM FW during RF Core initialization.</description>
              <lsb>12</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SLDO_TRIM_OUTPUT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
