wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>CONFIG_MISC_ADC_DIV5</name>
          <displayName>CONFIG_MISC_ADC_DIV5</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>17</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RSSI_OFFSET</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>9</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>QUANTCTLTHRES</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DACTRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_MISC_ADC_DIV6</name>
          <displayName>CONFIG_MISC_ADC_DIV6</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>17</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RSSI_OFFSET</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>9</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>QUANTCTLTHRES</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DACTRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_MISC_ADC_DIV10</name>
          <displayName>CONFIG_MISC_ADC_DIV10</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>17</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RSSI_OFFSET</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>9</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>QUANTCTLTHRES</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DACTRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_MISC_ADC_DIV12</name>
          <displayName>CONFIG_MISC_ADC_DIV12</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>17</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RSSI_OFFSET</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>9</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>QUANTCTLTHRES</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DACTRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_MISC_ADC_DIV15</name>
          <displayName>CONFIG_MISC_ADC_DIV15</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>17</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RSSI_OFFSET</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>9</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>QUANTCTLTHRES</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DACTRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_MISC_ADC_DIV30</name>
          <displayName>CONFIG_MISC_ADC_DIV30</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>17</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RSSI_OFFSET</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>9</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>QUANTCTLTHRES</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DACTRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHDW_DIE_ID_0</name>
          <displayName>SHDW_DIE_ID_0</displayName>
          <description>Shadow of DIE_ID_0 register in eFuse</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ID_31_0</name>
              <description>Shadow of DIE_ID_0 register in eFuse row number 3</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHDW_DIE_ID_1</name>
          <displayName>SHDW_DIE_ID_1</displayName>
          <description>Shadow of DIE_ID_1 register in eFuse</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ID_63_32</name>
              <description>Shadow of DIE_ID_1 register in eFuse row number 4</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHDW_DIE_ID_2</name>
          <displayName>SHDW_DIE_ID_2</displayName>
          <description>Shadow of DIE_ID_2 register in eFuse</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ID_95_64</name>
              <description>Shadow of DIE_ID_2 register in eFuse row number 5</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHDW_DIE_ID_3</name>
          <displayName>SHDW_DIE_ID_3</displayName>
          <description>Shadow of DIE_ID_3 register in eFuse</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ID_127_96</name>
              <description>Shadow of DIE_ID_3 register in eFuse row number 6</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHDW_OSC_BIAS_LDO_TRIM</name>
          <displayName>SHDW_OSC_BIAS_LDO_TRIM</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SET_RCOSC_HF_COARSE_RESISTOR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>27</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIMMAG</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>23</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIMIREF</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>18</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ITRIM_DIG_LDO</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VTRIM_DIG</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VTRIM_COARSE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RCOSCHF_CTRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHDW_ANA_TRIM</name>
          <displayName>SHDW_ANA_TRIM</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>27</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD_BANDGAP_TRIM_CNF</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>25</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VDDR_ENABLE_PG1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VDDR_OK_HYS</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>IPTAT_TRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>21</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VDDR_TRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIMBOD_INTMODE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>11</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIMBOD_EXTMODE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIMTEMP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_NUMBER</name>
          <displayName>FLASH_NUMBER</displayName>
          <description></description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LOT_NUMBER</name>
              <description>Number of the manufacturing lot that produced this unit.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_COORDINATE</name>
          <displayName>FLASH_COORDINATE</displayName>
          <description></description>
          <addressOffset>0x16c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XCOORDINATE</name>
              <description>X coordinate of this unit on the wafer.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>YCOORDINATE</name>
              <description>Y coordinate of this unit on the wafer.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_E_P</name>
          <displayName>FLASH_E_P</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PSU</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ESU</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PVSU</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EVSU</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_C_E_P_R</name>
          <displayName>FLASH_C_E_P_R</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RVSU</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PV_ACCESS</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>A_EXEZ_SETUP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CVSU</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_P_R_PV</name>
          <displayName>FLASH_P_R_PV</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PVH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PVH2</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_EH_SEQ</name>
          <displayName>FLASH_EH_SEQ</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x17c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SEQ</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VSTAT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SM_FREQUENCY</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_VHV_E</name>
          <displayName>FLASH_VHV_E</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VHV_E_START</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VHV_E_STEP_HIGHT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
