wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>FLASH_PP</name>
          <displayName>FLASH_PP</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PUMP_SU</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MAX_PP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_PROG_EP</name>
          <displayName>FLASH_PROG_EP</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAX_EP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PROGRAM_PW</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_ERA_PW</name>
          <displayName>FLASH_ERA_PW</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ERASE_PW</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_VHV</name>
          <displayName>FLASH_VHV</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIM13_P</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VHV_P</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIM13_E</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VHV_E</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_VHV_PV</name>
          <displayName>FLASH_VHV_PV</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIM13_PV</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VHV_PV</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VCG2P5</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VINH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_V</name>
          <displayName>FLASH_V</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VSL_P</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VWL_P</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>V_READ</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USER_ID</name>
          <displayName>USER_ID</displayName>
          <description>User Identification.
Reading this register and the ICEPICK_DEVICE_ID register is the only support way of identifying a device.
The value of this register will be written to AON_WUC:JTAGUSERCODE by boot FW while in safezone.</description>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PG_REV</name>
              <description>Field used to distinguish revisions of the device.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VER</name>
              <description>Version number.

0x0: Bits [25:12] of this register has the stated meaning.

Any other setting indicate a different encoding of these bits.</description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED23</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>23</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SEQUENCE</name>
              <description>Sequence.

Used to differentiate between marketing/orderable product where other fields of USER_ID is the same (temp range, flash size, voltage range etc)</description>
              <lsb>19</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PKG</name>
              <description>Package type.

0x0: 4x4mm QFN (RHB) package
0x1: 5x5mm QFN (RSM) package
0x2: 7x7mm QFN (RGZ) package
0x3: Wafer sale package (naked die)
0x4: 2.7x2.7mm WCSP (YFV)
0x5: 7x7mm QFN package with Wettable Flanks

Other values are reserved for future use.
Packages available for a specific device are shown in the device datasheet.</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PROTOCOL</name>
              <description>Protocols supported.

0x1: BLE 
0x2: RF4CE 
0x4: Zigbee/6lowpan
0x8: Proprietary

More than one protocol can be supported on same device - values above are then combined.</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_OTP_DATA3</name>
          <displayName>FLASH_OTP_DATA3</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EC_STEP_SIZE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>23</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DO_PRECOND</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MAX_EC_LEVEL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>18</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIM_1P7</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_SIZE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WAIT_SYSCODE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANA2_TRIM</name>
          <displayName>ANA2_TRIM</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RCOSCHFCTRIMFRACT_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RCOSCHFCTRIMFRACT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>26</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SET_RCOSC_HF_FINE_RESISTOR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>23</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ATESTLF_UDIGLDO_IBIAS_TRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>NANOAMP_RES_TRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DITHER_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DCDC_IPEAK</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DEAD_TIME_TRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DCDC_LOW_EN_SEL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>3</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DCDC_HIGH_EN_SEL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDO_TRIM</name>
          <displayName>LDO_TRIM</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2b8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VDDR_TRIM_SLEEP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>19</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GLDO_CURSRC</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ITRIM_DIGLDO_LOAD</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>11</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ITRIM_UDIGLDO</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>3</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VTRIM_DELTA</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BAT_RC_LDO_TRIM</name>
          <displayName>BAT_RC_LDO_TRIM</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2bc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VTRIM_BOD</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VTRIM_UDIG</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RCOSCHF_ITUNE_TRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>2</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MEASUREPER</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_BLE_0</name>
          <displayName>MAC_BLE_0</displayName>
          <description>MAC BLE Address 0</description>
          <addressOffset>0x2e8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR_0_31</name>
              <description>The first 32-bits of the 64-bit MAC BLE address</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_BLE_1</name>
          <displayName>MAC_BLE_1</displayName>
          <description>MAC BLE Address 1</description>
          <addressOffset>0x2ec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR_32_63</name>
              <description>The last 32-bits of the 64-bit MAC BLE address</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_15_4_0</name>
          <displayName>MAC_15_4_0</displayName>
          <description>MAC IEEE 802.15.4 Address 0</description>
          <addressOffset>0x2f0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR_0_31</name>
              <description>The first 32-bits of the 64-bit MAC 15.4 address</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
