wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>SOC_ADC_REL_GAIN</name>
          <displayName>SOC_ADC_REL_GAIN</displayName>
          <description>AUX_ADC Gain in Relative Reference Mode</description>
          <addressOffset>0x360</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SOC_ADC_REL_GAIN_TEMP1</name>
              <description>SOC_ADC gain in relative reference mode at temperature 1 (30C). Calculated in production test..</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SOC_ADC_OFFSET_INT</name>
          <displayName>SOC_ADC_OFFSET_INT</displayName>
          <description>AUX_ADC Temperature Offsets in Absolute Reference Mode</description>
          <addressOffset>0x368</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SOC_ADC_REL_OFFSET_TEMP1</name>
              <description>SOC_ADC offset in relative reference mode at temperature 1 (30C). Signed 8-bit number. Calculated in production test..</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED8</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SOC_ADC_ABS_OFFSET_TEMP1</name>
              <description>SOC_ADC offset in absolute reference mode at temperature 1 (30C). Signed 8-bit number. Calculated in production test..</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SOC_ADC_REF_TRIM_AND_OFFSET_EXT</name>
          <displayName>SOC_ADC_REF_TRIM_AND_OFFSET_EXT</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x36c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>6</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SOC_ADC_REF_VOLTAGE_TRIM_TEMP1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AMPCOMP_TH1</name>
          <displayName>AMPCOMP_TH1</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x370</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HPMRAMP3_LTH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>18</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HPMRAMP3_HTH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>10</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>IBIASCAP_LPTOHP_OL_CNT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HPMRAMP1_TH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AMPCOMP_TH2</name>
          <displayName>AMPCOMP_TH2</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x374</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LPMUPDATE_LTH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>26</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>LPMUPDATE_HTM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>18</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_COMP_AMPTH_LPM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>10</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_COMP_AMPTH_HPM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>2</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AMPCOMP_CTRL1</name>
          <displayName>AMPCOMP_CTRL1</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x378</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>AMPCOMP_REQ_MODE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>29</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>IBIAS_OFFSET</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>IBIAS_INIT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>LPM_IBIAS_WAIT_CNT_FINAL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CAP_STEP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>IBIASCAP_HPTOLP_OL_CNT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANABYPASS_VALUE2</name>
          <displayName>ANABYPASS_VALUE2</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x37c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>14</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>XOSC_HF_IBIASTHERM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_MISC_ADC</name>
          <displayName>CONFIG_MISC_ADC</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>18</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RSSITRIMCOMPLETE_N</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RSSI_OFFSET</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>9</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>QUANTCTLTHRES</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DACTRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VOLT_TRIM</name>
          <displayName>VOLT_TRIM</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x388</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VDDR_TRIM_HH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VDDR_TRIM_H</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VDDR_TRIM_SLEEP_H</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIMBOD_H</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC_CONF</name>
          <displayName>OSC_CONF</displayName>
          <description>OSC Configuration</description>
          <addressOffset>0x38c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_SH_VBUF_EN</name>
              <description>Trim value for DDI_0_OSC:ADCDOUBLERNANOAMPCTL.ADC_SH_VBUF_EN.</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_SH_MODE_EN</name>
              <description>Trim value for DDI_0_OSC:ADCDOUBLERNANOAMPCTL.ADC_SH_MODE_EN.</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ATESTLF_RCOSCLF_IBIAS_TRIM</name>
              <description>Trim value for DDI_0_OSC:ATESTCTL.ATESTLF_RCOSCLF_IBIAS_TRIM.</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>XOSCLF_REGULATOR_TRIM</name>
              <description>Trim value for DDI_0_OSC:LFOSCCTL.XOSCLF_REGULATOR_TRIM.</description>
              <lsb>25</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>XOSCLF_CMIRRWR_RATIO</name>
              <description>Trim value for DDI_0_OSC:LFOSCCTL.XOSCLF_CMIRRWR_RATIO.</description>
              <lsb>21</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>XOSC_HF_FAST_START</name>
              <description>Trim value for DDI_0_OSC:CTL1.XOSC_HF_FAST_START.</description>
              <lsb>19</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>XOSC_OPTION</name>
              <description>0: XOSC_HF unavailable (may not be bonded out)
1: XOSC_HF available (default)</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HPOSC_OPTION</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HPOSC_BIAS_HOLD_MODE_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HPOSC_CURRMIRR_RATIO</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HPOSC_BIAS_RES_SET</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HPOSC_FILTER_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HPOSC_BIAS_RECHARGE_DELAY</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>3</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HPOSC_SERIES_CAP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HPOSC_DIV3_BYPASS</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQ_OFFSET</name>
          <displayName>FREQ_OFFSET</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x390</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HPOSC_COMP_P0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HPOSC_COMP_P1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HPOSC_COMP_P2</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_TRIM</name>
          <displayName>CAP_TRIM</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x394</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLUX_CAP_0P28_TRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FLUX_CAP_0P4_TRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
