wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>MISC_OTP_DATA_1</name>
          <displayName>MISC_OTP_DATA_1</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x398</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PEAK_DET_ITRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>27</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_BUF_ITRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_BUF_ITRIM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DBLR_LOOP_FILTER_RESET_VOLTAGE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HPM_IBIAS_WAIT_CNT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>10</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>LPM_IBIAS_WAIT_CNT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>IDAC_STEP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWD_CURR_20C</name>
          <displayName>PWD_CURR_20C</displayName>
          <description>Power Down Current Control 20C</description>
          <addressOffset>0x39c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>Additional maximum current, in units of 1uA, with cache retention</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>Additional maximum current, in 1uA units, with RF memory retention</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BASELINE</name>
              <description>Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWD_CURR_35C</name>
          <displayName>PWD_CURR_35C</displayName>
          <description>Power Down Current Control 35C</description>
          <addressOffset>0x3a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>Additional maximum current, in units of 1uA, with cache retention</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>Additional maximum current, in 1uA units, with RF memory retention</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BASELINE</name>
              <description>Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWD_CURR_50C</name>
          <displayName>PWD_CURR_50C</displayName>
          <description>Power Down Current Control 50C</description>
          <addressOffset>0x3a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>Additional maximum current, in units of 1uA, with cache retention</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>Additional maximum current, in 1uA units, with RF memory retention</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BASELINE</name>
              <description>Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWD_CURR_65C</name>
          <displayName>PWD_CURR_65C</displayName>
          <description>Power Down Current Control 65C</description>
          <addressOffset>0x3a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>Additional maximum current, in units of 1uA, with cache retention</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>Additional maximum current, in 1uA units, with RF memory retention</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BASELINE</name>
              <description>Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWD_CURR_80C</name>
          <displayName>PWD_CURR_80C</displayName>
          <description>Power Down Current Control 80C</description>
          <addressOffset>0x3ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>Additional maximum current, in units of 1uA, with cache retention</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>Additional maximum current, in 1uA units, with RF memory retention</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BASELINE</name>
              <description>Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWD_CURR_95C</name>
          <displayName>PWD_CURR_95C</displayName>
          <description>Power Down Current Control 95C</description>
          <addressOffset>0x3b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>Additional maximum current, in units of 1uA, with cache retention</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>Additional maximum current, in 1uA units, with RF memory retention</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BASELINE</name>
              <description>Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWD_CURR_110C</name>
          <displayName>PWD_CURR_110C</displayName>
          <description>Power Down Current Control 110C</description>
          <addressOffset>0x3b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>Additional maximum current, in units of 1uA, with cache retention</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>Additional maximum current, in 1uA units, with RF memory retention</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BASELINE</name>
              <description>Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWD_CURR_125C</name>
          <displayName>PWD_CURR_125C</displayName>
          <description>Power Down Current Control 125C</description>
          <addressOffset>0x3b8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>Additional maximum current, in units of 1uA, with cache retention</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>Additional maximum current, in 1uA units, with RF memory retention</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BASELINE</name>
              <description>Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
