wezm/dslite2svd/svd/cc2650f128-vendor.xml
      </registers>
    </peripheral>
    <!-- ../Modules/CC26xx/CC2650/FLASH.xml -->
    <peripheral>
      <name>FLASH</name>
      <description>Flash sub-system registers, includes the Flash Memory Controller (FMC), flash read path, and an integrated Efuse controller and EFUSEROM.

</description>
      <baseAddress>0x40030000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>STAT</name>
          <displayName>STAT</displayName>
          <description>FMC and Efuse Status</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EFUSE_BLANK</name>
              <description>Efuse scanning detected if fuse ROM is blank:
0 : Not blank
1 : Blank</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EFUSE_TIMEOUT</name>
              <description>Efuse scanning resulted in timeout error.
0 : No Timeout error
1 : Timeout Error</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EFUSE_CRC_ERROR</name>
              <description>Efuse scanning resulted in scan chain CRC error.
0 : No CRC error
1 : CRC Error</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EFUSE_ERRCODE</name>
              <description>Same as EFUSEERROR.CODE</description>
              <lsb>8</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>3</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SAMHOLD_DIS</name>
              <description>Status indicator of flash sample and hold sequencing logic. This bit will go to 1 some delay after CFG.DIS_IDLE is set to 1.
0: Not disabled
1: Sample and hold disabled and stable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Fast version of the FMC FMSTAT.BUSY bit.
This flag is valid immediately after the operation setting it (FMSTAT.BUSY is delayed some cycles)
0 : Not busy
1 : Busy</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>POWER_MODE</name>
              <description>Power state of the flash sub-system.
0 : Active
1 : Low power</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <displayName>CFG</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>9</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STANDBY_MODE_SEL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STANDBY_PW_SEL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_EFUSECLK</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_READACCESS</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_SWINTF</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_STANDBY</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_IDLE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCODE_START</name>
          <displayName>SYSCODE_START</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED5</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>5</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSCODE_START</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SIZE</name>
          <displayName>FLASH_SIZE</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SECTORS</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FWLOCK</name>
          <displayName>FWLOCK</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>3</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FWLOCK</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FWFLAG</name>
          <displayName>FWFLAG</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>3</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FWFLAG</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EFUSE</name>
          <displayName>EFUSE</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x1000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED29</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>INSTRUCTION</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED16</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DUMPWORD</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EFUSEADDR</name>
          <displayName>EFUSEADDR</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x1004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BLOCK</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>11</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ROW</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAUPPER</name>
          <displayName>DATAUPPER</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x1008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SPARE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>3</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>P</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>R</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EEN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATALOWER</name>
          <displayName>DATALOWER</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x100c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EFUSECFG</name>
          <displayName>EFUSECFG</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x1010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>9</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLEGATING</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED5</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SLAVEPOWER</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>3</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GATING</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EFUSESTAT</name>
          <displayName>EFUSESTAT</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x1014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESETDONE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC</name>
          <displayName>ACC</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x1018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ACCUMULATOR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOUNDARY</name>
          <displayName>BOUNDARY</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x101c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DISROW0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SPARE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EFC_SELF_TEST_ERROR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EFC_INSTRUCTION_INFO</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EFC_INSTRUCTION_ERROR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EFC_AUTOLOAD_ERROR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUTENABLE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>14</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYS_ECC_SELF_TEST_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYS_ECC_OVERRIDE_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EFC_FDI</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYS_DIEID_AUTOLOAD_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYS_REPAIR_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYS_WS_READ_STATES</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUTENABLE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EFUSEFLAG</name>
          <displayName>EFUSEFLAG</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x1020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
