wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>EFUSEKEY</name>
          <displayName>EFUSEKEY</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x1024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CODE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EFUSERELEASE</name>
          <displayName>EFUSERELEASE</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x1028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ODPYEAR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>25</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ODPMONTH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>21</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ODPDAY</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EFUSEYEAR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>9</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EFUSEMONTH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>5</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EFUSEDAY</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EFUSEPINS</name>
          <displayName>EFUSEPINS</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x102c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EFC_SELF_TEST_DONE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EFC_SELF_TEST_ERROR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYS_ECC_SELF_TEST_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EFC_INSTRUCTION_INFO</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EFC_INSTRUCTION_ERROR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EFC_AUTOLOAD_ERROR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYS_ECC_OVERRIDE_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EFC_READY</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EFC_FCLRZ</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYS_DIEID_AUTOLOAD_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYS_REPAIR_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYS_WS_READ_STATES</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EFUSECRA</name>
          <displayName>EFUSECRA</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x1030</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EFUSEREAD</name>
          <displayName>EFUSEREAD</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x1034</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED10</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>10</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DATABIT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>READCLOCK</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DEBUG</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SPARE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MARGIN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EFUSEPROGRAM</name>
          <displayName>EFUSEPROGRAM</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x1038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED31</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>COMPAREDISABLE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLOCKSTALL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>14</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VPPTOVDD</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ITERATIONS</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>9</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITECLOCK</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EFUSEERROR</name>
          <displayName>EFUSEERROR</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x103c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DONE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CODE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLEBIT</name>
          <displayName>SINGLEBIT</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x1040</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FROMN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FROM0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TWOBIT</name>
          <displayName>TWOBIT</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x1044</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FROMN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FROM0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SELFTESTCYC</name>
          <displayName>SELFTESTCYC</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x1048</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CYCLES</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SELFTESTSIGN</name>
          <displayName>SELFTESTSIGN</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x104c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SIGNATURE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FRDCTL</name>
          <displayName>FRDCTL</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED12</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RWAIT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSPRD</name>
          <displayName>FSPRD</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DIS_PREEMPT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RMBSEM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>2</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RM1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RM0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FEDACCTL1</name>
          <displayName>FEDACCTL1</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>25</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SUSP_IGNR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EDACEN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FEDACCTL2</name>
          <displayName>FEDACCTL2</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x200c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEC_THRESHOLD</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCOR_ERR_CNT</name>
          <displayName>FCOR_ERR_CNT</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COR_ERR_CNT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCOR_ERR_ADD</name>
          <displayName>FCOR_ERR_ADD</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2014</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>FCOR_ERR_POS</name>
          <displayName>FCOR_ERR_POS</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SERR_POS</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FEDACSTAT</name>
          <displayName>FEDACSTAT</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x201c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED26</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>26</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RVF_INT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FSM_DONE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR_PRF_FLG</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC_ERR_ADD</name>
          <displayName>FUNC_ERR_ADD</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2020</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>FEDACSDIS</name>
          <displayName>FEDACSDIS</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SECTORID0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FPRIM_ADD_TAG</name>
          <displayName>FPRIM_ADD_TAG</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PRIM_ADD_TAG</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
