wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>FREDU_ADD_TAG</name>
          <displayName>FREDU_ADD_TAG</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x202c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REDU_ADD_TAG</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FBPROT</name>
          <displayName>FBPROT</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2030</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PROTL1DIS</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FBSE</name>
          <displayName>FBSE</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2034</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BSE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FBBUSY</name>
          <displayName>FBBUSY</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FBAC</name>
          <displayName>FBAC</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x203c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED17</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>17</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>OTPPROTDIS</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BAGP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VREADS</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FBFALLBACK</name>
          <displayName>FBFALLBACK</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2040</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED28</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FSM_PWRSAV</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED20</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_PWRSAV</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BANKPWR7</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BANKPWR6</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BANKPWR5</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BANKPWR4</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BANKPWR3</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BANKPWR2</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BANKPWR1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BANKPWR0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FBPRDY</name>
          <displayName>FBPRDY</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2044</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED17</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>17</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BANKBUSY</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PUMPRDY</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>1</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BANKRDY</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FPAC1</name>
          <displayName>FPAC1</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2048</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED28</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PSLEEPTDIS</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PUMPRESET_PW</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PUMPPWR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FPAC2</name>
          <displayName>FPAC2</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x204c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PAGP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMAC</name>
          <displayName>FMAC</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2050</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>3</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BANK</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMSTAT</name>
          <displayName>FMSTAT</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2054</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED18</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>18</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RVSUSP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RDVER</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RVF</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ILA</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DBF</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PGV</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PCV</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EV</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CV</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ERS</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PGM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>INVDAT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CSTAT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VOLSTAT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ESUSP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PSUSP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SLOCK</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FEMU_DMSW</name>
          <displayName>FEMU_DMSW</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2058</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FEMU_DLSW</name>
          <displayName>FEMU_DLSW</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x205c</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FEMU_ECC</name>
          <displayName>FEMU_ECC</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2060</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMU_ECC</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLOCK</name>
          <displayName>FLOCK</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2064</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ENCOM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FEMU_ADDR</name>
          <displayName>FEMU_ADDR</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2068</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EMU_ADDR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FDIAGCTL</name>
          <displayName>FDIAGCTL</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x206c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DIAGMODE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAW_DATAH</name>
          <displayName>FRAW_DATAH</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2070</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FRAW_DATAL</name>
          <displayName>FRAW_DATAL</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2074</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FRAW_ECC</name>
          <displayName>FRAW_ECC</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2078</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RAW_ECC</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FPAR_OVR</name>
          <displayName>FPAR_OVR</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x207c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DAT_INV_PAR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
