wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>FVREADCT</name>
          <displayName>FVREADCT</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2080</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VREADCT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FVHVCT1</name>
          <displayName>FVHVCT1</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2084</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIM13_E</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VHVCT_E</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED8</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIM13_PV</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VHVCT_PV</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FVHVCT2</name>
          <displayName>FVHVCT2</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2088</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIM13_P</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VHVCT_P</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FVHVCT3</name>
          <displayName>FVHVCT3</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x208c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED20</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>20</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WCT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VHVCT_READ</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FVNVCT</name>
          <displayName>FVNVCT</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2090</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED13</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>13</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VCG2P5CT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED5</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VIN_CT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FVSLP</name>
          <displayName>FVSLP</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2094</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VSL_P</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FVWLCT</name>
          <displayName>FVWLCT</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2098</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED5</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>5</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VWLCT_P</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FEFUSECTL</name>
          <displayName>FEFUSECTL</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x209c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED27</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>27</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CHAIN_SEL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED18</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>18</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BP_SEL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>9</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EF_CLRZ</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED5</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EF_TEST</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EFUSE_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FEFUSESTAT</name>
          <displayName>FEFUSESTAT</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x20a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SHIFT_DONE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FEFUSEDATA</name>
          <displayName>FEFUSEDATA</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x20a4</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FSEQPMP</name>
          <displayName>FSEQPMP</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x20a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED28</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_3P4</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED22</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIM_1P7</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_0P8</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED15</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VIN_AT_X</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>9</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VIN_BY_PASS</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PUMP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCLKTRIM</name>
          <displayName>FCLKTRIM</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x20ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TRIM_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROM_TEST</name>
          <displayName>ROM_TEST</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x20b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ROM_KEY</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FEDACSDIS2</name>
          <displayName>FEDACSDIS2</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x20c0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SECTORID2</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FBSTROBES</name>
          <displayName>FBSTROBES</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>25</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ECBIT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED19</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>19</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RWAIT2_FLCLK</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RWAIT_FLCLK</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLCLKEN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>9</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CTRLENZ</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED7</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>NOCOLRED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRECOL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TI_OTP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>OTP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TEZ</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FPSTROBES</name>
          <displayName>FPSTROBES</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>9</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EXECUTEZ</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>2</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>V3PWRDNZ</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>V5PWRDNZ</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
