wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>FBMODE</name>
          <displayName>FBMODE</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2108</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>3</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FTCR</name>
          <displayName>FTCR</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x210c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED7</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>7</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TCR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FADDR</name>
          <displayName>FADDR</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2110</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FPMTCTL</name>
          <displayName>FPMTCTL</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2114</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR_INCR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PBISTCTL</name>
          <displayName>PBISTCTL</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2118</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PBIST_KEY</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FTCTL</name>
          <displayName>FTCTL</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x211c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED17</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>17</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WDATA_BLK_CLR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>2</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TEST_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FWPWRITE0</name>
          <displayName>FWPWRITE0</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2120</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FWPWRITE1</name>
          <displayName>FWPWRITE1</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2124</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FWPWRITE2</name>
          <displayName>FWPWRITE2</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2128</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FWPWRITE3</name>
          <displayName>FWPWRITE3</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x212c</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FWPWRITE4</name>
          <displayName>FWPWRITE4</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2130</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FWPWRITE5</name>
          <displayName>FWPWRITE5</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2134</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FWPWRITE6</name>
          <displayName>FWPWRITE6</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2138</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FWPWRITE7</name>
          <displayName>FWPWRITE7</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x213c</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FWPWRITE_ECC</name>
          <displayName>FWPWRITE_ECC</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2140</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ECCBYTES07_00</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ECCBYTES15_08</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ECCBYTES23_16</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ECCBYTES31_24</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSWSTAT</name>
          <displayName>FSWSTAT</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2144</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SAFELV</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_GLBCTL</name>
          <displayName>FSM_GLBCTL</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2200</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CLKSEL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_STATE</name>
          <displayName>FSM_STATE</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2204</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED12</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CTRLENZ</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EXECUTEZ</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FSM_ACT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIOTP_ACT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>OTP_ACT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_STAT</name>
          <displayName>FSM_STAT</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2208</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>3</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>NON_OP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>OVR_PUL_CNT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>INV_DAT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_CMD</name>
          <displayName>FSM_CMD</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x220c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FSMCMD</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_PE_OSU</name>
          <displayName>FSM_PE_OSU</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2210</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PGM_OSU</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ERA_OSU</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_VSTAT</name>
          <displayName>FSM_VSTAT</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2214</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VSTAT_CNT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_PE_VSU</name>
          <displayName>FSM_PE_VSU</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2218</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PGM_VSU</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ERA_VSU</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_CMP_VSU</name>
          <displayName>FSM_CMP_VSU</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x221c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADD_EXZ</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_EX_VAL</name>
          <displayName>FSM_EX_VAL</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2220</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>REP_VSU</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EXE_VALD</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_RD_H</name>
          <displayName>FSM_RD_H</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2224</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_H</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_P_OH</name>
          <displayName>FSM_P_OH</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2228</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PGM_OH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_ERA_OH</name>
          <displayName>FSM_ERA_OH</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x222c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ERA_OH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
