wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>FSM_SAV_PPUL</name>
          <displayName>FSM_SAV_PPUL</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2230</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED12</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SAV_P_PUL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_PE_VH</name>
          <displayName>FSM_PE_VH</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2234</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PGM_VH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ERA_VH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_PRG_PW</name>
          <displayName>FSM_PRG_PW</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2240</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PROG_PUL_WIDTH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_ERA_PW</name>
          <displayName>FSM_ERA_PW</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2244</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FSM_SAV_ERA_PUL</name>
          <displayName>FSM_SAV_ERA_PUL</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2254</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED12</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SAV_ERA_PUL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_TIMER</name>
          <displayName>FSM_TIMER</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2258</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>FSM_MODE</name>
          <displayName>FSM_MODE</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x225c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED20</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>20</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RDV_SUBMODE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PGM_SUBMODE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ERA_SUBMODE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SUBMODE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SAV_PGM_CMD</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>9</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SAV_ERA_MODE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>3</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CMD</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_PGM</name>
          <displayName>FSM_PGM</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2260</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED26</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>26</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PGM_BANK</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>23</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PGM_ADDR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_ERA</name>
          <displayName>FSM_ERA</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2264</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED26</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>26</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ERA_BANK</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>23</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ERA_ADDR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_PRG_PUL</name>
          <displayName>FSM_PRG_PUL</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2268</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED20</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>20</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BEG_EC_LEVEL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MAX_PRG_PUL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_ERA_PUL</name>
          <displayName>FSM_ERA_PUL</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x226c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED20</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>20</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MAX_EC_LEVEL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MAX_ERA_PUL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_STEP_SIZE</name>
          <displayName>FSM_STEP_SIZE</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2270</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>25</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EC_STEP_SIZE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_PUL_CNTR</name>
          <displayName>FSM_PUL_CNTR</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2274</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>25</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CUR_EC_LEVEL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PUL_CNTR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_EC_STEP_HEIGHT</name>
          <displayName>FSM_EC_STEP_HEIGHT</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2278</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EC_STEP_HEIGHT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_ST_MACHINE</name>
          <displayName>FSM_ST_MACHINE</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x227c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DO_PRECOND</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FSM_INT_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ALL_BANKS</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPV_ALLOWED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RANDOM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RV_SEC_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RV_RES</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RV_INT_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED15</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ONE_TIME_GOOD</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DO_REDU_COL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_SHORT_ROW</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>7</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PGM_SEC_COF_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PREC_STOP_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_TST_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_EN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INV_DATA</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>OVERRIDE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_FLES</name>
          <displayName>FSM_FLES</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2280</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED12</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BLK_TIOTP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BLK_OTP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_WR_ENA</name>
          <displayName>FSM_WR_ENA</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2288</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>3</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WR_ENA</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_ACC_PP</name>
          <displayName>FSM_ACC_PP</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x228c</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
