wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>FSM_ACC_EP</name>
          <displayName>FSM_ACC_EP</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2290</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ACC_EP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_ADDR</name>
          <displayName>FSM_ADDR</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x22a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED31</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BANK</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CUR_ADDR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_SECTOR</name>
          <displayName>FSM_SECTOR</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x22a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SECT_ERASED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FSM_SECTOR_EXTENSION</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SECTOR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SEC_OUT</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_REV_ID</name>
          <displayName>FMC_REV_ID</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x22a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MOD_VERSION</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CONFIG_CRC</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_ERR_ADDR</name>
          <displayName>FSM_ERR_ADDR</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x22ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FSM_ERR_ADDR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FSM_ERR_BANK</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_PGM_MAXPUL</name>
          <displayName>FSM_PGM_MAXPUL</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x22b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED12</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FSM_PGM_MAXPUL</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_EXECUTE</name>
          <displayName>FSM_EXECUTE</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x22b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED20</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>20</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SUSPEND_NOW</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED5</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>5</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FSMEXECUTE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEPROM_CFG</name>
          <displayName>EEPROM_CFG</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x22b8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AUTOSTART_GRACE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_SECTOR1</name>
          <displayName>FSM_SECTOR1</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x22c0</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FSM_SECTOR2</name>
          <displayName>FSM_SECTOR2</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x22c4</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FSM_BSLE0</name>
          <displayName>FSM_BSLE0</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x22e0</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FSM_BSLE1</name>
          <displayName>FSM_BSLE1</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x22e4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FSM_BSL1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_BSLP0</name>
          <displayName>FSM_BSLP0</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x22f0</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FSM_BSLP1</name>
          <displayName>FSM_BSLP1</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x22f4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FSM_BSL1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_BANK</name>
          <displayName>FCFG_BANK</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2400</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EE_BANK_WIDTH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>20</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EE_NUM_BANK</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MAIN_BANK_WIDTH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MAIN_NUM_BANK</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_WRAPPER</name>
          <displayName>FCFG_WRAPPER</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2404</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FAMILY_TYPE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED21</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_MAP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU2</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EE_IN_MAIN</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ROM</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>IFLUSH</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SIL3</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCA</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>AUTO_SUSP</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UERR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_TYPE1</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_BNK_TYPE</name>
          <displayName>FCFG_BNK_TYPE</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2408</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>B7_TYPE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B6_TYPE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B5_TYPE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B4_TYPE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B3_TYPE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B2_TYPE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B1_TYPE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B0_TYPE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B0_START</name>
          <displayName>FCFG_B0_START</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2410</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>B0_MAX_SECTOR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B0_MUX_FACTOR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B0_START_ADDR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B1_START</name>
          <displayName>FCFG_B1_START</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2414</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>B1_MAX_SECTOR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B1_MUX_FACTOR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B1_START_ADDR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B2_START</name>
          <displayName>FCFG_B2_START</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2418</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>B2_MAX_SECTOR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B2_MUX_FACTOR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B2_START_ADDR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B3_START</name>
          <displayName>FCFG_B3_START</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x241c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>B3_MAX_SECTOR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B3_MUX_FACTOR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B3_START_ADDR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B4_START</name>
          <displayName>FCFG_B4_START</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2420</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>B4_MAX_SECTOR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B4_MUX_FACTOR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B4_START_ADDR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
