wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>FCFG_B5_START</name>
          <displayName>FCFG_B5_START</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2424</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>B5_MAX_SECTOR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B5_MUX_FACTOR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B5_START_ADDR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B6_START</name>
          <displayName>FCFG_B6_START</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2428</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>B6_MAX_SECTOR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B6_MUX_FACTOR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B6_START_ADDR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B7_START</name>
          <displayName>FCFG_B7_START</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x242c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>B7_MAX_SECTOR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B7_MUX_FACTOR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B7_START_ADDR</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B0_SSIZE0</name>
          <displayName>FCFG_B0_SSIZE0</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2430</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED28</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B0_NUM_SECTORS</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>4</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>B0_SECT_SIZE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B0_SSIZE1</name>
          <displayName>FCFG_B0_SSIZE1</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2434</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B0_SSIZE2</name>
          <displayName>FCFG_B0_SSIZE2</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2438</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B0_SSIZE3</name>
          <displayName>FCFG_B0_SSIZE3</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x243c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B1_SSIZE0</name>
          <displayName>FCFG_B1_SSIZE0</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2440</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>B1_SECT_SIZE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B1_SSIZE1</name>
          <displayName>FCFG_B1_SSIZE1</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2444</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B1_SSIZE2</name>
          <displayName>FCFG_B1_SSIZE2</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2448</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B1_SSIZE3</name>
          <displayName>FCFG_B1_SSIZE3</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x244c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B2_SSIZE0</name>
          <displayName>FCFG_B2_SSIZE0</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2450</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>B2_SECT_SIZE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B2_SSIZE1</name>
          <displayName>FCFG_B2_SSIZE1</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2454</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B2_SSIZE2</name>
          <displayName>FCFG_B2_SSIZE2</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2458</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B2_SSIZE3</name>
          <displayName>FCFG_B2_SSIZE3</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x245c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B3_SSIZE0</name>
          <displayName>FCFG_B3_SSIZE0</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2460</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>B3_SECT_SIZE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B3_SSIZE1</name>
          <displayName>FCFG_B3_SSIZE1</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2464</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B3_SSIZE2</name>
          <displayName>FCFG_B3_SSIZE2</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2468</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B3_SSIZE3</name>
          <displayName>FCFG_B3_SSIZE3</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x246c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B4_SSIZE0</name>
          <displayName>FCFG_B4_SSIZE0</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2470</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>B4_SECT_SIZE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B4_SSIZE1</name>
          <displayName>FCFG_B4_SSIZE1</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2474</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B4_SSIZE2</name>
          <displayName>FCFG_B4_SSIZE2</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2478</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B4_SSIZE3</name>
          <displayName>FCFG_B4_SSIZE3</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x247c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B5_SSIZE0</name>
          <displayName>FCFG_B5_SSIZE0</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2480</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>B5_SECT_SIZE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B5_SSIZE1</name>
          <displayName>FCFG_B5_SSIZE1</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2484</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B5_SSIZE2</name>
          <displayName>FCFG_B5_SSIZE2</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2488</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B5_SSIZE3</name>
          <displayName>FCFG_B5_SSIZE3</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x248c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B6_SSIZE0</name>
          <displayName>FCFG_B6_SSIZE0</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2490</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>B6_SECT_SIZE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B6_SSIZE1</name>
          <displayName>FCFG_B6_SSIZE1</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2494</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B6_SSIZE2</name>
          <displayName>FCFG_B6_SSIZE2</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x2498</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B6_SSIZE3</name>
          <displayName>FCFG_B6_SSIZE3</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x249c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B7_SSIZE0</name>
          <displayName>FCFG_B7_SSIZE0</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x24a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>B7_SECT_SIZE</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B7_SSIZE1</name>
          <displayName>FCFG_B7_SSIZE1</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x24a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B7_SSIZE2</name>
          <displayName>FCFG_B7_SSIZE2</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x24a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG_B7_SSIZE3</name>
          <displayName>FCFG_B7_SSIZE3</displayName>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0x24ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Internal. Only to be used through TI provided API.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
