wezm/dslite2svd/svd/cc2650f128-vendor.xml
      </registers>
    </peripheral>
    <!-- ../Modules/CC26xx/CC2650/GPIO.xml -->
    <peripheral>
      <name>GPIO</name>
      <description>MCU GPIO - I/F for controlling and reading IO status and IO event status

</description>
      <baseAddress>0x40022000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>DOUT3_0</name>
          <displayName>DOUT3_0</displayName>
          <description>Data Out 0 to 3

Alias register for byte access to each bit in DOUT31_0</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>25</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO3</name>
              <description>Sets the state of the pin that is configured as DIO#3, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED17</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>17</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO2</name>
              <description>Sets the state of the pin that is configured as DIO#2, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>9</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO1</name>
              <description>Sets the state of the pin that is configured as DIO#1, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO0</name>
              <description>Sets the state of the pin that is configured as DIO#0, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOUT7_4</name>
          <displayName>DOUT7_4</displayName>
          <description>Data Out 4 to 7

Alias register for byte access to each bit in DOUT31_0</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>25</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO7</name>
              <description>Sets the state of the pin that is configured as DIO#7, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED17</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>17</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO6</name>
              <description>Sets the state of the pin that is configured as DIO#6, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>9</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO5</name>
              <description>Sets the state of the pin that is configured as DIO#5, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO4</name>
              <description>Sets the state of the pin that is configured as DIO#4, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOUT11_8</name>
          <displayName>DOUT11_8</displayName>
          <description>Data Out 8 to 11

Alias register for byte access to each bit in DOUT31_0</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>25</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO11</name>
              <description>Sets the state of the pin that is configured as DIO#11, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED17</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>17</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO10</name>
              <description>Sets the state of the pin that is configured as DIO#10, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>9</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO9</name>
              <description>Sets the state of the pin that is configured as DIO#9, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO8</name>
              <description>Sets the state of the pin that is configured as DIO#8, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOUT15_12</name>
          <displayName>DOUT15_12</displayName>
          <description>Data Out 12 to 15

Alias register for byte access to each bit in DOUT31_0</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>25</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO15</name>
              <description>Sets the state of the pin that is configured as DIO#15, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED17</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>17</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO14</name>
              <description>Sets the state of the pin that is configured as DIO#14, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>9</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO13</name>
              <description>Sets the state of the pin that is configured as DIO#13, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO12</name>
              <description>Sets the state of the pin that is configured as DIO#12, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOUT19_16</name>
          <displayName>DOUT19_16</displayName>
          <description>Data Out 16 to 19

Alias register for byte access to each bit in DOUT31_0</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>25</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO19</name>
              <description>Sets the state of the pin that is configured as DIO#19, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED17</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>17</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO18</name>
              <description>Sets the state of the pin that is configured as DIO#18, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>9</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO17</name>
              <description>Sets the state of the pin that is configured as DIO#17, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO16</name>
              <description>Sets the state of the pin that is configured as DIO#16, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOUT23_20</name>
          <displayName>DOUT23_20</displayName>
          <description>Data Out 20 to 23

Alias register for byte access to each bit in DOUT31_0</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>25</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO23</name>
              <description>Sets the state of the pin that is configured as DIO#23, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED17</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>17</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO22</name>
              <description>Sets the state of the pin that is configured as DIO#22, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>9</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO21</name>
              <description>Sets the state of the pin that is configured as DIO#21, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO20</name>
              <description>Sets the state of the pin that is configured as DIO#20, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOUT27_24</name>
          <displayName>DOUT27_24</displayName>
          <description>Data Out 24 to 27

Alias register for byte access to each bit in DOUT31_0</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>25</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO27</name>
              <description>Sets the state of the pin that is configured as DIO#27, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED17</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>17</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO26</name>
              <description>Sets the state of the pin that is configured as DIO#26, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>9</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO25</name>
              <description>Sets the state of the pin that is configured as DIO#25, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO24</name>
              <description>Sets the state of the pin that is configured as DIO#24, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOUT31_28</name>
          <displayName>DOUT31_28</displayName>
          <description>Data Out 28 to 31

Alias register for byte access to each bit in DOUT31_0</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>25</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO31</name>
              <description>Sets the state of the pin that is configured as DIO#31, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED17</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>17</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO30</name>
              <description>Sets the state of the pin that is configured as DIO#30, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>9</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO29</name>
              <description>Sets the state of the pin that is configured as DIO#29, if the corresponding DOE31_0 bitfield is set.

