wezm/dslite2svd/svd/cc2650f128-vendor.xml
</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO28</name>
              <description>Sets the state of the pin that is configured as DIO#28, if the corresponding DOE31_0 bitfield is set.

</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOUT31_0</name>
          <displayName>DOUT31_0</displayName>
          <description>Data Output for DIO 0 to 31</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DIO31</name>
              <description>Data output for DIO 31</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO30</name>
              <description>Data output for DIO 30</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO29</name>
              <description>Data output for DIO 29</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO28</name>
              <description>Data output for DIO 28</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO27</name>
              <description>Data output for DIO 27</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO26</name>
              <description>Data output for DIO 26</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO25</name>
              <description>Data output for DIO 25</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO24</name>
              <description>Data output for DIO 24</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO23</name>
              <description>Data output for DIO 23</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO22</name>
              <description>Data output for DIO 22</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO21</name>
              <description>Data output for DIO 21</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO20</name>
              <description>Data output for DIO 20</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO19</name>
              <description>Data output for DIO 19</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO18</name>
              <description>Data output for DIO 18</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO17</name>
              <description>Data output for DIO 17</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO16</name>
              <description>Data output for DIO 16</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO15</name>
              <description>Data output for DIO 15</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO14</name>
              <description>Data output for DIO 14</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO13</name>
              <description>Data output for DIO 13</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO12</name>
              <description>Data output for DIO 12</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO11</name>
              <description>Data output for DIO 11</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO10</name>
              <description>Data output for DIO 10</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO9</name>
              <description>Data output for DIO 9</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO8</name>
              <description>Data output for DIO 8</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO7</name>
              <description>Data output for DIO 7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO6</name>
              <description>Data output for DIO 6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO5</name>
              <description>Data output for DIO 5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO4</name>
              <description>Data output for DIO 4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO3</name>
              <description>Data output for DIO 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO2</name>
              <description>Data output for DIO 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO1</name>
              <description>Data output for DIO 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO0</name>
              <description>Data output for DIO 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOUTSET31_0</name>
          <displayName>DOUTSET31_0</displayName>
          <description>Data Out Set

Writing 1 to a bit position sets the corresponding bit in the DOUT31_0 register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DIO31</name>
              <description>Set bit 31</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO30</name>
              <description>Set bit 30</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO29</name>
              <description>Set bit 29</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO28</name>
              <description>Set bit 28</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO27</name>
              <description>Set bit 27</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO26</name>
              <description>Set bit 26</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO25</name>
              <description>Set bit 25</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO24</name>
              <description>Set bit 24</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO23</name>
              <description>Set bit 23</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO22</name>
              <description>Set bit 22</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO21</name>
              <description>Set bit 21</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO20</name>
              <description>Set bit 20</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO19</name>
              <description>Set bit 19</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO18</name>
              <description>Set bit 18</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO17</name>
              <description>Set bit 17</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO16</name>
              <description>Set bit 16</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO15</name>
              <description>Set bit 15</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO14</name>
              <description>Set bit 14</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO13</name>
              <description>Set bit 13</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO12</name>
              <description>Set bit 12</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO11</name>
              <description>Set bit 11</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO10</name>
              <description>Set bit 10</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO9</name>
              <description>Set bit 9</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO8</name>
              <description>Set bit 8</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO7</name>
              <description>Set bit 7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO6</name>
              <description>Set bit 6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO5</name>
              <description>Set bit 5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO4</name>
              <description>Set bit 4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO3</name>
              <description>Set bit 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO2</name>
              <description>Set bit 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO1</name>
              <description>Set bit 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO0</name>
              <description>Set bit 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOUTCLR31_0</name>
          <displayName>DOUTCLR31_0</displayName>
          <description>Data Out Clear

