wezm/dslite2svd/svd/cc2650f128-vendor.xml
Writing 1 to a bit position clears the corresponding bit in the DOUT31_0 register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DIO31</name>
              <description>Clears bit 31</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO30</name>
              <description>Clears bit 30</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO29</name>
              <description>Clears bit 29</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO28</name>
              <description>Clears bit 28</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO27</name>
              <description>Clears bit 27</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO26</name>
              <description>Clears bit 26</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO25</name>
              <description>Clears bit 25</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO24</name>
              <description>Clears bit 24</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO23</name>
              <description>Clears bit 23</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO22</name>
              <description>Clears bit 22</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO21</name>
              <description>Clears bit 21</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO20</name>
              <description>Clears bit 20</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO19</name>
              <description>Clears bit 19</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO18</name>
              <description>Clears bit 18</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO17</name>
              <description>Clears bit 17</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO16</name>
              <description>Clears bit 16</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO15</name>
              <description>Clears bit 15</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO14</name>
              <description>Clears bit 14</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO13</name>
              <description>Clears bit 13</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO12</name>
              <description>Clears bit 12</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO11</name>
              <description>Clears bit 11</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO10</name>
              <description>Clears bit 10</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO9</name>
              <description>Clears bit 9</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO8</name>
              <description>Clears bit 8</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO7</name>
              <description>Clears bit 7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO6</name>
              <description>Clears bit 6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO5</name>
              <description>Clears bit 5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO4</name>
              <description>Clears bit 4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO3</name>
              <description>Clears bit 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO2</name>
              <description>Clears bit 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO1</name>
              <description>Clears bit 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DIO0</name>
              <description>Clears bit 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOUTTGL31_0</name>
          <displayName>DOUTTGL31_0</displayName>
          <description>Data Out Toggle

Writing 1 to a bit position will invert the corresponding DIO output.</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DIO31</name>
              <description>Toggles bit 31</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO30</name>
              <description>Toggles bit 30</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO29</name>
              <description>Toggles bit 29</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO28</name>
              <description>Toggles bit 28</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO27</name>
              <description>Toggles bit 27</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO26</name>
              <description>Toggles bit 26</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO25</name>
              <description>Toggles bit 25</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO24</name>
              <description>Toggles bit 24</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO23</name>
              <description>Toggles bit 23</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO22</name>
              <description>Toggles bit 22</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO21</name>
              <description>Toggles bit 21</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO20</name>
              <description>Toggles bit 20</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO19</name>
              <description>Toggles bit 19</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO18</name>
              <description>Toggles bit 18</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO17</name>
              <description>Toggles bit 17</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO16</name>
              <description>Toggles bit 16</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO15</name>
              <description>Toggles bit 15</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO14</name>
              <description>Toggles bit 14</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO13</name>
              <description>Toggles bit 13</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO12</name>
              <description>Toggles bit 12</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO11</name>
              <description>Toggles bit 11</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO10</name>
              <description>Toggles bit 10</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO9</name>
              <description>Toggles bit 9</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO8</name>
              <description>Toggles bit 8</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO7</name>
              <description>Toggles bit 7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO6</name>
              <description>Toggles bit 6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO5</name>
              <description>Toggles bit 5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO4</name>
              <description>Toggles bit 4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO3</name>
              <description>Toggles bit 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO2</name>
              <description>Toggles bit 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO1</name>
              <description>Toggles bit 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIO0</name>
              <description>Toggles bit 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIN31_0</name>
          <displayName>DIN31_0</displayName>
          <description>Data Input from DIO 0 to 31</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DIO31</name>
              <description>Data input from DIO 31</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO30</name>
              <description>Data input from DIO 30</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO29</name>
              <description>Data input from DIO 29</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO28</name>
              <description>Data input from DIO 28</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO27</name>
              <description>Data input from DIO 27</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO26</name>
              <description>Data input from DIO 26</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO25</name>
              <description>Data input from DIO 25</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO24</name>
              <description>Data input from DIO 24</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO23</name>
              <description>Data input from DIO 23</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO22</name>
              <description>Data input from DIO 22</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO21</name>
              <description>Data input from DIO 21</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO20</name>
              <description>Data input from DIO 20</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO19</name>
              <description>Data input from DIO 19</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO18</name>
              <description>Data input from DIO 18</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO17</name>
              <description>Data input from DIO 17</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO16</name>
              <description>Data input from DIO 16</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO15</name>
              <description>Data input from DIO 15</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO14</name>
              <description>Data input from DIO 14</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO13</name>
              <description>Data input from DIO 13</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO12</name>
              <description>Data input from DIO 12</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO11</name>
              <description>Data input from DIO 11</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO10</name>
              <description>Data input from DIO 10</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO9</name>
              <description>Data input from DIO 9</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO8</name>
              <description>Data input from DIO 8</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO7</name>
              <description>Data input from DIO 7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO6</name>
              <description>Data input from DIO 6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO5</name>
              <description>Data input from DIO 5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO4</name>
              <description>Data input from DIO 4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO3</name>
              <description>Data input from DIO 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO2</name>
              <description>Data input from DIO 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO1</name>
              <description>Data input from DIO 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIO0</name>
              <description>Data input from DIO 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
