wezm/dslite2svd/svd/cc2650f128-vendor.xml
      </registers>
    </peripheral>
    <!-- ../Modules/CC26xx/CC2650/GPT.xml -->
    <peripheral>
      <name>GPT0</name>
      <description>General Purpose Timer.

</description>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>CFG</name>
          <displayName>CFG</displayName>
          <description>Configuration</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>3</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG</name>
              <description>GPT Configuration
0x2- 0x3 - Reserved
0x5- 0x7 - Reserved</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_16BIT_TIMER</name>
                  <description>16-bit timer configuration.  
Configure for two 16-bit timers.
Also see TAMR.TAMR and TBMR.TBMR.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32BIT_TIMER</name>
                  <description>32-bit timer configuration</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMR</name>
          <displayName>TAMR</displayName>
          <description>Timer A Mode

</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TCACT</name>
              <description>Timer Compare Action Select 
</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRSET_ON_TO</name>
                  <description>Clear CCP output pin immediately and set on Time-Out</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETCLR_ON_TO</name>
                  <description>Set CCP output pin immediately and clear on Time-Out</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRTOG_ON_TO</name>
                  <description>Clear CCP output pin immediately and toggle on Time-Out</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETTOG_ON_TO</name>
                  <description>Set CCP output pin immediately and toggle on Time-Out</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_ON_TO</name>
                  <description>Set CCP output pin on Time-Out </description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_ON_TO</name>
                  <description>Clear CCP output pin on Time-Out</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOG_ON_TO</name>
                  <description>Toggle State on Time-Out</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS_CMP</name>
                  <description>Disable compare operations</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TACINTD</name>
              <description>One-Shot/Periodic Interrupt Disable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS_TO_INTR</name>
                  <description>Time-out interrupt are disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_TO_INTR</name>
                  <description>Time-out interrupt function as normal</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAPLO</name>
              <description>GPTM Timer A PWM Legacy Operation

0  Legacy operation with CCP pin driven Low when the TAILR 
register is reloaded after the timer reaches 0.

1 CCP is driven High when the TAILR  register is reloaded after the timer reaches 0.

This bit is only valid in PWM mode.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCP_ON_TO</name>
                  <description>CCP output pin is set to 1 on time-out</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEGACY</name>
                  <description>Legacy operation</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAMRSU</name>
              <description>Timer A Match Register Update mode
 
