wezm/dslite2svd/svd/cc2650f128-vendor.xml
0: The received data byte is not acknowledged automatically by the master.
1: The received data byte is acknowledged automatically by the master.

This bit-field must be cleared when the I2C bus controller requires no further data to be transmitted from the slave transmitter.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable acknowledge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable acknowledge</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP</name>
              <description>This bit-field determines if the cycle stops at the end of the data cycle or continues on to a repeated START condition.

0: The controller does not generate the Stop condition.
1: The controller generates the Stop condition.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable STOP</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable STOP</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START</name>
              <description>This bit-field generates the Start or Repeated Start condition. 

0: The controller does not generate the Start condition.
1: The controller generates the Start condition.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable START</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable START</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUN</name>
              <description>I2C master enable

0: The master is disabled.
1: The master is enabled to transmit or receive data.
</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable Master</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable Master</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MDR</name>
          <displayName>MDR</displayName>
          <description>Master Data
This register contains the data to be transmitted when in the Master Transmit state and the data received when in the Master Receive state.</description>
          <addressOffset>0x808</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>8</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA</name>
              <description>When Read: Last RX Data is returned
When Written: Data is transferred during TX  transaction</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MTPR</name>
          <displayName>MTPR</displayName>
          <description>I2C Master Timer Period
This register specifies the period of the SCL clock.</description>
          <addressOffset>0x80c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>8</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TPR_7</name>
              <description>Must be set to 0 to set TPR. If set to 1, a write to TPR will be ignored. </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TPR</name>
              <description>SCL clock period
This field specifies the period of the SCL clock.
SCL_PRD = 2*(1+TPR)*(SCL_LP + SCL_HP)*CLK_PRD
where:
SCL_PRD is the SCL line period (I2C clock).
TPR is the timer period register value (range of 1 to 127)
SCL_LP is the SCL low period (fixed at 6).
SCL_HP is the SCL high period (fixed at 4).
CLK_PRD is the system clock period in ns.</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIMR</name>
          <displayName>MIMR</displayName>
          <description>Master Interrupt Mask
This register controls whether a raw interrupt is promoted to a controller interrupt.</description>
          <addressOffset>0x810</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>IM</name>
              <description>Interrupt mask

0: The MRIS.RIS interrupt is suppressed and not sent to the interrupt controller.
1: The master interrupt is sent to the interrupt controller when the MRIS.RIS is set.
</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable Interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MRIS</name>
          <displayName>MRIS</displayName>
          <description>Master Raw Interrupt Status
This register show the unmasked interrupt status.</description>
          <addressOffset>0x814</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RIS</name>
              <description>Raw interrupt status

0: No interrupt
1: A master interrupt is pending.

This bit is cleared by writing 1 to the MICR.IC bit .</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MMIS</name>
          <displayName>MMIS</displayName>
          <description>Master Masked Interrupt Status
This register show which interrupt is active (based on result from MRIS and MIMR).</description>
          <addressOffset>0x818</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MIS</name>
              <description>Masked interrupt status

