wezm/dslite2svd/svd/cc2650f128-vendor.xml
Note: If IO is configured for AUX  ie. PORT_ID = 0x08, the enable will be ignored.</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>WU_CFG</name>
              <description>If DIO is configured GPIO or non-AON peripheral signals, i.e. PORT_ID 0x00 or &gt;0x08:

00: No wake-up
01: No wake-up
10: Wakes up from shutdown if this pad is going low.
11: Wakes up from shutdown if this pad is going high.

If IO is configured for AON peripheral signals or AUX  ie. PORT_ID 0x01-0x08, this register only sets wakeup enable or not. 

00, 01: Wakeup disabled
10, 11: Wakeup enabled 

Polarity is controlled from AON registers.

Note:When the MSB is set, the IOC will deactivate the output enable for the DIO.</description>
              <lsb>27</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>IOMODE</name>
              <description>IO Mode 
N/A for IO configured for AON periph. signals and AUX  ie. PORT_ID 0x01-0x08 
AUX has its own open_source/drain configuration. 

0x2: Reserved. Undefined behavior.
0x3: Reserved. Undefined behavior.
</description>
              <lsb>24</lsb>
              <msb>26</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPENSRC_INV</name>
                  <description>Open Source
Inverted input / output

</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPENSRC</name>
                  <description>Open Source
Normal input / output

</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPENDR_INV</name>
                  <description>Open Drain
Inverted input / output

</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPENDR</name>
                  <description>Open Drain, 
Normal input / output

</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Inverted input / ouput

</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal input / output

</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED19</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>19</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGE_IRQ_EN</name>
              <description>0: No interrupt generation 
1: Enable interrupt generation for this IO (Only effective if EDGE_DET is enabled) 

</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGE_DET</name>
              <description>Enable generation of edge detection events on this IO 

</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Positive and negative edge detection</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POS</name>
                  <description>Positive edge detection</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEG</name>
                  <description>Negative edge detection</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No edge detection</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED15</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PULL_CTL</name>
              <description>Pull control</description>
              <lsb>13</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>No pull</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP</name>
                  <description>Pull up</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DWN</name>
                  <description>Pull down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEW_RED</name>
              <description>0: Normal slew rate
1: Enables reduced slew rate in output driver.
</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>IOCURR</name>
              <description>Selects IO current mode of this IO.

</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_4_8MA</name>
                  <description>Extended-Current (EC) mode: Min 8 mA for double drive strength IOs (min 4 mA for normal IOs) when IOSTR is set to AUTO</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4MA</name>
                  <description>High-Current (HC) mode: Min 4 mA when IOSTR is set to AUTO</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2MA</name>
                  <description>Low-Current (LC) mode: Min 2 mA when IOSTR is set to AUTO</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOSTR</name>
              <description>Select source for drive strength control of this IO.
This setting controls the drive strength of the Low-Current (LC) mode. Higher drive strength can be selected in IOCURR</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAX</name>
                  <description>Maximum drive strength, controlled by AON_IOC:IOSTRMAX (min 2 mA @1.8V with default values)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MED</name>
                  <description>Medium drive strength, controlled by AON_IOC:IOSTRMED (min 2 mA @2.5V with default values)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>Minimum drive strength, controlled by AON_IOC:IOSTRMIN (min 2 mA @3.3V with default values)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO</name>
                  <description>Automatic drive strength, controlled by AON BATMON based on battery voltage. (min 2 mA @VDDS)</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PORT_ID</name>
              <description>Selects usage for DIO6</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RFC_SMI_CL_IN</name>
                  <description>RF Core SMI Command Link In</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_SMI_CL_OUT</name>
                  <description>RF Core SMI Command Link Out</description>
                  <value>0x37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_SMI_DL_IN</name>
                  <description>RF Core SMI Data Link In</description>
                  <value>0x36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_SMI_DL_OUT</name>
                  <description>RF Core SMI Data Link Out</description>
                  <value>0x35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPI1</name>
                  <description>RF Core Data In 1</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPI0</name>
                  <description>RF Core Data In 0</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPO3</name>
                  <description>RF Core Data Out 3</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPO2</name>
                  <description>RF Core Data Out 2</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPO1</name>
                  <description>RF Core Data Out 1</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_GPO0</name>
                  <description>RF Core Data Out 0</description>
                  <value>0x2f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_TRC</name>
                  <description>RF Core Trace</description>
                  <value>0x2e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_MCLK</name>
                  <description>I2S MCLK </description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_BCLK</name>
                  <description>I2S BCLK </description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_WCLK</name>
                  <description>I2S WCLK </description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_AD1</name>
                  <description>I2S Data 1</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_AD0</name>
                  <description>I2S Data 0</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI1_CLK</name>
                  <description>SSI1 CLK</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI1_FSS</name>
                  <description>SSI1 FSS </description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI1_TX</name>
                  <description>SSI1 TX </description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI1_RX</name>
                  <description>SSI1 RX </description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU_SWV</name>
                  <description>CPU SWV </description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT7</name>
                  <description>PORT EVENT 7
Can be used as a general purpose IO event by selecting it via registers in the EVENT module, e.g. EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, etc</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT6</name>
                  <description>PORT EVENT 6
Can be used as a general purpose IO event by selecting it via registers in the EVENT module, e.g. EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, etc</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT5</name>
                  <description>PORT EVENT 5
Can be used as a general purpose IO event by selecting it via registers in the EVENT module, e.g. EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, etc</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT4</name>
                  <description>PORT EVENT 4
Can be used as a general purpose IO event by selecting it via registers in the EVENT module, e.g. EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, etc</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT3</name>
                  <description>PORT EVENT 3
Can be used as a general purpose IO event by selecting it via registers in the EVENT module, e.g. EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, etc</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT2</name>
                  <description>PORT EVENT 2
Can be used as a general purpose IO event by selecting it via registers in the EVENT module, e.g. EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, etc</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT1</name>
                  <description>PORT EVENT 1
Can be used as a general purpose IO event by selecting it via registers in the EVENT module, e.g. EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, etc</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT0</name>
                  <description>PORT EVENT 0
Can be used as a general purpose IO event by selecting it via registers in the EVENT module, e.g. EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, etc</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RTS</name>
                  <description>UART0 RTS </description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_CTS</name>
                  <description>UART0 CTS </description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_TX</name>
                  <description>UART0 TX </description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RX</name>
                  <description>UART0 RX </description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MSSCL</name>
                  <description>I2C Clock</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MSSDA</name>
                  <description>I2C Data</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0_CLK</name>
                  <description>SSI0 CLK</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0_FSS</name>
                  <description>SSI0 FSS </description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0_TX</name>
                  <description>SSI0 TX </description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0_RX</name>
                  <description>SSI0 RX </description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_IO</name>
                  <description>AUX IO </description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_CLK32K</name>
                  <description>AON 32 KHz clock (SCLK_LF)</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>General Purpose IO </description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCFG7</name>
          <displayName>IOCFG7</displayName>
          <description>Configuration of DIO7</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED31</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HYST_EN</name>
              <description>0: Input hysteresis disable
1: Input hysteresis enable</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>IE</name>
              <description>0: Input disabled
1: Input enabled

