wezm/dslite2svd/svd/cc2650f128-vendor.xml
Registers that needs to be followed by LOAD before settings being applied are:
- RFCCLKG
- VIMSCLKG
- SECDMACLKGR
- SECDMACLKGS
- SECDMACLKGDS
- GPIOCLKGR
- GPIOCLKGS
- GPIOCLKGDS
- GPTCLKGR
- GPTCLKGS
- GPTCLKGDS
- GPTCLKDIV
- I2CCLKGR
- I2CCLKGS
- I2CCLKGDS
- SSICLKGR
- SSICLKGS
- SSICLKGDS
- UARTCLKGR
- UARTCLKGS
- UARTCLKGDS
- I2SCLKGR
- I2SCLKGS
- I2SCLKGDS
- I2SBCLKSEL
- I2SCLKCTL
- I2SMCLKDIV
- I2SBCLKDIV
- I2SWCLKDIV</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFCCLKG</name>
          <displayName>RFCCLKG</displayName>
          <description>RFC Clock Gate</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>
0: Disable clock
1: Enable clock if RFC power domain is on

For changes to take effect, CLKLOADCTL.LOAD needs to be written

</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VIMSCLKG</name>
          <displayName>VIMSCLKG</displayName>
          <description>VIMS Clock Gate</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>
00: Disable clock 
01: Disable clock when system CPU is in DeepSleep 
11: Enable clock  

For changes to take effect, CLKLOADCTL.LOAD needs to be written  </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SECDMACLKGR</name>
          <displayName>SECDMACLKGR</displayName>
          <description>TRNG, CRYPTO And UDMA Clock Gate For Run Mode</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>9</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_CLK_EN</name>
              <description>
0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written

</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>2</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TRNG_CLK_EN</name>
              <description>
0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written

</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CRYPTO_CLK_EN</name>
              <description>
0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written

</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SECDMACLKGS</name>
          <displayName>SECDMACLKGS</displayName>
          <description>TRNG, CRYPTO And UDMA Clock Gate For Sleep Mode</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>9</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_CLK_EN</name>
              <description>
0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written

</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>2</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TRNG_CLK_EN</name>
              <description>
0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written

</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CRYPTO_CLK_EN</name>
              <description>
0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written

</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SECDMACLKGDS</name>
          <displayName>SECDMACLKGDS</displayName>
          <description>TRNG, CRYPTO And UDMA Clock Gate For Deep Sleep Mode</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>9</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_CLK_EN</name>
              <description>
0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written

</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>2</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TRNG_CLK_EN</name>
              <description>
0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written

</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CRYPTO_CLK_EN</name>
              <description>
0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written

</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOCLKGR</name>
          <displayName>GPIOCLKGR</displayName>
          <description>GPIO Clock Gate For Run Mode</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>
0: Disable clock
1: Enable clock

