wezm/dslite2svd/svd/cc2650f128-vendor.xml
For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOCLKGS</name>
          <displayName>GPIOCLKGS</displayName>
          <description>GPIO Clock Gate For Sleep Mode</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>
0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written

</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOCLKGDS</name>
          <displayName>GPIOCLKGDS</displayName>
          <description>GPIO Clock Gate For Deep Sleep Mode</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>
0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written

</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPTCLKGR</name>
          <displayName>GPTCLKGR</displayName>
          <description>GPT Clock Gate For Run Mode</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>4</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>Each bit below has the following meaning:

0: Disable clock
1: Enable clock

ENUMs can be combined
For changes to take effect, CLKLOADCTL.LOAD needs to be written

</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT3</name>
                  <description>Enable clock for GPT3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2</name>
                  <description>Enable clock for GPT2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1</name>
                  <description>Enable clock for GPT1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0</name>
                  <description>Enable clock for GPT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPTCLKGS</name>
          <displayName>GPTCLKGS</displayName>
          <description>GPT Clock Gate For Sleep Mode</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>4</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>Each bit below has the following meaning:

0: Disable clock
1: Enable clock

ENUMs can be combined
For changes to take effect, CLKLOADCTL.LOAD needs to be written

</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT3</name>
                  <description>Enable clock for GPT3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2</name>
                  <description>Enable clock for GPT2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1</name>
                  <description>Enable clock for GPT1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0</name>
                  <description>Enable clock for GPT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPTCLKGDS</name>
          <displayName>GPTCLKGDS</displayName>
          <description>GPT Clock Gate For Deep Sleep Mode</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>4</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>Each bit below has the following meaning:

