wezm/dslite2svd/svd/cc2650f128-vendor.xml
0: Disable clock
1: Enable clock

ENUMs can be combined
For changes to take effect, CLKLOADCTL.LOAD needs to be written

</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT3</name>
                  <description>Enable clock for GPT3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2</name>
                  <description>Enable clock for GPT2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1</name>
                  <description>Enable clock for GPT1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0</name>
                  <description>Enable clock for GPT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>I2CCLKGR</name>
          <displayName>I2CCLKGR</displayName>
          <description>I2C Clock Gate For Run Mode</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>
0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2CCLKGS</name>
          <displayName>I2CCLKGS</displayName>
          <description>I2C Clock Gate For Sleep Mode</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>
0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written

</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2CCLKGDS</name>
          <displayName>I2CCLKGDS</displayName>
          <description>I2C Clock Gate For Deep Sleep Mode</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>
0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written

</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UARTCLKGR</name>
          <displayName>UARTCLKGR</displayName>
          <description>UART Clock Gate For Run Mode</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>
0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written

</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UARTCLKGS</name>
          <displayName>UARTCLKGS</displayName>
          <description>UART Clock Gate For Sleep Mode</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>
0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written

</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UARTCLKGDS</name>
          <displayName>UARTCLKGDS</displayName>
          <description>UART Clock Gate For Deep Sleep Mode</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>
0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written

</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSICLKGR</name>
          <displayName>SSICLKGR</displayName>
          <description>SSI Clock Gate For Run Mode</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>
0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written

</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI1</name>
                  <description>Enable clock for SSI1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0</name>
                  <description>Enable clock for SSI0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SSICLKGS</name>
          <displayName>SSICLKGS</displayName>
          <description>SSI Clock Gate For Sleep Mode</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>
0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written

</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI1</name>
                  <description>Enable clock for SSI1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0</name>
                  <description>Enable clock for SSI0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SSICLKGDS</name>
          <displayName>SSICLKGDS</displayName>
          <description>SSI Clock Gate For Deep Sleep Mode</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>
0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written

</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI1</name>
                  <description>Enable clock for SSI1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0</name>
                  <description>Enable clock for SSI0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>I2SCLKGR</name>
          <displayName>I2SCLKGR</displayName>
          <description>I2S Clock Gate For Run Mode</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>
0: Disable clock
1: Enable clock

