wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>RFCMODESEL</name>
          <displayName>RFCMODESEL</displayName>
          <description>Selected RFC Mode</description>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>3</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CURR</name>
              <description>Selects the set of commands that the RFC will accept. Only modes permitted by RFCMODEHWOPT.AVAIL are writeable. See the technical reference manual for details.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE7</name>
                  <description>Select Mode 7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE6</name>
                  <description>Select Mode 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE5</name>
                  <description>Select Mode 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE4</name>
                  <description>Select Mode 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE3</name>
                  <description>Select Mode 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE2</name>
                  <description>Select Mode 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE1</name>
                  <description>Select Mode 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE0</name>
                  <description>Select Mode 0</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RFCMODEHWOPT</name>
          <displayName>RFCMODEHWOPT</displayName>
          <description>Allowed RFC Modes</description>
          <addressOffset>0x1d4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>8</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>AVAIL</name>
              <description>Permitted RFC modes. More than one mode can be permitted.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE7</name>
                  <description>Mode 7 permitted</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE6</name>
                  <description>Mode 6 permitted</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE5</name>
                  <description>Mode 5 permitted</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE4</name>
                  <description>Mode 4 permitted</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE3</name>
                  <description>Mode 3 permitted</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE2</name>
                  <description>Mode 2 permitted</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE1</name>
                  <description>Mode 1 permitted</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE0</name>
                  <description>Mode 0 permitted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRPROFSTAT</name>
          <displayName>PWRPROFSTAT</displayName>
          <description>Power Profiler Register</description>
          <addressOffset>0x1e0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>8</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VALUE</name>
              <description>SW can use these bits to timestamp the application. These bits are also available through the testtap and can thus be used by the emulator to profile in real time.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMRETEN</name>
          <displayName>RAMRETEN</displayName>
          <description>Memory Retention Control</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>3</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RFC</name>
              <description>
0: Retention for RFC SRAM disabled
1: Retention for RFC SRAM enabled
    
