wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>RFCPEISL</name>
          <displayName>RFCPEISL</displayName>
          <description>Interrupt Vector Selection For Command and Packet Engine Generated Interrupts</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTERNAL_ERROR</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.INTERNAL_ERROR interrupt should use.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOT_DONE</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.BOOT_DONE interrupt should use.</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODULES_UNLOCKED</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.MODULES_UNLOCKED interrupt should use.</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNTH_NO_LOCK</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.SYNTH_NO_LOCK interrupt should use.</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQ27</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.IRQ27 interrupt should use.</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_ABORTED</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.RX_ABORTED interrupt should use.</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_N_DATA_WRITTEN</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.RX_N_DATA_WRITTEN interrupt should use.</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_DATA_WRITTEN</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.RX_DATA_WRITTEN interrupt should use.</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_ENTRY_DONE</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.RX_ENTRY_DONE interrupt should use.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_BUF_FULL</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.RX_BUF_FULL interrupt should use.</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_CTRL_ACK</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.RX_CTRL_ACK interrupt should use.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_CTRL</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.RX_CTRL interrupt should use.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_EMPTY</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.RX_EMPTY interrupt should use.</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_IGNORED</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.RX_IGNORED interrupt should use.</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_NOK</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.RX_NOK interrupt should use.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_OK</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.RX_OK interrupt should use.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQ15</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.IRQ15 interrupt should use.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQ14</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.IRQ14 interrupt should use.</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQ13</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.IRQ13 interrupt should use.</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQ12</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.IRQ12 interrupt should use.</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_BUFFER_CHANGED</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.TX_BUFFER_CHANGED interrupt should use.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_ENTRY_DONE</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.TX_ENTRY_DONE interrupt should use.</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_RETRANS</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.TX_RETRANS interrupt should use.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_CTRL_ACK_ACK</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.TX_CTRL_ACK_ACK interrupt should use.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
