wezm/dslite2svd/svd/cc2650f128-vendor.xml
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_CTRL_ACK</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.TX_CTRL_ACK interrupt should use.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_CTRL</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.TX_CTRL interrupt should use.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_ACK</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.TX_ACK interrupt should use.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_DONE</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.TX_DONE interrupt should use.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAST_FG_COMMAND_DONE</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.LAST_FG_COMMAND_DONE interrupt should use.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FG_COMMAND_DONE</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.FG_COMMAND_DONE interrupt should use.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAST_COMMAND_DONE</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.LAST_COMMAND_DONE interrupt should use.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMMAND_DONE</name>
              <description>Select which CPU interrupt vector the RFCPEIFG.COMMAND_DONE interrupt should use.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RFACKIFG</name>
          <displayName>RFACKIFG</displayName>
          <description>Doorbell Command Acknowledgement Interrupt Flag</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ACKFLAG</name>
              <description>Interrupt flag for Command ACK</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
