wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>SYSGPOCTL</name>
          <displayName>SYSGPOCTL</displayName>
          <description>RF Core General Purpose Output Control</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GPOCTL3</name>
              <description>RF Core GPO control bit 3. Selects which signal to output on the RF Core GPO line 3.</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RATGPO3</name>
                  <description>RAT GPO line 3</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO2</name>
                  <description>RAT GPO line 2</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO1</name>
                  <description>RAT GPO line 1</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO0</name>
                  <description>RAT GPO line 0</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO3</name>
                  <description>RFE GPO line 3</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO2</name>
                  <description>RFE GPO line 2</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO1</name>
                  <description>RFE GPO line 1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO0</name>
                  <description>RFE GPO line 0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO3</name>
                  <description>MCE GPO line 3</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO2</name>
                  <description>MCE GPO line 2</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO1</name>
                  <description>MCE GPO line 1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO0</name>
                  <description>MCE GPO line 0</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO3</name>
                  <description>CPE GPO line 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO2</name>
                  <description>CPE GPO line 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO1</name>
                  <description>CPE GPO line 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO0</name>
                  <description>CPE GPO line 0</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPOCTL2</name>
              <description>RF Core GPO control bit 2. Selects which signal to output on the RF Core GPO line 2.</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RATGPO3</name>
                  <description>RAT GPO line 3</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO2</name>
                  <description>RAT GPO line 2</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO1</name>
                  <description>RAT GPO line 1</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO0</name>
                  <description>RAT GPO line 0</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO3</name>
                  <description>RFE GPO line 3</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO2</name>
                  <description>RFE GPO line 2</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO1</name>
                  <description>RFE GPO line 1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO0</name>
                  <description>RFE GPO line 0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO3</name>
                  <description>MCE GPO line 3</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO2</name>
                  <description>MCE GPO line 2</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO1</name>
                  <description>MCE GPO line 1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO0</name>
                  <description>MCE GPO line 0</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO3</name>
                  <description>CPE GPO line 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO2</name>
                  <description>CPE GPO line 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO1</name>
                  <description>CPE GPO line 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO0</name>
                  <description>CPE GPO line 0</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPOCTL1</name>
              <description>RF Core GPO control bit 1. Selects which signal to output on the RF Core GPO line 1.</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RATGPO3</name>
                  <description>RAT GPO line 3</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO2</name>
                  <description>RAT GPO line 2</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO1</name>
                  <description>RAT GPO line 1</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO0</name>
                  <description>RAT GPO line 0</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO3</name>
                  <description>RFE GPO line 3</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO2</name>
                  <description>RFE GPO line 2</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO1</name>
                  <description>RFE GPO line 1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO0</name>
                  <description>RFE GPO line 0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO3</name>
                  <description>MCE GPO line 3</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO2</name>
                  <description>MCE GPO line 2</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO1</name>
                  <description>MCE GPO line 1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO0</name>
                  <description>MCE GPO line 0</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO3</name>
                  <description>CPE GPO line 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO2</name>
                  <description>CPE GPO line 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO1</name>
                  <description>CPE GPO line 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO0</name>
                  <description>CPE GPO line 0</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPOCTL0</name>
              <description>RF Core GPO control bit 0. Selects which signal to output on the RF Core GPO line 0.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RATGPO3</name>
                  <description>RAT GPO line 3</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO2</name>
                  <description>RAT GPO line 2</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO1</name>
                  <description>RAT GPO line 1</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO0</name>
                  <description>RAT GPO line 0</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO3</name>
                  <description>RFE GPO line 3</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO2</name>
                  <description>RFE GPO line 2</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO1</name>
                  <description>RFE GPO line 1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO0</name>
                  <description>RFE GPO line 0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO3</name>
                  <description>MCE GPO line 3</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO2</name>
                  <description>MCE GPO line 2</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO1</name>
                  <description>MCE GPO line 1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO0</name>
                  <description>MCE GPO line 0</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO3</name>
                  <description>CPE GPO line 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO2</name>
                  <description>CPE GPO line 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO1</name>
                  <description>CPE GPO line 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO0</name>
                  <description>CPE GPO line 0</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
