wezm/dslite2svd/svd/cc2650f128-vendor.xml
      </registers>
    </peripheral>
    <!-- ../Modules/CC26xx/CC2650/SMPH.xml -->
    <peripheral>
      <name>SMPH</name>
      <description>MCU Semaphore Module

This module provides 32 binary semaphores. The state of a binary semaphore is either taken or available. 

A semaphore does not implement any ownership attribute. Still, a semaphore can be used to handle mutual exclusion scenarios.

</description>
      <baseAddress>0x40084000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>SMPH0</name>
          <displayName>SMPH0</displayName>
          <description>MCU SEMAPHORE 0</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH1</name>
          <displayName>SMPH1</displayName>
          <description>MCU SEMAPHORE 1</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH2</name>
          <displayName>SMPH2</displayName>
          <description>MCU SEMAPHORE 2</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH3</name>
          <displayName>SMPH3</displayName>
          <description>MCU SEMAPHORE 3</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH4</name>
          <displayName>SMPH4</displayName>
          <description>MCU SEMAPHORE 4</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH5</name>
          <displayName>SMPH5</displayName>
          <description>MCU SEMAPHORE 5</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH6</name>
          <displayName>SMPH6</displayName>
          <description>MCU SEMAPHORE 6</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH7</name>
          <displayName>SMPH7</displayName>
          <description>MCU SEMAPHORE 7</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH8</name>
          <displayName>SMPH8</displayName>
          <description>MCU SEMAPHORE 8</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH9</name>
          <displayName>SMPH9</displayName>
          <description>MCU SEMAPHORE 9</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH10</name>
          <displayName>SMPH10</displayName>
          <description>MCU SEMAPHORE 10</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH11</name>
          <displayName>SMPH11</displayName>
          <description>MCU SEMAPHORE 11</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH12</name>
          <displayName>SMPH12</displayName>
          <description>MCU SEMAPHORE 12</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH13</name>
          <displayName>SMPH13</displayName>
          <description>MCU SEMAPHORE 13</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH14</name>
          <displayName>SMPH14</displayName>
          <description>MCU SEMAPHORE 14</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH15</name>
          <displayName>SMPH15</displayName>
          <description>MCU SEMAPHORE 15</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH16</name>
          <displayName>SMPH16</displayName>
          <description>MCU SEMAPHORE 16</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH17</name>
          <displayName>SMPH17</displayName>
          <description>MCU SEMAPHORE 17</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH18</name>
          <displayName>SMPH18</displayName>
          <description>MCU SEMAPHORE 18</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH19</name>
          <displayName>SMPH19</displayName>
          <description>MCU SEMAPHORE 19</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH20</name>
          <displayName>SMPH20</displayName>
          <description>MCU SEMAPHORE 20</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH21</name>
          <displayName>SMPH21</displayName>
          <description>MCU SEMAPHORE 21</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH22</name>
          <displayName>SMPH22</displayName>
          <description>MCU SEMAPHORE 22</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
