wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>SMPH23</name>
          <displayName>SMPH23</displayName>
          <description>MCU SEMAPHORE 23</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH24</name>
          <displayName>SMPH24</displayName>
          <description>MCU SEMAPHORE 24</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH25</name>
          <displayName>SMPH25</displayName>
          <description>MCU SEMAPHORE 25</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH26</name>
          <displayName>SMPH26</displayName>
          <description>MCU SEMAPHORE 26</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH27</name>
          <displayName>SMPH27</displayName>
          <description>MCU SEMAPHORE 27</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH28</name>
          <displayName>SMPH28</displayName>
          <description>MCU SEMAPHORE 28</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH29</name>
          <displayName>SMPH29</displayName>
          <description>MCU SEMAPHORE 29</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH30</name>
          <displayName>SMPH30</displayName>
          <description>MCU SEMAPHORE 30</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH31</name>
          <displayName>SMPH31</displayName>
          <description>MCU SEMAPHORE 31</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK0</name>
          <displayName>PEEK0</displayName>
          <description>MCU SEMAPHORE 0 ALIAS</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK1</name>
          <displayName>PEEK1</displayName>
          <description>MCU SEMAPHORE 1 ALIAS</description>
          <addressOffset>0x804</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK2</name>
          <displayName>PEEK2</displayName>
          <description>MCU SEMAPHORE 2 ALIAS</description>
          <addressOffset>0x808</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK3</name>
          <displayName>PEEK3</displayName>
          <description>MCU SEMAPHORE 3 ALIAS</description>
          <addressOffset>0x80c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK4</name>
          <displayName>PEEK4</displayName>
          <description>MCU SEMAPHORE 4 ALIAS</description>
          <addressOffset>0x810</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK5</name>
          <displayName>PEEK5</displayName>
          <description>MCU SEMAPHORE 5 ALIAS</description>
          <addressOffset>0x814</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK6</name>
          <displayName>PEEK6</displayName>
          <description>MCU SEMAPHORE 6 ALIAS</description>
          <addressOffset>0x818</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK7</name>
          <displayName>PEEK7</displayName>
          <description>MCU SEMAPHORE 7 ALIAS</description>
          <addressOffset>0x81c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK8</name>
          <displayName>PEEK8</displayName>
          <description>MCU SEMAPHORE 8 ALIAS</description>
          <addressOffset>0x820</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK9</name>
          <displayName>PEEK9</displayName>
          <description>MCU SEMAPHORE 9 ALIAS</description>
          <addressOffset>0x824</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK10</name>
          <displayName>PEEK10</displayName>
          <description>MCU SEMAPHORE 10 ALIAS</description>
          <addressOffset>0x828</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK11</name>
          <displayName>PEEK11</displayName>
          <description>MCU SEMAPHORE 11 ALIAS</description>
          <addressOffset>0x82c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK12</name>
          <displayName>PEEK12</displayName>
          <description>MCU SEMAPHORE 12 ALIAS</description>
          <addressOffset>0x830</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK13</name>
          <displayName>PEEK13</displayName>
          <description>MCU SEMAPHORE 13 ALIAS</description>
          <addressOffset>0x834</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
