wezm/dslite2svd/svd/cc2650f128-vendor.xml
        <register>
          <name>PEEK14</name>
          <displayName>PEEK14</displayName>
          <description>MCU SEMAPHORE 14 ALIAS</description>
          <addressOffset>0x838</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK15</name>
          <displayName>PEEK15</displayName>
          <description>MCU SEMAPHORE 15 ALIAS</description>
          <addressOffset>0x83c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK16</name>
          <displayName>PEEK16</displayName>
          <description>MCU SEMAPHORE 16 ALIAS</description>
          <addressOffset>0x840</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK17</name>
          <displayName>PEEK17</displayName>
          <description>MCU SEMAPHORE 17 ALIAS</description>
          <addressOffset>0x844</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK18</name>
          <displayName>PEEK18</displayName>
          <description>MCU SEMAPHORE 18 ALIAS</description>
          <addressOffset>0x848</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK19</name>
          <displayName>PEEK19</displayName>
          <description>MCU SEMAPHORE 19 ALIAS</description>
          <addressOffset>0x84c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK20</name>
          <displayName>PEEK20</displayName>
          <description>MCU SEMAPHORE 20 ALIAS</description>
          <addressOffset>0x850</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK21</name>
          <displayName>PEEK21</displayName>
          <description>MCU SEMAPHORE 21 ALIAS</description>
          <addressOffset>0x854</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK22</name>
          <displayName>PEEK22</displayName>
          <description>MCU SEMAPHORE 22 ALIAS</description>
          <addressOffset>0x858</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK23</name>
          <displayName>PEEK23</displayName>
          <description>MCU SEMAPHORE 23 ALIAS</description>
          <addressOffset>0x85c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK24</name>
          <displayName>PEEK24</displayName>
          <description>MCU SEMAPHORE 24 ALIAS</description>
          <addressOffset>0x860</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK25</name>
          <displayName>PEEK25</displayName>
          <description>MCU SEMAPHORE 25 ALIAS</description>
          <addressOffset>0x864</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK26</name>
          <displayName>PEEK26</displayName>
          <description>MCU SEMAPHORE 26 ALIAS</description>
          <addressOffset>0x868</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK27</name>
          <displayName>PEEK27</displayName>
          <description>MCU SEMAPHORE 27 ALIAS</description>
          <addressOffset>0x86c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK28</name>
          <displayName>PEEK28</displayName>
          <description>MCU SEMAPHORE 28 ALIAS</description>
          <addressOffset>0x870</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK29</name>
          <displayName>PEEK29</displayName>
          <description>MCU SEMAPHORE 29 ALIAS</description>
          <addressOffset>0x874</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK30</name>
          <displayName>PEEK30</displayName>
          <description>MCU SEMAPHORE 30 ALIAS</description>
          <addressOffset>0x878</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK31</name>
          <displayName>PEEK31</displayName>
          <description>MCU SEMAPHORE 31 ALIAS</description>
          <addressOffset>0x87c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STAT</name>
              <description>Status when reading:

0: Semaphore is taken
1: Semaphore is available 

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
