wezm/dslite2svd/svd/cc2650f128-vendor.xml
      </registers>
    </peripheral>
    <!-- ../Modules/CC26xx/CC2650/CC26xx_JSTATE_2_NotVisible.xml -->
    <peripheral>
      <name></name>
      <version>2.0</version>
      <description>JSTATE decoding</description>
      <baseAddress>0x0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>00</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>JSTATE4</name>
          <displayName>JSTATE4</displayName>
          <description>Digital JTAG State Register</description>
          <addressOffset>0x0</addressOffset>
          <size>64</size>
          <fields>
            <field>
              <name>MODACT0</name>
              <description>MCU.MCU_VD%V_DOMAIN</description>
              <lsb>21</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODACT1</name>
              <description>MCU.VIMS_PD</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODACT2</name>
              <description>MCU.RFCORE_PD</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODACT3</name>
              <description>MCU.PERIPH_PD</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODACT4</name>
              <description>MCU.SERIAL_PD</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODACT5</name>
              <description>MCU.CPU_PD</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODACT6</name>
              <description>AON.AUX_PD%V_DOMAIN</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODACT7</name>
              <description>Interrupts%HWI</description>
              <lsb>30</lsb>
              <msb>35</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODACT8</name>
              <description>USER_DATA</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODACT9</name>
              <description>OBS_SIG.0</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODACT10</name>
              <description>OBS_SIG.1</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODACT11</name>
              <description>OBS_SIG.2</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODACT12</name>
              <description>OBS_SIG.3</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODACT13</name>
              <description>OBS_SIG.4</description>
              <lsb>61</lsb>
              <msb>61</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODACT14</name>
              <description>OBS_SIG.5</description>
              <lsb>62</lsb>
              <msb>62</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODACT15</name>
              <description>OBS_SIG.6</description>
              <lsb>63</lsb>
              <msb>63</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODACT16</name>
              <description>WARM_RESET</description>
              <lsb>58</lsb>
              <msb>58</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODACT17</name>
              <description>PC_Error</description>
              <lsb>57</lsb>
              <msb>57</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PC</name>
              <description>PC</description>
              <lsb>36</lsb>
              <msb>56</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWRSTATE0</name>
              <description>CPU%CORTEXM_PM</description>
              <lsb>59</lsb>
              <msb>60</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWRSTATE1</name>
              <description>RF%LPRF_PM</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWRSTATE2</name>
              <description>Sensor_Controller</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
